TMS320C2000 COFF Assembler PC v4.1.0 Thu Feb 07 18:26:14 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
F:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Ad7663.asm PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.0 *
       3              ;* Date/Time created: Thu Feb 07 18:26:13 2008                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("Ad7663.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.0 Copyright (c) 1996-2005 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("DelayUs"), DW_AT_symbol_name("_DelayUs")
      15                      .dwattr DW$1, DW_AT_declaration(0x01)
      16                      .dwattr DW$1, DW_AT_external(0x01)
      17              DW$2    .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)

    1086                      ; branch occurs ; |215| 
    1087 00000108       L37:    
    1088                      .dwpsn  "Ad7663.c",262,3
    1089              ;----------------------------------------------------------------------
    1090              ; 262 | DelayUs(5); // Delay for 6.25uS to allow input to ADC to settle        
    1091              ;----------------------------------------------------------------------
    1092 00000108 9A05          MOVB      AL,#5                 ; |262| 
    1093 00000109 7640!         LCR       #_DelayUs             ; |262| 
         0000010a 0000 
    1094                      ; call occurs [#_DelayUs] ; |262| 
    1095                      .dwpsn  "Ad7663.c",263,3
    1096              ;----------------------------------------------------------------------
    1097              ; 263 | return TRUE;                                                           
    1098              ;----------------------------------------------------------------------
    1099 0000010b 9A01          MOVB      AL,#1                 ; |263| 
    1100 0000010c       L38:    
    1101                      .dwpsn  "Ad7663.c",266,1
    1102 0000010c FE82          SUBB      SP,#2                 ; |263| 
    1103                      .dwcfa  0x1d, -2
    1104 0000010d 0006          LRETR
    1105                      ; return occurs
    1106                      .dwattr DW$43, DW_AT_end_file("Ad7663.c")
    1107                      .dwattr DW$43, DW_AT_end_line(0x10a)
    1108                      .dwattr DW$43, DW_AT_end_column(0x01)
    1109                      .dwendentry
    1110                      .dwendtag DW$43
    1111              
    1112              ;***************************************************************
    1113              ;* UNDEFINED EXTERNAL REFERENCES                               *
    1114              ;***************************************************************
    1115                      .global _DelayUs
    1116                      .global _TxSpi
    1117                      .global _ConfigSpi
    1118                      .global _SpiTxNotReady
    1119                      .global _RxSpi
    1120                      .global _SpiRxNotReady
    1121                      .global _GpioDataRegs
    1122              
    1123              ;***************************************************************
    1124              ;* TYPE INFORMATION                                            *
    1125              ;***************************************************************
    1126              
    1127              DW$T$70 .dwtag  DW_TAG_subroutine_type
    1128                      .dwattr DW$T$70, DW_AT_language(DW_LANG_C)
    1129              DW$46   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    1130              DW$47   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    1131                      .dwendtag DW$T$70
    1132              
    1133              
    1134              DW$T$72 .dwtag  DW_TAG_subroutine_type
    1135                      .dwattr DW$T$72, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.0 Thu Feb 07 18:26:14 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
F:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Ad7663.asm PAGE   23

    1136              DW$48   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1137                      .dwendtag DW$T$72
    1138              
    1139              
    1140              DW$T$74 .dwtag  DW_TAG_subroutine_type
    1141                      .dwattr DW$T$74, DW_AT_language(DW_LANG_C)
    1142              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
    1143                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1144                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
    1145              
    1146              DW$T$76 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    1147                      .dwattr DW$T$76, DW_AT_language(DW_LANG_C)
    1148              
    1149              DW$T$77 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    1150                      .dwattr DW$T$77, DW_AT_language(DW_LANG_C)
    1151              DW$49   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1152                      .dwendtag DW$T$77
    1153              
    1154              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$11)
    1155                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
    1156              
    1157              DW$T$79 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
    1158                      .dwattr DW$T$79, DW_AT_language(DW_LANG_C)
    1159              
    1160              DW$T$81 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
    1161                      .dwattr DW$T$81, DW_AT_language(DW_LANG_C)
    1162              DW$50   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1163                      .dwendtag DW$T$81
    1164              
    1165              DW$51   .dwtag  DW_TAG_far_type
    1166                      .dwattr DW$51, DW_AT_type(*DW$T$69)
    1167              DW$T$93 .dwtag  DW_TAG_volatile_type
    1168                      .dwattr DW$T$93, DW_AT_type(*DW$51)
    1169              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    1170                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1171                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    1172              
    1173              DW$T$69 .dwtag  DW_TAG_structure_type
    1174                      .dwattr DW$T$69, DW_AT_name("GPIO_DATA_REGS")
    1175                      .dwattr DW$T$69, DW_AT_byte_size(0x20)
    1176              DW$52   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    1177                      .dwattr DW$52, DW_AT_name("GPADAT"), DW_AT_symbol_name("_GPADAT")
    1178                      .dwattr DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1179                      .dwattr DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1180              DW$53   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1181                      .dwattr DW$53, DW_AT_name("GPASET"), DW_AT_symbol_name("_GPASET")
    1182                      .dwattr DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1183                      .dwattr DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1184              DW$54   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    1185                      .dwattr DW$54, DW_AT_name("GPACLEAR"), DW_AT_symbol_name("_GPACLEAR")
    1186                      .dwattr DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1187                      .dwattr DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1188              DW$55   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    1189                      .dwattr DW$55, DW_AT_name("GPATOGGLE"), DW_AT_symbol_name("_GPATOGGLE")
    1190                      .dwattr DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
TMS320C2000 COFF Assembler PC v4.1.0 Thu Feb 07 18:26:14 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
F:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Ad7663.asm PAGE   24

    1191                      .dwattr DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1192              DW$56   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    1193                      .dwattr DW$56, DW_AT_name("GPBDAT"), DW_AT_symbol_name("_GPBDAT")
    1194                      .dwattr DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1195                      .dwattr DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1196              DW$57   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    1197                      .dwattr DW$57, DW_AT_name("GPBSET"), DW_AT_symbol_name("_GPBSET")
    1198                      .dwattr DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1199                      .dwattr DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1200              DW$58   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    1201                      .dwattr DW$58, DW_AT_name("GPBCLEAR"), DW_AT_symbol_name("_GPBCLEAR")
    1202                      .dwattr DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1203                      .dwattr DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1204              DW$59   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    1205                      .dwattr DW$59, DW_AT_name("GPBTOGGLE"), DW_AT_symbol_name("_GPBTOGGLE")
    1206                      .dwattr DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1207                      .dwattr DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1208              DW$60   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    1209                      .dwattr DW$60, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    1210                      .dwattr DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1211                      .dwattr DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1212              DW$61   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    1213                      .dwattr DW$61, DW_AT_name("GPDDAT"), DW_AT_symbol_name("_GPDDAT")
    1214                      .dwattr DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1215                      .dwattr DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1216              DW$62   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    1217                      .dwattr DW$62, DW_AT_name("GPDSET"), DW_AT_symbol_name("_GPDSET")
    1218                      .dwattr DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1219                      .dwattr DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1220              DW$63   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    1221                      .dwattr DW$63, DW_AT_name("GPDCLEAR"), DW_AT_symbol_name("_GPDCLEAR")
    1222                      .dwattr DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1223                      .dwattr DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1224              DW$64   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
    1225                      .dwattr DW$64, DW_AT_name("GPDTOGGLE"), DW_AT_symbol_name("_GPDTOGGLE")
    1226                      .dwattr DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1227                      .dwattr DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1228              DW$65   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
    1229                      .dwattr DW$65, DW_AT_name("GPEDAT"), DW_AT_symbol_name("_GPEDAT")
    1230                      .dwattr DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1231                      .dwattr DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1232              DW$66   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    1233                      .dwattr DW$66, DW_AT_name("GPESET"), DW_AT_symbol_name("_GPESET")
    1234                      .dwattr DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1235                      .dwattr DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1236              DW$67   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    1237                      .dwattr DW$67, DW_AT_name("GPECLEAR"), DW_AT_symbol_name("_GPECLEAR")
    1238                      .dwattr DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1239                      .dwattr DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1240              DW$68   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
    1241                      .dwattr DW$68, DW_AT_name("GPETOGGLE"), DW_AT_symbol_name("_GPETOGGLE")
    1242                      .dwattr DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1243                      .dwattr DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1244              DW$69   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$53)
    1245                      .dwattr DW$69, DW_AT_name("GPFDAT"), DW_AT_symbol_name("_GPFDAT")
TMS320C2000 COFF Assembler PC v4.1.0 Thu Feb 07 18:26:14 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
F:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Ad7663.asm PAGE   25

    1246                      .dwattr DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1247                      .dwattr DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1248              DW$70   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
    1249                      .dwattr DW$70, DW_AT_name("GPFSET"), DW_AT_symbol_name("_GPFSET")
    1250                      .dwattr DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1251                      .dwattr DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1252              DW$71   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
    1253                      .dwattr DW$71, DW_AT_name("GPFCLEAR"), DW_AT_symbol_name("_GPFCLEAR")
    1254                      .dwattr DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1255                      .dwattr DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1256              DW$72   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
    1257                      .dwattr DW$72, DW_AT_name("GPFTOGGLE"), DW_AT_symbol_name("_GPFTOGGLE")
    1258                      .dwattr DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1259                      .dwattr DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1260              DW$73   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
    1261                      .dwattr DW$73, DW_AT_name("GPGDAT"), DW_AT_symbol_name("_GPGDAT")
    1262                      .dwattr DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1263                      .dwattr DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1264              DW$74   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
    1265                      .dwattr DW$74, DW_AT_name("GPGSET"), DW_AT_symbol_name("_GPGSET")
    1266                      .dwattr DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1267                      .dwattr DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1268              DW$75   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    1269                      .dwattr DW$75, DW_AT_name("GPGCLEAR"), DW_AT_symbol_name("_GPGCLEAR")
    1270                      .dwattr DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1271                      .dwattr DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1272              DW$76   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
    1273                      .dwattr DW$76, DW_AT_name("GPGTOGGLE"), DW_AT_symbol_name("_GPGTOGGLE")
    1274                      .dwattr DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1275                      .dwattr DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1276              DW$77   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    1277                      .dwattr DW$77, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    1278                      .dwattr DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1279                      .dwattr DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1280                      .dwendtag DW$T$69
    1281              
    1282              
    1283              DW$T$68 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    1284                      .dwattr DW$T$68, DW_AT_language(DW_LANG_C)
    1285                      .dwattr DW$T$68, DW_AT_byte_size(0x04)
    1286              DW$78   .dwtag  DW_TAG_subrange_type
    1287                      .dwattr DW$78, DW_AT_upper_bound(0x03)
    1288                      .dwendtag DW$T$68
    1289              
    1290              
    1291              DW$T$21 .dwtag  DW_TAG_union_type
    1292                      .dwattr DW$T$21, DW_AT_name("GPADAT_REG")
    1293                      .dwattr DW$T$21, DW_AT_byte_size(0x01)
    1294              DW$79   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1295                      .dwattr DW$79, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1296                      .dwattr DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1297                      .dwattr DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1298              DW$80   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1299                      .dwattr DW$80, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1300                      .dwattr DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.0 Thu Feb 07 18:26:14 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
F:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Ad7663.asm PAGE   26

    1301                      .dwattr DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1302                      .dwendtag DW$T$21
    1303              
    1304              
    1305              DW$T$23 .dwtag  DW_TAG_union_type
    1306                      .dwattr DW$T$23, DW_AT_name("GPASET_REG")
    1307                      .dwattr DW$T$23, DW_AT_byte_size(0x01)
    1308              DW$81   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1309                      .dwattr DW$81, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1310                      .dwattr DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1311                      .dwattr DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1312              DW$82   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1313                      .dwattr DW$82, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1314                      .dwattr DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1315                      .dwattr DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1316                      .dwendtag DW$T$23
    1317              
    1318              
    1319              DW$T$25 .dwtag  DW_TAG_union_type
    1320                      .dwattr DW$T$25, DW_AT_name("GPACLEAR_REG")
    1321                      .dwattr DW$T$25, DW_AT_byte_size(0x01)
    1322              DW$83   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1323                      .dwattr DW$83, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1324                      .dwattr DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1325                      .dwattr DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1326              DW$84   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1327                      .dwattr DW$84, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1328                      .dwattr DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1329                      .dwattr DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1330                      .dwendtag DW$T$25
    1331              
    1332              
    1333              DW$T$27 .dwtag  DW_TAG_union_type
    1334                      .dwattr DW$T$27, DW_AT_name("GPATOGGLE_REG")
    1335                      .dwattr DW$T$27, DW_AT_byte_size(0x01)
    1336              DW$85   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1337                      .dwattr DW$85, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1338                      .dwattr DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1339                      .dwattr DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1340              DW$86   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    1341                      .dwattr DW$86, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1342                      .dwattr DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1343                      .dwattr DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1344                      .dwendtag DW$T$27
    1345              
    1346              
    1347              DW$T$29 .dwtag  DW_TAG_union_type
    1348                      .dwattr DW$T$29, DW_AT_name("GPBDAT_REG")
    1349                      .dwattr DW$T$29, DW_AT_byte_size(0x01)
    1350              DW$87   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1351                      .dwattr DW$87, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1352                      .dwattr DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1353                      .dwattr DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1354              DW$88   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    1355                      .dwattr DW$88, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
TMS320C2000 COFF Assembler PC v4.1.0 Thu Feb 07 18:26:14 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
F:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Ad7663.asm PAGE   27

    1356                      .dwattr DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1357                      .dwattr DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1358                      .dwendtag DW$T$29
    1359              
    1360              
    1361              DW$T$31 .dwtag  DW_TAG_union_type
    1362                      .dwattr DW$T$31, DW_AT_name("GPBSET_REG")
    1363                      .dwattr DW$T$31, DW_AT_byte_size(0x01)
    1364              DW$89   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1365                      .dwattr DW$89, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1366                      .dwattr DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1367                      .dwattr DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1368              DW$90   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    1369                      .dwattr DW$90, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1370                      .dwattr DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1371                      .dwattr DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1372                      .dwendtag DW$T$31
    1373              
    1374              
    1375              DW$T$33 .dwtag  DW_TAG_union_type
    1376                      .dwattr DW$T$33, DW_AT_name("GPBCLEAR_REG")
    1377                      .dwattr DW$T$33, DW_AT_byte_size(0x01)
    1378              DW$91   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1379                      .dwattr DW$91, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1380                      .dwattr DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1381                      .dwattr DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1382              DW$92   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    1383                      .dwattr DW$92, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1384                      .dwattr DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1385                      .dwattr DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1386                      .dwendtag DW$T$33
    1387              
    1388              
    1389              DW$T$35 .dwtag  DW_TAG_union_type
    1390                      .dwattr DW$T$35, DW_AT_name("GPBTOGGLE_REG")
    1391                      .dwattr DW$T$35, DW_AT_byte_size(0x01)
    1392              DW$93   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1393                      .dwattr DW$93, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1394                      .dwattr DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1395                      .dwattr DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1396              DW$94   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    1397                      .dwattr DW$94, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1398                      .dwattr DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1399                      .dwattr DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1400                      .dwendtag DW$T$35
    1401              
    1402              
    1403              DW$T$37 .dwtag  DW_TAG_union_type
    1404                      .dwattr DW$T$37, DW_AT_name("GPDDAT_REG")
    1405                      .dwattr DW$T$37, DW_AT_byte_size(0x01)
    1406              DW$95   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1407                      .dwattr DW$95, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1408                      .dwattr DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1409                      .dwattr DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1410              DW$96   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
TMS320C2000 COFF Assembler PC v4.1.0 Thu Feb 07 18:26:14 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
F:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Ad7663.asm PAGE   28

    1411                      .dwattr DW$96, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1412                      .dwattr DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1413                      .dwattr DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1414                      .dwendtag DW$T$37
    1415              
    1416              
    1417              DW$T$39 .dwtag  DW_TAG_union_type
    1418                      .dwattr DW$T$39, DW_AT_name("GPDSET_REG")
    1419                      .dwattr DW$T$39, DW_AT_byte_size(0x01)
    1420              DW$97   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1421                      .dwattr DW$97, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1422                      .dwattr DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1423                      .dwattr DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1424              DW$98   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    1425                      .dwattr DW$98, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1426                      .dwattr DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1427                      .dwattr DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1428                      .dwendtag DW$T$39
    1429              
    1430              
    1431              DW$T$41 .dwtag  DW_TAG_union_type
    1432                      .dwattr DW$T$41, DW_AT_name("GPDCLEAR_REG")
    1433                      .dwattr DW$T$41, DW_AT_byte_size(0x01)
    1434              DW$99   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1435                      .dwattr DW$99, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1436                      .dwattr DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1437                      .dwattr DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1438              DW$100  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
    1439                      .dwattr DW$100, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1440                      .dwattr DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1441                      .dwattr DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1442                      .dwendtag DW$T$41
    1443              
    1444              
    1445              DW$T$43 .dwtag  DW_TAG_union_type
    1446                      .dwattr DW$T$43, DW_AT_name("GPDTOGGLE_REG")
    1447                      .dwattr DW$T$43, DW_AT_byte_size(0x01)
    1448              DW$101  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1449                      .dwattr DW$101, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1450                      .dwattr DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1451                      .dwattr DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1452              DW$102  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    1453                      .dwattr DW$102, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1454                      .dwattr DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1455                      .dwattr DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1456                      .dwendtag DW$T$43
    1457              
    1458              
    1459              DW$T$45 .dwtag  DW_TAG_union_type
    1460                      .dwattr DW$T$45, DW_AT_name("GPEDAT_REG")
    1461                      .dwattr DW$T$45, DW_AT_byte_size(0x01)
    1462              DW$103  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1463                      .dwattr DW$103, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1464                      .dwattr DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1465                      .dwattr DW$103, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Thu Feb 07 18:26:14 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
F:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Ad7663.asm PAGE   29

    1466              DW$104  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
    1467                      .dwattr DW$104, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1468                      .dwattr DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1469                      .dwattr DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1470                      .dwendtag DW$T$45
    1471              
    1472              
    1473              DW$T$47 .dwtag  DW_TAG_union_type
    1474                      .dwattr DW$T$47, DW_AT_name("GPESET_REG")
    1475                      .dwattr DW$T$47, DW_AT_byte_size(0x01)
    1476              DW$105  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1477                      .dwattr DW$105, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1478                      .dwattr DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1479                      .dwattr DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1480              DW$106  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
    1481                      .dwattr DW$106, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1482                      .dwattr DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1483                      .dwattr DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1484                      .dwendtag DW$T$47
    1485              
    1486              
    1487              DW$T$49 .dwtag  DW_TAG_union_type
    1488                      .dwattr DW$T$49, DW_AT_name("GPECLEAR_REG")
    1489                      .dwattr DW$T$49, DW_AT_byte_size(0x01)
    1490              DW$107  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1491                      .dwattr DW$107, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1492                      .dwattr DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1493                      .dwattr DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1494              DW$108  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
    1495                      .dwattr DW$108, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1496                      .dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1497                      .dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1498                      .dwendtag DW$T$49
    1499              
    1500              
    1501              DW$T$51 .dwtag  DW_TAG_union_type
    1502                      .dwattr DW$T$51, DW_AT_name("GPETOGGLE_REG")
    1503                      .dwattr DW$T$51, DW_AT_byte_size(0x01)
    1504              DW$109  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1505                      .dwattr DW$109, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1506                      .dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1507                      .dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1508              DW$110  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
    1509                      .dwattr DW$110, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1510                      .dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1511                      .dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1512                      .dwendtag DW$T$51
    1513              
    1514              
    1515              DW$T$53 .dwtag  DW_TAG_union_type
    1516                      .dwattr DW$T$53, DW_AT_name("GPFDAT_REG")
    1517                      .dwattr DW$T$53, DW_AT_byte_size(0x01)
    1518              DW$111  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1519                      .dwattr DW$111, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1520                      .dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.0 Thu Feb 07 18:26:14 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
F:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Ad7663.asm PAGE   30

    1521                      .dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1522              DW$112  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
    1523                      .dwattr DW$112, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1524                      .dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1525                      .dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1526                      .dwendtag DW$T$53
    1527              
    1528              
    1529              DW$T$55 .dwtag  DW_TAG_union_type
    1530                      .dwattr DW$T$55, DW_AT_name("GPFSET_REG")
    1531                      .dwattr DW$T$55, DW_AT_byte_size(0x01)
    1532              DW$113  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1533                      .dwattr DW$113, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1534                      .dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1535                      .dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1536              DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
    1537                      .dwattr DW$114, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1538                      .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1539                      .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1540                      .dwendtag DW$T$55
    1541              
    1542              
    1543              DW$T$57 .dwtag  DW_TAG_union_type
    1544                      .dwattr DW$T$57, DW_AT_name("GPFCLEAR_REG")
    1545                      .dwattr DW$T$57, DW_AT_byte_size(0x01)
    1546              DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1547                      .dwattr DW$115, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1548                      .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1549                      .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1550              DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
    1551                      .dwattr DW$116, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1552                      .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1553                      .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1554                      .dwendtag DW$T$57
    1555              
    1556              
    1557              DW$T$59 .dwtag  DW_TAG_union_type
    1558                      .dwattr DW$T$59, DW_AT_name("GPFTOGGLE_REG")
    1559                      .dwattr DW$T$59, DW_AT_byte_size(0x01)
    1560              DW$117  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1561                      .dwattr DW$117, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1562                      .dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1563                      .dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1564              DW$118  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    1565                      .dwattr DW$118, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1566                      .dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1567                      .dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1568                      .dwendtag DW$T$59
    1569              
    1570              
    1571              DW$T$61 .dwtag  DW_TAG_union_type
    1572                      .dwattr DW$T$61, DW_AT_name("GPGDAT_REG")
    1573                      .dwattr DW$T$61, DW_AT_byte_size(0x01)
    1574              DW$119  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1575                      .dwattr DW$119, DW_AT_name("all"), DW_AT_symbol_name("_all")
TMS320C2000 COFF Assembler PC v4.1.0 Thu Feb 07 18:26:14 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
F:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Ad7663.asm PAGE   31

    1576                      .dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1577                      .dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1578              DW$120  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
    1579                      .dwattr DW$120, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1580                      .dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1581                      .dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1582                      .dwendtag DW$T$61
    1583              
    1584              
    1585              DW$T$63 .dwtag  DW_TAG_union_type
    1586                      .dwattr DW$T$63, DW_AT_name("GPGSET_REG")
    1587                      .dwattr DW$T$63, DW_AT_byte_size(0x01)
    1588              DW$121  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1589                      .dwattr DW$121, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1590                      .dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1591                      .dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1592              DW$122  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
    1593                      .dwattr DW$122, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1594                      .dwattr DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1595                      .dwattr DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1596                      .dwendtag DW$T$63
    1597              
    1598              
    1599              DW$T$65 .dwtag  DW_TAG_union_type
    1600                      .dwattr DW$T$65, DW_AT_name("GPGCLEAR_REG")
    1601                      .dwattr DW$T$65, DW_AT_byte_size(0x01)
    1602              DW$123  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1603                      .dwattr DW$123, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1604                      .dwattr DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1605                      .dwattr DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1606              DW$124  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
    1607                      .dwattr DW$124, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1608                      .dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1609                      .dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1610                      .dwendtag DW$T$65
    1611              
    1612              
    1613              DW$T$67 .dwtag  DW_TAG_union_type
    1614                      .dwattr DW$T$67, DW_AT_name("GPGTOGGLE_REG")
    1615                      .dwattr DW$T$67, DW_AT_byte_size(0x01)
    1616              DW$125  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1617                      .dwattr DW$125, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1618                      .dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1619                      .dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1620              DW$126  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
    1621                      .dwattr DW$126, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1622                      .dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1623                      .dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1624                      .dwendtag DW$T$67
    1625              
    1626              
    1627              DW$T$20 .dwtag  DW_TAG_structure_type
    1628                      .dwattr DW$T$20, DW_AT_name("GPADAT_BITS")
    1629                      .dwattr DW$T$20, DW_AT_byte_size(0x01)
    1630              DW$127  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
TMS320C2000 COFF Assembler PC v4.1.0 Thu Feb 07 18:26:14 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
F:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Ad7663.asm PAGE   32

    1631                      .dwattr DW$127, DW_AT_name("GPIOA0"), DW_AT_symbol_name("_GPIOA0")
    1632                      .dwattr DW$127, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1633                      .dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1634                      .dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1635              DW$128  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1636                      .dwattr DW$128, DW_AT_name("GPIOA1"), DW_AT_symbol_name("_GPIOA1")
    1637                      .dwattr DW$128, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1638                      .dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1639                      .dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1640              DW$129  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1641                      .dwattr DW$129, DW_AT_name("GPIOA2"), DW_AT_symbol_name("_GPIOA2")
    1642                      .dwattr DW$129, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1643                      .dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1644                      .dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1645              DW$130  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1646                      .dwattr DW$130, DW_AT_name("GPIOA3"), DW_AT_symbol_name("_GPIOA3")
    1647                      .dwattr DW$130, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1648                      .dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1649                      .dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1650              DW$131  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1651                      .dwattr DW$131, DW_AT_name("GPIOA4"), DW_AT_symbol_name("_GPIOA4")
    1652                      .dwattr DW$131, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1653                      .dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1654                      .dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1655              DW$132  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1656                      .dwattr DW$132, DW_AT_name("GPIOA5"), DW_AT_symbol_name("_GPIOA5")
    1657                      .dwattr DW$132, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1658                      .dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1659                      .dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1660              DW$133  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1661                      .dwattr DW$133, DW_AT_name("GPIOA6"), DW_AT_symbol_name("_GPIOA6")
    1662                      .dwattr DW$133, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1663                      .dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1664                      .dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1665              DW$134  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1666                      .dwattr DW$134, DW_AT_name("GPIOA7"), DW_AT_symbol_name("_GPIOA7")
    1667                      .dwattr DW$134, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1668                      .dwattr DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1669                      .dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1670              DW$135  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1671                      .dwattr DW$135, DW_AT_name("GPIOA8"), DW_AT_symbol_name("_GPIOA8")
    1672                      .dwattr DW$135, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1673                      .dwattr DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1674                      .dwattr DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1675              DW$136  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1676                      .dwattr DW$136, DW_AT_name("GPIOA9"), DW_AT_symbol_name("_GPIOA9")
    1677                      .dwattr DW$136, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1678                      .dwattr DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1679                      .dwattr DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1680              DW$137  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1681                      .dwattr DW$137, DW_AT_name("GPIOA10"), DW_AT_symbol_name("_GPIOA10")
    1682                      .dwattr DW$137, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1683                      .dwattr DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1684                      .dwattr DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1685              DW$138  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
TMS320C2000 COFF Assembler PC v4.1.0 Thu Feb 07 18:26:14 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
F:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Ad7663.asm PAGE   33

    1686                      .dwattr DW$138, DW_AT_name("GPIOA11"), DW_AT_symbol_name("_GPIOA11")
    1687                      .dwattr DW$138, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1688                      .dwattr DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1689                      .dwattr DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1690              DW$139  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1691                      .dwattr DW$139, DW_AT_name("GPIOA12"), DW_AT_symbol_name("_GPIOA12")
    1692                      .dwattr DW$139, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1693                      .dwattr DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1694                      .dwattr DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1695              DW$140  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1696                      .dwattr DW$140, DW_AT_name("GPIOA13"), DW_AT_symbol_name("_GPIOA13")
    1697                      .dwattr DW$140, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1698                      .dwattr DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1699                      .dwattr DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1700              DW$141  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1701                      .dwattr DW$141, DW_AT_name("GPIOA14"), DW_AT_symbol_name("_GPIOA14")
    1702                      .dwattr DW$141, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1703                      .dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1704                      .dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1705              DW$142  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1706                      .dwattr DW$142, DW_AT_name("GPIOA15"), DW_AT_symbol_name("_GPIOA15")
    1707                      .dwattr DW$142, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1708                      .dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1709                      .dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1710                      .dwendtag DW$T$20
    1711              
    1712              
    1713              DW$T$22 .dwtag  DW_TAG_structure_type
    1714                      .dwattr DW$T$22, DW_AT_name("GPASET_BITS")
    1715                      .dwattr DW$T$22, DW_AT_byte_size(0x01)
    1716              DW$143  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1717                      .dwattr DW$143, DW_AT_name("GPIOA0"), DW_AT_symbol_name("_GPIOA0")
    1718                      .dwattr DW$143, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1719                      .dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1720                      .dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1721              DW$144  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1722                      .dwattr DW$144, DW_AT_name("GPIOA1"), DW_AT_symbol_name("_GPIOA1")
    1723                      .dwattr DW$144, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1724                      .dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1725                      .dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1726              DW$145  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1727                      .dwattr DW$145, DW_AT_name("GPIOA2"), DW_AT_symbol_name("_GPIOA2")
    1728                      .dwattr DW$145, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1729                      .dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1730                      .dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1731              DW$146  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1732                      .dwattr DW$146, DW_AT_name("GPIOA3"), DW_AT_symbol_name("_GPIOA3")
    1733                      .dwattr DW$146, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1734                      .dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1735                      .dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1736              DW$147  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1737                      .dwattr DW$147, DW_AT_name("GPIOA4"), DW_AT_symbol_name("_GPIOA4")
    1738                      .dwattr DW$147, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1739                      .dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1740                      .dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Thu Feb 07 18:26:14 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
F:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Ad7663.asm PAGE   34

    1741              DW$148  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1742                      .dwattr DW$148, DW_AT_name("GPIOA5"), DW_AT_symbol_name("_GPIOA5")
    1743                      .dwattr DW$148, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1744                      .dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1745                      .dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1746              DW$149  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1747                      .dwattr DW$149, DW_AT_name("GPIOA6"), DW_AT_symbol_name("_GPIOA6")
    1748                      .dwattr DW$149, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1749                      .dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1750                      .dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1751              DW$150  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1752                      .dwattr DW$150, DW_AT_name("GPIOA7"), DW_AT_symbol_name("_GPIOA7")
    1753                      .dwattr DW$150, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1754                      .dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1755                      .dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1756              DW$151  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1757                      .dwattr DW$151, DW_AT_name("GPIOA8"), DW_AT_symbol_name("_GPIOA8")
    1758                      .dwattr DW$151, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1759                      .dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1760                      .dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1761              DW$152  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1762                      .dwattr DW$152, DW_AT_name("GPIOA9"), DW_AT_symbol_name("_GPIOA9")
    1763                      .dwattr DW$152, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1764                      .dwattr DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1765                      .dwattr DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1766              DW$153  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1767                      .dwattr DW$153, DW_AT_name("GPIOA10"), DW_AT_symbol_name("_GPIOA10")
    1768                      .dwattr DW$153, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1769                      .dwattr DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1770                      .dwattr DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1771              DW$154  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1772                      .dwattr DW$154, DW_AT_name("GPIOA11"), DW_AT_symbol_name("_GPIOA11")
    1773                      .dwattr DW$154, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1774                      .dwattr DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1775                      .dwattr DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1776              DW$155  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1777                      .dwattr DW$155, DW_AT_name("GPIOA12"), DW_AT_symbol_name("_GPIOA12")
    1778                      .dwattr DW$155, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1779                      .dwattr DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1780                      .dwattr DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1781              DW$156  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1782                      .dwattr DW$156, DW_AT_name("GPIOA13"), DW_AT_symbol_name("_GPIOA13")
    1783                      .dwattr DW$156, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1784                      .dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1785                      .dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1786              DW$157  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1787                      .dwattr DW$157, DW_AT_name("GPIOA14"), DW_AT_symbol_name("_GPIOA14")
    1788                      .dwattr DW$157, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1789                      .dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1790                      .dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1791              DW$158  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1792                      .dwattr DW$158, DW_AT_name("GPIOA15"), DW_AT_symbol_name("_GPIOA15")
    1793                      .dwattr DW$158, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1794                      .dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1795                      .dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Thu Feb 07 18:26:14 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
F:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Ad7663.asm PAGE   35

    1796                      .dwendtag DW$T$22
    1797              
    1798              
    1799              DW$T$24 .dwtag  DW_TAG_structure_type
    1800                      .dwattr DW$T$24, DW_AT_name("GPACLEAR_BITS")
    1801                      .dwattr DW$T$24, DW_AT_byte_size(0x01)
    1802              DW$159  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1803                      .dwattr DW$159, DW_AT_name("GPIOA0"), DW_AT_symbol_name("_GPIOA0")
    1804                      .dwattr DW$159, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1805                      .dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1806                      .dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1807              DW$160  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1808                      .dwattr DW$160, DW_AT_name("GPIOA1"), DW_AT_symbol_name("_GPIOA1")
    1809                      .dwattr DW$160, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1810                      .dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1811                      .dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1812              DW$161  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1813                      .dwattr DW$161, DW_AT_name("GPIOA2"), DW_AT_symbol_name("_GPIOA2")
    1814                      .dwattr DW$161, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1815                      .dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1816                      .dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1817              DW$162  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1818                      .dwattr DW$162, DW_AT_name("GPIOA3"), DW_AT_symbol_name("_GPIOA3")
    1819                      .dwattr DW$162, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1820                      .dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1821                      .dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1822              DW$163  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1823                      .dwattr DW$163, DW_AT_name("GPIOA4"), DW_AT_symbol_name("_GPIOA4")
    1824                      .dwattr DW$163, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1825                      .dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1826                      .dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1827              DW$164  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1828                      .dwattr DW$164, DW_AT_name("GPIOA5"), DW_AT_symbol_name("_GPIOA5")
    1829                      .dwattr DW$164, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1830                      .dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1831                      .dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1832              DW$165  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1833                      .dwattr DW$165, DW_AT_name("GPIOA6"), DW_AT_symbol_name("_GPIOA6")
    1834                      .dwattr DW$165, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1835                      .dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1836                      .dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1837              DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1838                      .dwattr DW$166, DW_AT_name("GPIOA7"), DW_AT_symbol_name("_GPIOA7")
    1839                      .dwattr DW$166, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1840                      .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1841                      .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1842              DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1843                      .dwattr DW$167, DW_AT_name("GPIOA8"), DW_AT_symbol_name("_GPIOA8")
    1844                      .dwattr DW$167, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1845                      .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1846                      .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1847              DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1848                      .dwattr DW$168, DW_AT_name("GPIOA9"), DW_AT_symbol_name("_GPIOA9")
    1849                      .dwattr DW$168, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1850                      .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.0 Thu Feb 07 18:26:14 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
F:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Ad7663.asm PAGE   36

    1851                      .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1852              DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1853                      .dwattr DW$169, DW_AT_name("GPIOA10"), DW_AT_symbol_name("_GPIOA10")
    1854                      .dwattr DW$169, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1855                      .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1856                      .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1857              DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1858                      .dwattr DW$170, DW_AT_name("GPIOA11"), DW_AT_symbol_name("_GPIOA11")
    1859                      .dwattr DW$170, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1860                      .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1861                      .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1862              DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1863                      .dwattr DW$171, DW_AT_name("GPIOA12"), DW_AT_symbol_name("_GPIOA12")
    1864                      .dwattr DW$171, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1865                      .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1866                      .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1867              DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1868                      .dwattr DW$172, DW_AT_name("GPIOA13"), DW_AT_symbol_name("_GPIOA13")
    1869                      .dwattr DW$172, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1870                      .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1871                      .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1872              DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1873                      .dwattr DW$173, DW_AT_name("GPIOA14"), DW_AT_symbol_name("_GPIOA14")
    1874                      .dwattr DW$173, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1875                      .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1876                      .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1877              DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1878                      .dwattr DW$174, DW_AT_name("GPIOA15"), DW_AT_symbol_name("_GPIOA15")
    1879                      .dwattr DW$174, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1880                      .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1881                      .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1882                      .dwendtag DW$T$24
    1883              
    1884              
    1885              DW$T$26 .dwtag  DW_TAG_structure_type
    1886                      .dwattr DW$T$26, DW_AT_name("GPATOGGLE_BITS")
    1887                      .dwattr DW$T$26, DW_AT_byte_size(0x01)
    1888              DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1889                      .dwattr DW$175, DW_AT_name("GPIOA0"), DW_AT_symbol_name("_GPIOA0")
    1890                      .dwattr DW$175, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1891                      .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1892                      .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1893              DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1894                      .dwattr DW$176, DW_AT_name("GPIOA1"), DW_AT_symbol_name("_GPIOA1")
    1895                      .dwattr DW$176, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1896                      .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1897                      .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1898              DW$177  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1899                      .dwattr DW$177, DW_AT_name("GPIOA2"), DW_AT_symbol_name("_GPIOA2")
    1900                      .dwattr DW$177, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1901                      .dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1902                      .dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1903              DW$178  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1904                      .dwattr DW$178, DW_AT_name("GPIOA3"), DW_AT_symbol_name("_GPIOA3")
    1905                      .dwattr DW$178, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.0 Thu Feb 07 18:26:14 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
F:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Ad7663.asm PAGE   37

    1906                      .dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1907                      .dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1908              DW$179  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1909                      .dwattr DW$179, DW_AT_name("GPIOA4"), DW_AT_symbol_name("_GPIOA4")
    1910                      .dwattr DW$179, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1911                      .dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1912                      .dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1913              DW$180  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1914                      .dwattr DW$180, DW_AT_name("GPIOA5"), DW_AT_symbol_name("_GPIOA5")
    1915                      .dwattr DW$180, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1916                      .dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1917                      .dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1918              DW$181  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1919                      .dwattr DW$181, DW_AT_name("GPIOA6"), DW_AT_symbol_name("_GPIOA6")
    1920                      .dwattr DW$181, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1921                      .dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1922                      .dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1923              DW$182  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1924                      .dwattr DW$182, DW_AT_name("GPIOA7"), DW_AT_symbol_name("_GPIOA7")
    1925                      .dwattr DW$182, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1926                      .dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1927                      .dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1928              DW$183  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1929                      .dwattr DW$183, DW_AT_name("GPIOA8"), DW_AT_symbol_name("_GPIOA8")
    1930                      .dwattr DW$183, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1931                      .dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1932                      .dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1933              DW$184  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1934                      .dwattr DW$184, DW_AT_name("GPIOA9"), DW_AT_symbol_name("_GPIOA9")
    1935                      .dwattr DW$184, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1936                      .dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1937                      .dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1938              DW$185  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1939                      .dwattr DW$185, DW_AT_name("GPIOA10"), DW_AT_symbol_name("_GPIOA10")
    1940                      .dwattr DW$185, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1941                      .dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1942                      .dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1943              DW$186  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1944                      .dwattr DW$186, DW_AT_name("GPIOA11"), DW_AT_symbol_name("_GPIOA11")
    1945                      .dwattr DW$186, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1946                      .dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1947                      .dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1948              DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1949                      .dwattr DW$187, DW_AT_name("GPIOA12"), DW_AT_symbol_name("_GPIOA12")
    1950                      .dwattr DW$187, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1951                      .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1952                      .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1953              DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1954                      .dwattr DW$188, DW_AT_name("GPIOA13"), DW_AT_symbol_name("_GPIOA13")
    1955                      .dwattr DW$188, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1956                      .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1957                      .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1958              DW$189  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1959                      .dwattr DW$189, DW_AT_name("GPIOA14"), DW_AT_symbol_name("_GPIOA14")
    1960                      .dwattr DW$189, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.0 Thu Feb 07 18:26:14 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
F:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Ad7663.asm PAGE   38

    1961                      .dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1962                      .dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1963              DW$190  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1964                      .dwattr DW$190, DW_AT_name("GPIOA15"), DW_AT_symbol_name("_GPIOA15")
    1965                      .dwattr DW$190, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1966                      .dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1967                      .dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1968                      .dwendtag DW$T$26
    1969              
    1970              
    1971              DW$T$28 .dwtag  DW_TAG_structure_type
    1972                      .dwattr DW$T$28, DW_AT_name("GPBDAT_BITS")
    1973                      .dwattr DW$T$28, DW_AT_byte_size(0x01)
    1974              DW$191  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1975                      .dwattr DW$191, DW_AT_name("GPIOB0"), DW_AT_symbol_name("_GPIOB0")
    1976                      .dwattr DW$191, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1977                      .dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1978                      .dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1979              DW$192  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1980                      .dwattr DW$192, DW_AT_name("GPIOB1"), DW_AT_symbol_name("_GPIOB1")
    1981                      .dwattr DW$192, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1982                      .dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1983                      .dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1984              DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1985                      .dwattr DW$193, DW_AT_name("GPIOB2"), DW_AT_symbol_name("_GPIOB2")
    1986                      .dwattr DW$193, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1987                      .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1988                      .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1989              DW$194  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1990                      .dwattr DW$194, DW_AT_name("GPIOB3"), DW_AT_symbol_name("_GPIOB3")
    1991                      .dwattr DW$194, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1992                      .dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1993                      .dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1994              DW$195  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1995                      .dwattr DW$195, DW_AT_name("GPIOB4"), DW_AT_symbol_name("_GPIOB4")
    1996                      .dwattr DW$195, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1997                      .dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1998                      .dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1999              DW$196  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2000                      .dwattr DW$196, DW_AT_name("GPIOB5"), DW_AT_symbol_name("_GPIOB5")
    2001                      .dwattr DW$196, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2002                      .dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2003                      .dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2004              DW$197  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2005                      .dwattr DW$197, DW_AT_name("GPIOB6"), DW_AT_symbol_name("_GPIOB6")
    2006                      .dwattr DW$197, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2007                      .dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2008                      .dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2009              DW$198  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2010                      .dwattr DW$198, DW_AT_name("GPIOB7"), DW_AT_symbol_name("_GPIOB7")
    2011                      .dwattr DW$198, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2012                      .dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2013                      .dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2014              DW$199  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2015                      .dwattr DW$199, DW_AT_name("GPIOB8"), DW_AT_symbol_name("_GPIOB8")
TMS320C2000 COFF Assembler PC v4.1.0 Thu Feb 07 18:26:14 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
F:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Ad7663.asm PAGE   39

    2016                      .dwattr DW$199, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2017                      .dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2018                      .dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2019              DW$200  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2020                      .dwattr DW$200, DW_AT_name("GPIOB9"), DW_AT_symbol_name("_GPIOB9")
    2021                      .dwattr DW$200, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2022                      .dwattr DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2023                      .dwattr DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2024              DW$201  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2025                      .dwattr DW$201, DW_AT_name("GPIOB10"), DW_AT_symbol_name("_GPIOB10")
    2026                      .dwattr DW$201, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2027                      .dwattr DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2028                      .dwattr DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2029              DW$202  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2030                      .dwattr DW$202, DW_AT_name("GPIOB11"), DW_AT_symbol_name("_GPIOB11")
    2031                      .dwattr DW$202, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2032                      .dwattr DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2033                      .dwattr DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2034              DW$203  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2035                      .dwattr DW$203, DW_AT_name("GPIOB12"), DW_AT_symbol_name("_GPIOB12")
    2036                      .dwattr DW$203, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2037                      .dwattr DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2038                      .dwattr DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2039              DW$204  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2040                      .dwattr DW$204, DW_AT_name("GPIOB13"), DW_AT_symbol_name("_GPIOB13")
    2041                      .dwattr DW$204, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2042                      .dwattr DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2043                      .dwattr DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2044              DW$205  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2045                      .dwattr DW$205, DW_AT_name("GPIOB14"), DW_AT_symbol_name("_GPIOB14")
    2046                      .dwattr DW$205, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2047                      .dwattr DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2048                      .dwattr DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2049              DW$206  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2050                      .dwattr DW$206, DW_AT_name("GPIOB15"), DW_AT_symbol_name("_GPIOB15")
    2051                      .dwattr DW$206, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2052                      .dwattr DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2053                      .dwattr DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2054                      .dwendtag DW$T$28
    2055              
    2056              
    2057              DW$T$30 .dwtag  DW_TAG_structure_type
    2058                      .dwattr DW$T$30, DW_AT_name("GPBSET_BITS")
    2059                      .dwattr DW$T$30, DW_AT_byte_size(0x01)
    2060              DW$207  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2061                      .dwattr DW$207, DW_AT_name("GPIOB0"), DW_AT_symbol_name("_GPIOB0")
    2062                      .dwattr DW$207, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2063                      .dwattr DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2064                      .dwattr DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2065              DW$208  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2066                      .dwattr DW$208, DW_AT_name("GPIOB1"), DW_AT_symbol_name("_GPIOB1")
    2067                      .dwattr DW$208, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2068                      .dwattr DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2069                      .dwattr DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2070              DW$209  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
TMS320C2000 COFF Assembler PC v4.1.0 Thu Feb 07 18:26:14 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
F:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Ad7663.asm PAGE   40

    2071                      .dwattr DW$209, DW_AT_name("GPIOB2"), DW_AT_symbol_name("_GPIOB2")
    2072                      .dwattr DW$209, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2073                      .dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2074                      .dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2075              DW$210  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2076                      .dwattr DW$210, DW_AT_name("GPIOB3"), DW_AT_symbol_name("_GPIOB3")
    2077                      .dwattr DW$210, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2078                      .dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2079                      .dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2080              DW$211  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2081                      .dwattr DW$211, DW_AT_name("GPIOB4"), DW_AT_symbol_name("_GPIOB4")
    2082                      .dwattr DW$211, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2083                      .dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2084                      .dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2085              DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2086                      .dwattr DW$212, DW_AT_name("GPIOB5"), DW_AT_symbol_name("_GPIOB5")
    2087                      .dwattr DW$212, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2088                      .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2089                      .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2090              DW$213  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2091                      .dwattr DW$213, DW_AT_name("GPIOB6"), DW_AT_symbol_name("_GPIOB6")
    2092                      .dwattr DW$213, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2093                      .dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2094                      .dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2095              DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2096                      .dwattr DW$214, DW_AT_name("GPIOB7"), DW_AT_symbol_name("_GPIOB7")
    2097                      .dwattr DW$214, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2098                      .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2099                      .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2100              DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2101                      .dwattr DW$215, DW_AT_name("GPIOB8"), DW_AT_symbol_name("_GPIOB8")
    2102                      .dwattr DW$215, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2103                      .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2104                      .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2105              DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2106                      .dwattr DW$216, DW_AT_name("GPIOB9"), DW_AT_symbol_name("_GPIOB9")
    2107                      .dwattr DW$216, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2108                      .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2109                      .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2110              DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2111                      .dwattr DW$217, DW_AT_name("GPIOB10"), DW_AT_symbol_name("_GPIOB10")
    2112                      .dwattr DW$217, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2113                      .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2114                      .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2115              DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2116                      .dwattr DW$218, DW_AT_name("GPIOB11"), DW_AT_symbol_name("_GPIOB11")
    2117                      .dwattr DW$218, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2118                      .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2119                      .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2120              DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2121                      .dwattr DW$219, DW_AT_name("GPIOB12"), DW_AT_symbol_name("_GPIOB12")
    2122                      .dwattr DW$219, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2123                      .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2124                      .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2125              DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
TMS320C2000 COFF Assembler PC v4.1.0 Thu Feb 07 18:26:14 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
F:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Ad7663.asm PAGE   41

    2126                      .dwattr DW$220, DW_AT_name("GPIOB13"), DW_AT_symbol_name("_GPIOB13")
    2127                      .dwattr DW$220, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2128                      .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2129                      .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2130              DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2131                      .dwattr DW$221, DW_AT_name("GPIOB14"), DW_AT_symbol_name("_GPIOB14")
    2132                      .dwattr DW$221, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2133                      .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2134                      .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2135              DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2136                      .dwattr DW$222, DW_AT_name("GPIOB15"), DW_AT_symbol_name("_GPIOB15")
    2137                      .dwattr DW$222, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2138                      .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2139                      .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2140                      .dwendtag DW$T$30
    2141              
    2142              
    2143              DW$T$32 .dwtag  DW_TAG_structure_type
    2144                      .dwattr DW$T$32, DW_AT_name("GPBCLEAR_BITS")
    2145                      .dwattr DW$T$32, DW_AT_byte_size(0x01)
    2146              DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2147                      .dwattr DW$223, DW_AT_name("GPIOB0"), DW_AT_symbol_name("_GPIOB0")
    2148                      .dwattr DW$223, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2149                      .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2150                      .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2151              DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2152                      .dwattr DW$224, DW_AT_name("GPIOB1"), DW_AT_symbol_name("_GPIOB1")
    2153                      .dwattr DW$224, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2154                      .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2155                      .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2156              DW$225  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2157                      .dwattr DW$225, DW_AT_name("GPIOB2"), DW_AT_symbol_name("_GPIOB2")
    2158                      .dwattr DW$225, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2159                      .dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2160                      .dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2161              DW$226  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2162                      .dwattr DW$226, DW_AT_name("GPIOB3"), DW_AT_symbol_name("_GPIOB3")
    2163                      .dwattr DW$226, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2164                      .dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2165                      .dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2166              DW$227  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2167                      .dwattr DW$227, DW_AT_name("GPIOB4"), DW_AT_symbol_name("_GPIOB4")
    2168                      .dwattr DW$227, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2169                      .dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2170                      .dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2171              DW$228  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2172                      .dwattr DW$228, DW_AT_name("GPIOB5"), DW_AT_symbol_name("_GPIOB5")
    2173                      .dwattr DW$228, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2174                      .dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2175                      .dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2176              DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2177                      .dwattr DW$229, DW_AT_name("GPIOB6"), DW_AT_symbol_name("_GPIOB6")
    2178                      .dwattr DW$229, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2179                      .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2180                      .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Thu Feb 07 18:26:14 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
F:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Ad7663.asm PAGE   42

    2181              DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2182                      .dwattr DW$230, DW_AT_name("GPIOB7"), DW_AT_symbol_name("_GPIOB7")
    2183                      .dwattr DW$230, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2184                      .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2185                      .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2186              DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2187                      .dwattr DW$231, DW_AT_name("GPIOB8"), DW_AT_symbol_name("_GPIOB8")
    2188                      .dwattr DW$231, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2189                      .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2190                      .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2191              DW$232  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2192                      .dwattr DW$232, DW_AT_name("GPIOB9"), DW_AT_symbol_name("_GPIOB9")
    2193                      .dwattr DW$232, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2194                      .dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2195                      .dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2196              DW$233  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2197                      .dwattr DW$233, DW_AT_name("GPIOB10"), DW_AT_symbol_name("_GPIOB10")
    2198                      .dwattr DW$233, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2199                      .dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2200                      .dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2201              DW$234  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2202                      .dwattr DW$234, DW_AT_name("GPIOB11"), DW_AT_symbol_name("_GPIOB11")
    2203                      .dwattr DW$234, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2204                      .dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2205                      .dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2206              DW$235  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2207                      .dwattr DW$235, DW_AT_name("GPIOB12"), DW_AT_symbol_name("_GPIOB12")
    2208                      .dwattr DW$235, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2209                      .dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2210                      .dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2211              DW$236  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2212                      .dwattr DW$236, DW_AT_name("GPIOB13"), DW_AT_symbol_name("_GPIOB13")
    2213                      .dwattr DW$236, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2214                      .dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2215                      .dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2216              DW$237  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2217                      .dwattr DW$237, DW_AT_name("GPIOB14"), DW_AT_symbol_name("_GPIOB14")
    2218                      .dwattr DW$237, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2219                      .dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2220                      .dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2221              DW$238  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2222                      .dwattr DW$238, DW_AT_name("GPIOB15"), DW_AT_symbol_name("_GPIOB15")
    2223                      .dwattr DW$238, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2224                      .dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2225                      .dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2226                      .dwendtag DW$T$32
    2227              
    2228              
    2229              DW$T$34 .dwtag  DW_TAG_structure_type
    2230                      .dwattr DW$T$34, DW_AT_name("GPBTOGGLE_BITS")
    2231                      .dwattr DW$T$34, DW_AT_byte_size(0x01)
    2232              DW$239  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2233                      .dwattr DW$239, DW_AT_name("GPIOB0"), DW_AT_symbol_name("_GPIOB0")
    2234                      .dwattr DW$239, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2235                      .dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.0 Thu Feb 07 18:26:14 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
F:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Ad7663.asm PAGE   43

    2236                      .dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2237              DW$240  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2238                      .dwattr DW$240, DW_AT_name("GPIOB1"), DW_AT_symbol_name("_GPIOB1")
    2239                      .dwattr DW$240, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2240                      .dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2241                      .dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2242              DW$241  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2243                      .dwattr DW$241, DW_AT_name("GPIOB2"), DW_AT_symbol_name("_GPIOB2")
    2244                      .dwattr DW$241, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2245                      .dwattr DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2246                      .dwattr DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2247              DW$242  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2248                      .dwattr DW$242, DW_AT_name("GPIOB3"), DW_AT_symbol_name("_GPIOB3")
    2249                      .dwattr DW$242, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2250                      .dwattr DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2251                      .dwattr DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2252              DW$243  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2253                      .dwattr DW$243, DW_AT_name("GPIOB4"), DW_AT_symbol_name("_GPIOB4")
    2254                      .dwattr DW$243, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2255                      .dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2256                      .dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2257              DW$244  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2258                      .dwattr DW$244, DW_AT_name("GPIOB5"), DW_AT_symbol_name("_GPIOB5")
    2259                      .dwattr DW$244, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2260                      .dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2261                      .dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2262              DW$245  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2263                      .dwattr DW$245, DW_AT_name("GPIOB6"), DW_AT_symbol_name("_GPIOB6")
    2264                      .dwattr DW$245, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2265                      .dwattr DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2266                      .dwattr DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2267              DW$246  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2268                      .dwattr DW$246, DW_AT_name("GPIOB7"), DW_AT_symbol_name("_GPIOB7")
    2269                      .dwattr DW$246, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
