TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc.asm          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Tue Apr  8 10:05:52 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=softlib --hll_source=on --mem_model:code
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/repo/jabil2025/gpb/gpb_project_v3/Adc.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\repo\jabil2025\gpb\gpb_project_v3\projects\example_nonBIOS_ram\D
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("DelayUs")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_DelayUs")

     814 000000e5 7640!         LCR       #L$$TOFS              ; [CPU_ALU] |204| 
         000000e6 0000 
     815                      ; call occurs [#L$$TOFS] ; [] |204| 
     816 000000e7 1EA6          MOVL      XAR6,ACC              ; [CPU_ALU] |204| 
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc.asm          PAGE   17

     817 000000e8 28A9          MOV       AL,#61440             ; [CPU_ALU] |204| 
         000000e9 F000 
     818 000000ea 28A8          MOV       AH,#17791             ; [CPU_ALU] |204| 
         000000eb 457F 
     819 000000ec 1E42          MOVL      *-SP[2],ACC           ; [CPU_ALU] |204| 
     820 000000ed 06A6          MOVL      ACC,XAR6              ; [CPU_ALU] |204| 
     821              $C$DW$48        .dwtag  DW_TAG_TI_branch
     822                      .dwattr $C$DW$48, DW_AT_low_pc(0x00)
     823                      .dwattr $C$DW$48, DW_AT_name("FS$$DIV")
     824                      .dwattr $C$DW$48, DW_AT_TI_call
     825              
     826 000000ee 7640!         LCR       #FS$$DIV              ; [CPU_ALU] |204| 
         000000ef 0000 
     827                      ; call occurs [#FS$$DIV] ; [] |204| 
     828 000000f0 1EA6          MOVL      XAR6,ACC              ; [CPU_ALU] |204| 
     829 000000f1 9A00          MOVB      AL,#0                 ; [CPU_ALU] |204| 
     830 000000f2 28A8          MOV       AH,#16448             ; [CPU_ALU] |204| 
         000000f3 4040 
     831 000000f4 1E42          MOVL      *-SP[2],ACC           ; [CPU_ALU] |204| 
     832 000000f5 06A6          MOVL      ACC,XAR6              ; [CPU_ALU] |204| 
     833              $C$DW$49        .dwtag  DW_TAG_TI_branch
     834                      .dwattr $C$DW$49, DW_AT_low_pc(0x00)
     835                      .dwattr $C$DW$49, DW_AT_name("FS$$MPY")
     836                      .dwattr $C$DW$49, DW_AT_TI_call
     837              
     838 000000f6 7640!         LCR       #FS$$MPY              ; [CPU_ALU] |204| 
         000000f7 0000 
     839                      ; call occurs [#FS$$MPY] ; [] |204| 
     840 000000f8 C444          MOVL      XAR6,*-SP[4]          ; [CPU_ALU] |204| 
     841 000000f9 C242          MOVL      *-SP[2],XAR6          ; [CPU_ALU] |204| 
     842              $C$DW$50        .dwtag  DW_TAG_TI_branch
     843                      .dwattr $C$DW$50, DW_AT_low_pc(0x00)
     844                      .dwattr $C$DW$50, DW_AT_name("FS$$MPY")
     845                      .dwattr $C$DW$50, DW_AT_TI_call
     846              
     847 000000fa 7640!         LCR       #FS$$MPY              ; [CPU_ALU] |204| 
         000000fb 0000 
     848                      ; call occurs [#FS$$MPY] ; [] |204| 
     849 000000fc 1E46          MOVL      *-SP[6],ACC           ; [CPU_ALU] |204| 
     850                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Adc.c",line 206,column 2,is_stmt,isa 0
     851              ;----------------------------------------------------------------------
     852              ; 206 | return AnRes;                                                          
     853              ;----------------------------------------------------------------------
     854                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Adc.c",line 208,column 1,is_stmt,isa 0
     855 000000fd FE8A          SUBB      SP,#10                ; [CPU_ARAU] 
     856                      .dwcfi  cfa_offset, -2
     857              $C$DW$51        .dwtag  DW_TAG_TI_branch
     858                      .dwattr $C$DW$51, DW_AT_low_pc(0x00)
     859                      .dwattr $C$DW$51, DW_AT_TI_return
     860              
     861 000000fe 0006          LRETR     ; [CPU_ALU] 
     862                      ; return occurs ; [] 
     863                      .dwattr $C$DW$39, DW_AT_TI_end_file("C:/repo/jabil2025/gpb/gpb_project_v3/Adc.c")
     864                      .dwattr $C$DW$39, DW_AT_TI_end_line(0xd0)
     865                      .dwattr $C$DW$39, DW_AT_TI_end_column(0x01)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc.asm          PAGE   18

     866                      .dwendentry
     867                      .dwendtag $C$DW$39
     868              
     869              ;**************************************************************
     870              ;* UNDEFINED EXTERNAL REFERENCES                              *
     871              ;**************************************************************
     872                      .global _DelayUs
     873                      .global _AdcRegs
     874                      .global UL$$TOFS
     875                      .global FS$$MPY
     876                      .global FS$$DIV
     877                      .global FS$$SUB
     878                      .global FS$$TOL
     879                      .global L$$TOFS
     880              
     881              ;***************************************************************
     882              ;* TYPE INFORMATION                                            *
     883              ;***************************************************************
     884              
     885              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     886                      .dwattr $C$DW$T$20, DW_AT_name("ADCASEQSR_BITS")
     887                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     888              $C$DW$52        .dwtag  DW_TAG_member
     889                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     890                      .dwattr $C$DW$52, DW_AT_name("SEQ1_STATE")
     891                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_SEQ1_STATE")
     892                      .dwattr $C$DW$52, DW_AT_bit_offset(0x0c)
     893                      .dwattr $C$DW$52, DW_AT_bit_size(0x04)
     894                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     895                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     896              
     897              $C$DW$53        .dwtag  DW_TAG_member
     898                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     899                      .dwattr $C$DW$53, DW_AT_name("SEQ2_STATE")
     900                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_SEQ2_STATE")
     901                      .dwattr $C$DW$53, DW_AT_bit_offset(0x09)
     902                      .dwattr $C$DW$53, DW_AT_bit_size(0x03)
     903                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     904                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     905              
     906              $C$DW$54        .dwtag  DW_TAG_member
     907                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     908                      .dwattr $C$DW$54, DW_AT_name("rsvd1")
     909                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_rsvd1")
     910                      .dwattr $C$DW$54, DW_AT_bit_offset(0x08)
     911                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
     912                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     913                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     914              
     915              $C$DW$55        .dwtag  DW_TAG_member
     916                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     917                      .dwattr $C$DW$55, DW_AT_name("SEQ_CNTR")
     918                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_SEQ_CNTR")
     919                      .dwattr $C$DW$55, DW_AT_bit_offset(0x04)
     920                      .dwattr $C$DW$55, DW_AT_bit_size(0x04)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc.asm          PAGE   19

     921                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     922                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     923              
     924              $C$DW$56        .dwtag  DW_TAG_member
     925                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     926                      .dwattr $C$DW$56, DW_AT_name("rsvd2")
     927                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_rsvd2")
     928                      .dwattr $C$DW$56, DW_AT_bit_offset(0x00)
     929                      .dwattr $C$DW$56, DW_AT_bit_size(0x04)
     930                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     931                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     932              
     933                      .dwendtag $C$DW$T$20
     934              
     935              
     936              $C$DW$T$21      .dwtag  DW_TAG_union_type
     937                      .dwattr $C$DW$T$21, DW_AT_name("ADCASEQSR_REG")
     938                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     939              $C$DW$57        .dwtag  DW_TAG_member
     940                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     941                      .dwattr $C$DW$57, DW_AT_name("all")
     942                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_all")
     943                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     944                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     945              
     946              $C$DW$58        .dwtag  DW_TAG_member
     947                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$20)
     948                      .dwattr $C$DW$58, DW_AT_name("bit")
     949                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_bit")
     950                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     951                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     952              
     953                      .dwendtag $C$DW$T$21
     954              
     955              
     956              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     957                      .dwattr $C$DW$T$22, DW_AT_name("ADCCHSELSEQ1_BITS")
     958                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     959              $C$DW$59        .dwtag  DW_TAG_member
     960                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     961                      .dwattr $C$DW$59, DW_AT_name("CONV00")
     962                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_CONV00")
     963                      .dwattr $C$DW$59, DW_AT_bit_offset(0x0c)
     964                      .dwattr $C$DW$59, DW_AT_bit_size(0x04)
     965                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     966                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     967              
     968              $C$DW$60        .dwtag  DW_TAG_member
     969                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     970                      .dwattr $C$DW$60, DW_AT_name("CONV01")
     971                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_CONV01")
     972                      .dwattr $C$DW$60, DW_AT_bit_offset(0x08)
     973                      .dwattr $C$DW$60, DW_AT_bit_size(0x04)
     974                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     975                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc.asm          PAGE   20

     976              
     977              $C$DW$61        .dwtag  DW_TAG_member
     978                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     979                      .dwattr $C$DW$61, DW_AT_name("CONV02")
     980                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_CONV02")
     981                      .dwattr $C$DW$61, DW_AT_bit_offset(0x04)
     982                      .dwattr $C$DW$61, DW_AT_bit_size(0x04)
     983                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     984                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     985              
     986              $C$DW$62        .dwtag  DW_TAG_member
     987                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     988                      .dwattr $C$DW$62, DW_AT_name("CONV03")
     989                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_CONV03")
     990                      .dwattr $C$DW$62, DW_AT_bit_offset(0x00)
     991                      .dwattr $C$DW$62, DW_AT_bit_size(0x04)
     992                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     993                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     994              
     995                      .dwendtag $C$DW$T$22
     996              
     997              
     998              $C$DW$T$23      .dwtag  DW_TAG_union_type
     999                      .dwattr $C$DW$T$23, DW_AT_name("ADCCHSELSEQ1_REG")
    1000                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1001              $C$DW$63        .dwtag  DW_TAG_member
    1002                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
    1003                      .dwattr $C$DW$63, DW_AT_name("all")
    1004                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_all")
    1005                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1006                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1007              
    1008              $C$DW$64        .dwtag  DW_TAG_member
    1009                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$22)
    1010                      .dwattr $C$DW$64, DW_AT_name("bit")
    1011                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_bit")
    1012                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1013                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1014              
    1015                      .dwendtag $C$DW$T$23
    1016              
    1017              
    1018              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1019                      .dwattr $C$DW$T$24, DW_AT_name("ADCCHSELSEQ2_BITS")
    1020                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1021              $C$DW$65        .dwtag  DW_TAG_member
    1022                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
    1023                      .dwattr $C$DW$65, DW_AT_name("CONV04")
    1024                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_CONV04")
    1025                      .dwattr $C$DW$65, DW_AT_bit_offset(0x0c)
    1026                      .dwattr $C$DW$65, DW_AT_bit_size(0x04)
    1027                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1028                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1029              
    1030              $C$DW$66        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc.asm          PAGE   21

    1031                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1032                      .dwattr $C$DW$66, DW_AT_name("CONV05")
    1033                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_CONV05")
    1034                      .dwattr $C$DW$66, DW_AT_bit_offset(0x08)
    1035                      .dwattr $C$DW$66, DW_AT_bit_size(0x04)
    1036                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1037                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1038              
    1039              $C$DW$67        .dwtag  DW_TAG_member
    1040                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1041                      .dwattr $C$DW$67, DW_AT_name("CONV06")
    1042                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_CONV06")
    1043                      .dwattr $C$DW$67, DW_AT_bit_offset(0x04)
    1044                      .dwattr $C$DW$67, DW_AT_bit_size(0x04)
    1045                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1046                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1047              
    1048              $C$DW$68        .dwtag  DW_TAG_member
    1049                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1050                      .dwattr $C$DW$68, DW_AT_name("CONV07")
    1051                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_CONV07")
    1052                      .dwattr $C$DW$68, DW_AT_bit_offset(0x00)
    1053                      .dwattr $C$DW$68, DW_AT_bit_size(0x04)
    1054                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1055                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1056              
    1057                      .dwendtag $C$DW$T$24
    1058              
    1059              
    1060              $C$DW$T$25      .dwtag  DW_TAG_union_type
    1061                      .dwattr $C$DW$T$25, DW_AT_name("ADCCHSELSEQ2_REG")
    1062                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1063              $C$DW$69        .dwtag  DW_TAG_member
    1064                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1065                      .dwattr $C$DW$69, DW_AT_name("all")
    1066                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_all")
    1067                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1068                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1069              
    1070              $C$DW$70        .dwtag  DW_TAG_member
    1071                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$24)
    1072                      .dwattr $C$DW$70, DW_AT_name("bit")
    1073                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_bit")
    1074                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1075                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1076              
    1077                      .dwendtag $C$DW$T$25
    1078              
    1079              
    1080              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1081                      .dwattr $C$DW$T$26, DW_AT_name("ADCCHSELSEQ3_BITS")
    1082                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1083              $C$DW$71        .dwtag  DW_TAG_member
    1084                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1085                      .dwattr $C$DW$71, DW_AT_name("CONV08")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc.asm          PAGE   22

    1086                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_CONV08")
    1087                      .dwattr $C$DW$71, DW_AT_bit_offset(0x0c)
    1088                      .dwattr $C$DW$71, DW_AT_bit_size(0x04)
    1089                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1090                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1091              
    1092              $C$DW$72        .dwtag  DW_TAG_member
    1093                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1094                      .dwattr $C$DW$72, DW_AT_name("CONV09")
    1095                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_CONV09")
    1096                      .dwattr $C$DW$72, DW_AT_bit_offset(0x08)
    1097                      .dwattr $C$DW$72, DW_AT_bit_size(0x04)
    1098                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1099                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1100              
    1101              $C$DW$73        .dwtag  DW_TAG_member
    1102                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1103                      .dwattr $C$DW$73, DW_AT_name("CONV10")
    1104                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_CONV10")
    1105                      .dwattr $C$DW$73, DW_AT_bit_offset(0x04)
    1106                      .dwattr $C$DW$73, DW_AT_bit_size(0x04)
    1107                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1108                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1109              
    1110              $C$DW$74        .dwtag  DW_TAG_member
    1111                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1112                      .dwattr $C$DW$74, DW_AT_name("CONV11")
    1113                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_CONV11")
    1114                      .dwattr $C$DW$74, DW_AT_bit_offset(0x00)
    1115                      .dwattr $C$DW$74, DW_AT_bit_size(0x04)
    1116                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1117                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1118              
    1119                      .dwendtag $C$DW$T$26
    1120              
    1121              
    1122              $C$DW$T$27      .dwtag  DW_TAG_union_type
    1123                      .dwattr $C$DW$T$27, DW_AT_name("ADCCHSELSEQ3_REG")
    1124                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1125              $C$DW$75        .dwtag  DW_TAG_member
    1126                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1127                      .dwattr $C$DW$75, DW_AT_name("all")
    1128                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_all")
    1129                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1130                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1131              
    1132              $C$DW$76        .dwtag  DW_TAG_member
    1133                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$26)
    1134                      .dwattr $C$DW$76, DW_AT_name("bit")
    1135                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_bit")
    1136                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1137                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1138              
    1139                      .dwendtag $C$DW$T$27
    1140              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc.asm          PAGE   23

    1141              
    1142              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1143                      .dwattr $C$DW$T$28, DW_AT_name("ADCCHSELSEQ4_BITS")
    1144                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    1145              $C$DW$77        .dwtag  DW_TAG_member
    1146                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1147                      .dwattr $C$DW$77, DW_AT_name("CONV12")
    1148                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_CONV12")
    1149                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0c)
    1150                      .dwattr $C$DW$77, DW_AT_bit_size(0x04)
    1151                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1152                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1153              
    1154              $C$DW$78        .dwtag  DW_TAG_member
    1155                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1156                      .dwattr $C$DW$78, DW_AT_name("CONV13")
    1157                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_CONV13")
    1158                      .dwattr $C$DW$78, DW_AT_bit_offset(0x08)
    1159                      .dwattr $C$DW$78, DW_AT_bit_size(0x04)
    1160                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1161                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1162              
    1163              $C$DW$79        .dwtag  DW_TAG_member
    1164                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1165                      .dwattr $C$DW$79, DW_AT_name("CONV14")
    1166                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_CONV14")
    1167                      .dwattr $C$DW$79, DW_AT_bit_offset(0x04)
    1168                      .dwattr $C$DW$79, DW_AT_bit_size(0x04)
    1169                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1170                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1171              
    1172              $C$DW$80        .dwtag  DW_TAG_member
    1173                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1174                      .dwattr $C$DW$80, DW_AT_name("CONV15")
    1175                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_CONV15")
    1176                      .dwattr $C$DW$80, DW_AT_bit_offset(0x00)
    1177                      .dwattr $C$DW$80, DW_AT_bit_size(0x04)
    1178                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1179                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1180              
    1181                      .dwendtag $C$DW$T$28
    1182              
    1183              
    1184              $C$DW$T$29      .dwtag  DW_TAG_union_type
    1185                      .dwattr $C$DW$T$29, DW_AT_name("ADCCHSELSEQ4_REG")
    1186                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1187              $C$DW$81        .dwtag  DW_TAG_member
    1188                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1189                      .dwattr $C$DW$81, DW_AT_name("all")
    1190                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_all")
    1191                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1192                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1193              
    1194              $C$DW$82        .dwtag  DW_TAG_member
    1195                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$28)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc.asm          PAGE   24

    1196                      .dwattr $C$DW$82, DW_AT_name("bit")
    1197                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_bit")
    1198                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1199                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1200              
    1201                      .dwendtag $C$DW$T$29
    1202              
    1203              
    1204              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1205                      .dwattr $C$DW$T$30, DW_AT_name("ADCMAXCONV_BITS")
    1206                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    1207              $C$DW$83        .dwtag  DW_TAG_member
    1208                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1209                      .dwattr $C$DW$83, DW_AT_name("MAX_CONV1")
    1210                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_MAX_CONV1")
    1211                      .dwattr $C$DW$83, DW_AT_bit_offset(0x0c)
    1212                      .dwattr $C$DW$83, DW_AT_bit_size(0x04)
    1213                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1214                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1215              
    1216              $C$DW$84        .dwtag  DW_TAG_member
    1217                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1218                      .dwattr $C$DW$84, DW_AT_name("MAX_CONV2")
    1219                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_MAX_CONV2")
    1220                      .dwattr $C$DW$84, DW_AT_bit_offset(0x09)
    1221                      .dwattr $C$DW$84, DW_AT_bit_size(0x03)
    1222                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1223                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1224              
    1225              $C$DW$85        .dwtag  DW_TAG_member
    1226                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1227                      .dwattr $C$DW$85, DW_AT_name("rsvd1")
    1228                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_rsvd1")
    1229                      .dwattr $C$DW$85, DW_AT_bit_offset(0x00)
    1230                      .dwattr $C$DW$85, DW_AT_bit_size(0x09)
    1231                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1232                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1233              
    1234                      .dwendtag $C$DW$T$30
    1235              
    1236              
    1237              $C$DW$T$31      .dwtag  DW_TAG_union_type
    1238                      .dwattr $C$DW$T$31, DW_AT_name("ADCMAXCONV_REG")
    1239                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1240              $C$DW$86        .dwtag  DW_TAG_member
    1241                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1242                      .dwattr $C$DW$86, DW_AT_name("all")
    1243                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_all")
    1244                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1245                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1246              
    1247              $C$DW$87        .dwtag  DW_TAG_member
    1248                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$30)
    1249                      .dwattr $C$DW$87, DW_AT_name("bit")
    1250                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc.asm          PAGE   25

    1251                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1252                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1253              
    1254                      .dwendtag $C$DW$T$31
    1255              
    1256              
    1257              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1258                      .dwattr $C$DW$T$32, DW_AT_name("ADCST_BITS")
    1259                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1260              $C$DW$88        .dwtag  DW_TAG_member
    1261                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1262                      .dwattr $C$DW$88, DW_AT_name("INT_SEQ1")
    1263                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_INT_SEQ1")
    1264                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0f)
    1265                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1266                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1267                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1268              
    1269              $C$DW$89        .dwtag  DW_TAG_member
    1270                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1271                      .dwattr $C$DW$89, DW_AT_name("INT_SEQ2")
    1272                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_INT_SEQ2")
    1273                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0e)
    1274                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    1275                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1276                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1277              
    1278              $C$DW$90        .dwtag  DW_TAG_member
    1279                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1280                      .dwattr $C$DW$90, DW_AT_name("SEQ1_BSY")
    1281                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_SEQ1_BSY")
    1282                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0d)
    1283                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1284                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1285                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1286              
    1287              $C$DW$91        .dwtag  DW_TAG_member
    1288                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1289                      .dwattr $C$DW$91, DW_AT_name("SEQ2_BSY")
    1290                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_SEQ2_BSY")
    1291                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0c)
    1292                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1293                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1294                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1295              
    1296              $C$DW$92        .dwtag  DW_TAG_member
    1297                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1298                      .dwattr $C$DW$92, DW_AT_name("INT_SEQ1_CLR")
    1299                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_INT_SEQ1_CLR")
    1300                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0b)
    1301                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1302                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1303                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1304              
    1305              $C$DW$93        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc.asm          PAGE   26

    1306                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1307                      .dwattr $C$DW$93, DW_AT_name("INT_SEQ2_CLR")
    1308                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_INT_SEQ2_CLR")
    1309                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0a)
    1310                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1311                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1312                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1313              
    1314              $C$DW$94        .dwtag  DW_TAG_member
    1315                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1316                      .dwattr $C$DW$94, DW_AT_name("EOS_BUF1")
    1317                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_EOS_BUF1")
    1318                      .dwattr $C$DW$94, DW_AT_bit_offset(0x09)
    1319                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1320                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1321                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1322              
    1323              $C$DW$95        .dwtag  DW_TAG_member
    1324                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1325                      .dwattr $C$DW$95, DW_AT_name("EOS_BUF2")
    1326                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_EOS_BUF2")
    1327                      .dwattr $C$DW$95, DW_AT_bit_offset(0x08)
    1328                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1329                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1330                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1331              
    1332              $C$DW$96        .dwtag  DW_TAG_member
    1333                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1334                      .dwattr $C$DW$96, DW_AT_name("rsvd1")
    1335                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_rsvd1")
    1336                      .dwattr $C$DW$96, DW_AT_bit_offset(0x00)
    1337                      .dwattr $C$DW$96, DW_AT_bit_size(0x08)
    1338                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1339                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1340              
    1341                      .dwendtag $C$DW$T$32
    1342              
    1343              
    1344              $C$DW$T$33      .dwtag  DW_TAG_union_type
    1345                      .dwattr $C$DW$T$33, DW_AT_name("ADCST_REG")
    1346                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1347              $C$DW$97        .dwtag  DW_TAG_member
    1348                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1349                      .dwattr $C$DW$97, DW_AT_name("all")
    1350                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_all")
    1351                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1352                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1353              
    1354              $C$DW$98        .dwtag  DW_TAG_member
    1355                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$32)
    1356                      .dwattr $C$DW$98, DW_AT_name("bit")
    1357                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_bit")
    1358                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1359                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1360              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc.asm          PAGE   27

    1361                      .dwendtag $C$DW$T$33
    1362              
    1363              
    1364              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1365                      .dwattr $C$DW$T$34, DW_AT_name("ADCTRL1_BITS")
    1366                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1367              $C$DW$99        .dwtag  DW_TAG_member
    1368                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1369                      .dwattr $C$DW$99, DW_AT_name("rsvd1")
    1370                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_rsvd1")
    1371                      .dwattr $C$DW$99, DW_AT_bit_offset(0x0c)
    1372                      .dwattr $C$DW$99, DW_AT_bit_size(0x04)
    1373                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1374                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1375              
    1376              $C$DW$100       .dwtag  DW_TAG_member
    1377                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1378                      .dwattr $C$DW$100, DW_AT_name("SEQ_CASC")
    1379                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_SEQ_CASC")
    1380                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0b)
    1381                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1382                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1383                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1384              
    1385              $C$DW$101       .dwtag  DW_TAG_member
    1386                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1387                      .dwattr $C$DW$101, DW_AT_name("SEQ_OVRD")
    1388                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_SEQ_OVRD")
    1389                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0a)
    1390                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1391                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1392                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1393              
    1394              $C$DW$102       .dwtag  DW_TAG_member
    1395                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1396                      .dwattr $C$DW$102, DW_AT_name("CONT_RUN")
    1397                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_CONT_RUN")
    1398                      .dwattr $C$DW$102, DW_AT_bit_offset(0x09)
    1399                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1400                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1401                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1402              
    1403              $C$DW$103       .dwtag  DW_TAG_member
    1404                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1405                      .dwattr $C$DW$103, DW_AT_name("CPS")
    1406                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_CPS")
    1407                      .dwattr $C$DW$103, DW_AT_bit_offset(0x08)
    1408                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1409                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1410                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1411              
    1412              $C$DW$104       .dwtag  DW_TAG_member
    1413                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1414                      .dwattr $C$DW$104, DW_AT_name("ACQ_PS")
    1415                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_ACQ_PS")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc.asm          PAGE   28

    1416                      .dwattr $C$DW$104, DW_AT_bit_offset(0x04)
    1417                      .dwattr $C$DW$104, DW_AT_bit_size(0x04)
    1418                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1419                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1420              
    1421              $C$DW$105       .dwtag  DW_TAG_member
    1422                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1423                      .dwattr $C$DW$105, DW_AT_name("SUSMOD")
    1424                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_SUSMOD")
    1425                      .dwattr $C$DW$105, DW_AT_bit_offset(0x02)
    1426                      .dwattr $C$DW$105, DW_AT_bit_size(0x02)
    1427                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1428                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1429              
    1430              $C$DW$106       .dwtag  DW_TAG_member
    1431                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1432                      .dwattr $C$DW$106, DW_AT_name("RESET")
    1433                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_RESET")
    1434                      .dwattr $C$DW$106, DW_AT_bit_offset(0x01)
    1435                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1436                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1437                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1438              
    1439              $C$DW$107       .dwtag  DW_TAG_member
    1440                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1441                      .dwattr $C$DW$107, DW_AT_name("rsvd2")
    1442                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_rsvd2")
    1443                      .dwattr $C$DW$107, DW_AT_bit_offset(0x00)
    1444                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1445                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1446                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1447              
    1448                      .dwendtag $C$DW$T$34
    1449              
    1450              
    1451              $C$DW$T$35      .dwtag  DW_TAG_union_type
    1452                      .dwattr $C$DW$T$35, DW_AT_name("ADCTRL1_REG")
    1453                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1454              $C$DW$108       .dwtag  DW_TAG_member
    1455                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1456                      .dwattr $C$DW$108, DW_AT_name("all")
    1457                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_all")
    1458                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1459                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1460              
    1461              $C$DW$109       .dwtag  DW_TAG_member
    1462                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$34)
    1463                      .dwattr $C$DW$109, DW_AT_name("bit")
    1464                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_bit")
    1465                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1466                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1467              
    1468                      .dwendtag $C$DW$T$35
    1469              
    1470              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc.asm          PAGE   29

    1471              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1472                      .dwattr $C$DW$T$36, DW_AT_name("ADCTRL2_BITS")
    1473                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1474              $C$DW$110       .dwtag  DW_TAG_member
    1475                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1476                      .dwattr $C$DW$110, DW_AT_name("EVB_SOC_SEQ2")
    1477                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_EVB_SOC_SEQ2")
    1478                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0f)
    1479                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1480                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1481                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1482              
    1483              $C$DW$111       .dwtag  DW_TAG_member
    1484                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1485                      .dwattr $C$DW$111, DW_AT_name("rsvd1")
    1486                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_rsvd1")
    1487                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0e)
    1488                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1489                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1490                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1491              
    1492              $C$DW$112       .dwtag  DW_TAG_member
    1493                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1494                      .dwattr $C$DW$112, DW_AT_name("INT_MOD_SEQ2")
    1495                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_INT_MOD_SEQ2")
    1496                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0d)
    1497                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1498                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1499                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1500              
    1501              $C$DW$113       .dwtag  DW_TAG_member
    1502                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1503                      .dwattr $C$DW$113, DW_AT_name("INT_ENA_SEQ2")
    1504                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_INT_ENA_SEQ2")
    1505                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0c)
    1506                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1507                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1508                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1509              
    1510              $C$DW$114       .dwtag  DW_TAG_member
    1511                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1512                      .dwattr $C$DW$114, DW_AT_name("rsvd2")
    1513                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_rsvd2")
    1514                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0b)
    1515                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1516                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1517                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1518              
    1519              $C$DW$115       .dwtag  DW_TAG_member
    1520                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1521                      .dwattr $C$DW$115, DW_AT_name("SOC_SEQ2")
    1522                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_SOC_SEQ2")
    1523                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0a)
    1524                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1525                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc.asm          PAGE   30

    1526                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1527              
    1528              $C$DW$116       .dwtag  DW_TAG_member
    1529                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1530                      .dwattr $C$DW$116, DW_AT_name("RST_SEQ2")
    1531                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_RST_SEQ2")
    1532                      .dwattr $C$DW$116, DW_AT_bit_offset(0x09)
    1533                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1534                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1535                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1536              
    1537              $C$DW$117       .dwtag  DW_TAG_member
    1538                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1539                      .dwattr $C$DW$117, DW_AT_name("EXT_SOC_SEQ1")
    1540                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_EXT_SOC_SEQ1")
    1541                      .dwattr $C$DW$117, DW_AT_bit_offset(0x08)
    1542                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1543                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1544                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1545              
    1546              $C$DW$118       .dwtag  DW_TAG_member
    1547                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1548                      .dwattr $C$DW$118, DW_AT_name("EVA_SOC_SEQ1")
    1549                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_EVA_SOC_SEQ1")
    1550                      .dwattr $C$DW$118, DW_AT_bit_offset(0x07)
    1551                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1552                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1553                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1554              
    1555              $C$DW$119       .dwtag  DW_TAG_member
    1556                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1557                      .dwattr $C$DW$119, DW_AT_name("rsvd3")
    1558                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_rsvd3")
    1559                      .dwattr $C$DW$119, DW_AT_bit_offset(0x06)
    1560                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1561                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1562                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1563              
    1564              $C$DW$120       .dwtag  DW_TAG_member
    1565                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1566                      .dwattr $C$DW$120, DW_AT_name("INT_MOD_SEQ1")
    1567                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_INT_MOD_SEQ1")
    1568                      .dwattr $C$DW$120, DW_AT_bit_offset(0x05)
    1569                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1570                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1571                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1572              
    1573              $C$DW$121       .dwtag  DW_TAG_member
    1574                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1575                      .dwattr $C$DW$121, DW_AT_name("INT_ENA_SEQ1")
    1576                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_INT_ENA_SEQ1")
    1577                      .dwattr $C$DW$121, DW_AT_bit_offset(0x04)
    1578                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1579                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1580                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc.asm          PAGE   31

    1581              
    1582              $C$DW$122       .dwtag  DW_TAG_member
    1583                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1584                      .dwattr $C$DW$122, DW_AT_name("rsvd4")
    1585                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_rsvd4")
    1586                      .dwattr $C$DW$122, DW_AT_bit_offset(0x03)
    1587                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1588                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1589                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1590              
    1591              $C$DW$123       .dwtag  DW_TAG_member
    1592                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1593                      .dwattr $C$DW$123, DW_AT_name("SOC_SEQ1")
    1594                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_SOC_SEQ1")
    1595                      .dwattr $C$DW$123, DW_AT_bit_offset(0x02)
    1596                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1597                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1598                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1599              
    1600              $C$DW$124       .dwtag  DW_TAG_member
    1601                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1602                      .dwattr $C$DW$124, DW_AT_name("RST_SEQ1")
    1603                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_RST_SEQ1")
    1604                      .dwattr $C$DW$124, DW_AT_bit_offset(0x01)
    1605                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1606                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1607                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1608              
    1609              $C$DW$125       .dwtag  DW_TAG_member
    1610                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1611                      .dwattr $C$DW$125, DW_AT_name("EVB_SOC_SEQ")
    1612                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_EVB_SOC_SEQ")
    1613                      .dwattr $C$DW$125, DW_AT_bit_offset(0x00)
    1614                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1615                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1616                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1617              
    1618                      .dwendtag $C$DW$T$36
    1619              
    1620              
    1621              $C$DW$T$37      .dwtag  DW_TAG_union_type
    1622                      .dwattr $C$DW$T$37, DW_AT_name("ADCTRL2_REG")
    1623                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1624              $C$DW$126       .dwtag  DW_TAG_member
    1625                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1626                      .dwattr $C$DW$126, DW_AT_name("all")
    1627                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_all")
    1628                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1629                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1630              
    1631              $C$DW$127       .dwtag  DW_TAG_member
    1632                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$36)
    1633                      .dwattr $C$DW$127, DW_AT_name("bit")
    1634                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_bit")
    1635                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc.asm          PAGE   32

    1636                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1637              
    1638                      .dwendtag $C$DW$T$37
    1639              
    1640              
    1641              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1642                      .dwattr $C$DW$T$38, DW_AT_name("ADCTRL3_BITS")
    1643                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1644              $C$DW$128       .dwtag  DW_TAG_member
    1645                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1646                      .dwattr $C$DW$128, DW_AT_name("SMODE_SEL")
    1647                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_SMODE_SEL")
    1648                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0f)
    1649                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1650                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1651                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1652              
    1653              $C$DW$129       .dwtag  DW_TAG_member
    1654                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1655                      .dwattr $C$DW$129, DW_AT_name("ADCCLKPS")
    1656                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_ADCCLKPS")
    1657                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0b)
    1658                      .dwattr $C$DW$129, DW_AT_bit_size(0x04)
    1659                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1660                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1661              
    1662              $C$DW$130       .dwtag  DW_TAG_member
    1663                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1664                      .dwattr $C$DW$130, DW_AT_name("ADCPWDN")
    1665                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_ADCPWDN")
    1666                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0a)
    1667                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1668                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1669                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1670              
    1671              $C$DW$131       .dwtag  DW_TAG_member
    1672                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1673                      .dwattr $C$DW$131, DW_AT_name("ADCBGRFDN")
    1674                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_ADCBGRFDN")
    1675                      .dwattr $C$DW$131, DW_AT_bit_offset(0x08)
    1676                      .dwattr $C$DW$131, DW_AT_bit_size(0x02)
    1677                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1678                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1679              
    1680              $C$DW$132       .dwtag  DW_TAG_member
    1681                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1682                      .dwattr $C$DW$132, DW_AT_name("ADCEXTREF")
    1683                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_ADCEXTREF")
    1684                      .dwattr $C$DW$132, DW_AT_bit_offset(0x07)
    1685                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1686                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1687                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1688              
    1689              $C$DW$133       .dwtag  DW_TAG_member
    1690                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc.asm          PAGE   33

    1691                      .dwattr $C$DW$133, DW_AT_name("rsvd1")
    1692                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_rsvd1")
    1693                      .dwattr $C$DW$133, DW_AT_bit_offset(0x00)
    1694                      .dwattr $C$DW$133, DW_AT_bit_size(0x07)
    1695                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1696                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1697              
    1698                      .dwendtag $C$DW$T$38
    1699              
    1700              
    1701              $C$DW$T$39      .dwtag  DW_TAG_union_type
    1702                      .dwattr $C$DW$T$39, DW_AT_name("ADCTRL3_REG")
    1703                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1704              $C$DW$134       .dwtag  DW_TAG_member
    1705                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1706                      .dwattr $C$DW$134, DW_AT_name("all")
    1707                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_all")
    1708                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1709                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1710              
    1711              $C$DW$135       .dwtag  DW_TAG_member
    1712                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$38)
    1713                      .dwattr $C$DW$135, DW_AT_name("bit")
    1714                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_bit")
    1715                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1716                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1717              
    1718                      .dwendtag $C$DW$T$39
    1719              
    1720              
    1721              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1722                      .dwattr $C$DW$T$40, DW_AT_name("ADC_REGS")
    1723                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x1a)
    1724              $C$DW$136       .dwtag  DW_TAG_member
    1725                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$35)
    1726                      .dwattr $C$DW$136, DW_AT_name("ADCTRL1")
    1727                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_ADCTRL1")
    1728                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1729                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1730              
    1731              $C$DW$137       .dwtag  DW_TAG_member
    1732                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$37)
    1733                      .dwattr $C$DW$137, DW_AT_name("ADCTRL2")
    1734                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_ADCTRL2")
    1735                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1736                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1737              
    1738              $C$DW$138       .dwtag  DW_TAG_member
    1739                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$31)
    1740                      .dwattr $C$DW$138, DW_AT_name("ADCMAXCONV")
    1741                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_ADCMAXCONV")
    1742                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1743                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1744              
    1745              $C$DW$139       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc.asm          PAGE   34

    1746                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$23)
    1747                      .dwattr $C$DW$139, DW_AT_name("ADCCHSELSEQ1")
    1748                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_ADCCHSELSEQ1")
    1749                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1750                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1751              
    1752              $C$DW$140       .dwtag  DW_TAG_member
    1753                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$25)
    1754                      .dwattr $C$DW$140, DW_AT_name("ADCCHSELSEQ2")
    1755                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_ADCCHSELSEQ2")
    1756                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1757                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1758              
    1759              $C$DW$141       .dwtag  DW_TAG_member
    1760                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$27)
    1761                      .dwattr $C$DW$141, DW_AT_name("ADCCHSELSEQ3")
    1762                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_ADCCHSELSEQ3")
    1763                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1764                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1765              
    1766              $C$DW$142       .dwtag  DW_TAG_member
    1767                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$29)
    1768                      .dwattr $C$DW$142, DW_AT_name("ADCCHSELSEQ4")
    1769                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_ADCCHSELSEQ4")
    1770                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1771                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1772              
    1773              $C$DW$143       .dwtag  DW_TAG_member
    1774                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$21)
    1775                      .dwattr $C$DW$143, DW_AT_name("ADCASEQSR")
    1776                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_ADCASEQSR")
    1777                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1778                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1779              
    1780              $C$DW$144       .dwtag  DW_TAG_member
    1781                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1782                      .dwattr $C$DW$144, DW_AT_name("ADCRESULT0")
    1783                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_ADCRESULT0")
    1784                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1785                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1786              
    1787              $C$DW$145       .dwtag  DW_TAG_member
    1788                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1789                      .dwattr $C$DW$145, DW_AT_name("ADCRESULT1")
    1790                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_ADCRESULT1")
    1791                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1792                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1793              
    1794              $C$DW$146       .dwtag  DW_TAG_member
    1795                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1796                      .dwattr $C$DW$146, DW_AT_name("ADCRESULT2")
    1797                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_ADCRESULT2")
    1798                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1799                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1800              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc.asm          PAGE   35

    1801              $C$DW$147       .dwtag  DW_TAG_member
    1802                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1803                      .dwattr $C$DW$147, DW_AT_name("ADCRESULT3")
    1804                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_ADCRESULT3")
    1805                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1806                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1807              
    1808              $C$DW$148       .dwtag  DW_TAG_member
    1809                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1810                      .dwattr $C$DW$148, DW_AT_name("ADCRESULT4")
    1811                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_ADCRESULT4")
    1812                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1813                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1814              
    1815              $C$DW$149       .dwtag  DW_TAG_member
    1816                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1817                      .dwattr $C$DW$149, DW_AT_name("ADCRESULT5")
    1818                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_ADCRESULT5")
    1819                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1820                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1821              
    1822              $C$DW$150       .dwtag  DW_TAG_member
    1823                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1824                      .dwattr $C$DW$150, DW_AT_name("ADCRESULT6")
    1825                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_ADCRESULT6")
    1826                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1827                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1828              
    1829              $C$DW$151       .dwtag  DW_TAG_member
    1830                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1831                      .dwattr $C$DW$151, DW_AT_name("ADCRESULT7")
    1832                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_ADCRESULT7")
    1833                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1834                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1835              
    1836              $C$DW$152       .dwtag  DW_TAG_member
    1837                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1838                      .dwattr $C$DW$152, DW_AT_name("ADCRESULT8")
    1839                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_ADCRESULT8")
    1840                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1841                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1842              
    1843              $C$DW$153       .dwtag  DW_TAG_member
    1844                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1845                      .dwattr $C$DW$153, DW_AT_name("ADCRESULT9")
    1846                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_ADCRESULT9")
    1847                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1848                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1849              
    1850              $C$DW$154       .dwtag  DW_TAG_member
    1851                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1852                      .dwattr $C$DW$154, DW_AT_name("ADCRESULT10")
    1853                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_ADCRESULT10")
    1854                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1855                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc.asm          PAGE   36

    1856              
    1857              $C$DW$155       .dwtag  DW_TAG_member
    1858                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1859                      .dwattr $C$DW$155, DW_AT_name("ADCRESULT11")
    1860                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_ADCRESULT11")
    1861                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1862                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1863              
    1864              $C$DW$156       .dwtag  DW_TAG_member
    1865                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1866                      .dwattr $C$DW$156, DW_AT_name("ADCRESULT12")
    1867                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_ADCRESULT12")
    1868                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1869                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1870              
    1871              $C$DW$157       .dwtag  DW_TAG_member
    1872                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1873                      .dwattr $C$DW$157, DW_AT_name("ADCRESULT13")
    1874                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_ADCRESULT13")
    1875                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1876                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1877              
    1878              $C$DW$158       .dwtag  DW_TAG_member
    1879                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1880                      .dwattr $C$DW$158, DW_AT_name("ADCRESULT14")
    1881                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_ADCRESULT14")
    1882                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1883                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1884              
    1885              $C$DW$159       .dwtag  DW_TAG_member
    1886                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1887                      .dwattr $C$DW$159, DW_AT_name("ADCRESULT15")
    1888                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_ADCRESULT15")
    1889                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1890                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1891              
    1892              $C$DW$160       .dwtag  DW_TAG_member
    1893                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$39)
    1894                      .dwattr $C$DW$160, DW_AT_name("ADCTRL3")
    1895                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_ADCTRL3")
    1896                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1897                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1898              
    1899              $C$DW$161       .dwtag  DW_TAG_member
    1900                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$33)
    1901                      .dwattr $C$DW$161, DW_AT_name("ADCST")
    1902                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_ADCST")
    1903                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1904                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1905              
    1906                      .dwendtag $C$DW$T$40
    1907              
    1908              $C$DW$162       .dwtag  DW_TAG_TI_far_type
    1909                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$40)
    1910              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc.asm          PAGE   37

    1911              $C$DW$T$54      .dwtag  DW_TAG_volatile_type
    1912                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$162)
    1913              
    1914              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1915                      .dwattr $C$DW$T$2, DW_AT_name("void")
    1916              
    1917              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1918                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1919                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1920                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1921              
    1922              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1923                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1924                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1925                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1926              
    1927              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1928                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1929                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1930                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1931              
    1932              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1933                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1934                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1935                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1936              
    1937              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1938                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1939                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1940                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1941              
    1942              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1943                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1944                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1945                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1946              
    1947              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1948                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1949                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1950                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1951              
    1952              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1953                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1954                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1955                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1956              
    1957              $C$DW$T$19      .dwtag  DW_TAG_typedef
    1958                      .dwattr $C$DW$T$19, DW_AT_name("Uint16")
    1959                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$11)
    1960                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1961              
    1962              $C$DW$163       .dwtag  DW_TAG_TI_far_type
    1963                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1964              
    1965              $C$DW$T$64      .dwtag  DW_TAG_volatile_type
