TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc1570.asm      PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Tue Apr  8 10:05:52 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=softlib --hll_source=on --mem_model:code
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/repo/jabil2025/gpb/gpb_project_v3/Adc1570.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\repo\jabil2025\gpb\gpb_project_v3\projects\example_nonBIOS_ram\D
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("SpiTxNotReady")

     456                      .dwcfi  cfa_offset, -4
     457              $C$DW$34        .dwtag  DW_TAG_variable
     458                      .dwattr $C$DW$34, DW_AT_name("State")
     459                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_State")
     460                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     461                      .dwattr $C$DW$34, DW_AT_location[DW_OP_breg20 -1]
     462              
     463 00000055 9641          MOV       *-SP[1],AL            ; [CPU_ALU] |106| 
     464                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Adc1570.c",line 108,column 2,is_stmt,isa 0
     465              ;----------------------------------------------------------------------
     466              ; 108 | if(State) {                                                            
     467              ;----------------------------------------------------------------------
     468 00000056 5200          CMPB      AL,#0                 ; [CPU_ALU] |108| 
     469 00000057 6106          B         $C$L7,EQ              ; [CPU_ALU] |108| 
     470                      ; branchcc occurs ; [] |108| 
     471                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Adc1570.c",line 109,column 3,is_stmt,isa 0
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc1570.asm      PAGE   10

     472              ;----------------------------------------------------------------------
     473              ; 109 | GpioDataRegs.GPDCLEAR.bit.GPIOD0 = 1;                   // Set CS_AD LO
     474              ;     | W                                                                      
     475              ; 111 | else {                                                                 
     476              ;----------------------------------------------------------------------
     477 00000058 761F!         MOVW      DP,#_GpioDataRegs+14  ; [CPU_ARAU] 
         00000059 0000 
     478 0000005a 1A0E!         OR        @$BLOCKED(_GpioDataRegs)+14,#0x0001 ; [CPU_ALU] |109| 
         0000005b 0001 
     479 0000005c 6F05          B         $C$L8,UNC             ; [CPU_ALU] 
     480                      ; branch occurs ; [] 
     481 0000005d       $C$L7:    
     482                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Adc1570.c",line 112,column 3,is_stmt,isa 0
     483              ;----------------------------------------------------------------------
     484              ; 112 | GpioDataRegs.GPDSET.bit.GPIOD0  = 1;                    // Set CS_AD HI
     485              ;     | GH                                                                     
     486              ;----------------------------------------------------------------------
     487 0000005d 761F!         MOVW      DP,#_GpioDataRegs+13  ; [CPU_ARAU] 
         0000005e 0000 
     488 0000005f 1A0D!         OR        @$BLOCKED(_GpioDataRegs)+13,#0x0001 ; [CPU_ALU] |112| 
         00000060 0001 
     489                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Adc1570.c",line 115,column 1,is_stmt,isa 0
     490 00000061       $C$L8:    
     491 00000061 FE82          SUBB      SP,#2                 ; [CPU_ARAU] 
     492                      .dwcfi  cfa_offset, -2
     493              $C$DW$35        .dwtag  DW_TAG_TI_branch
     494                      .dwattr $C$DW$35, DW_AT_low_pc(0x00)
     495                      .dwattr $C$DW$35, DW_AT_TI_return
     496              
     497 00000062 0006          LRETR     ; [CPU_ALU] 
     498                      ; return occurs ; [] 
     499                      .dwattr $C$DW$32, DW_AT_TI_end_file("C:/repo/jabil2025/gpb/gpb_project_v3/Adc1570.c")
     500                      .dwattr $C$DW$32, DW_AT_TI_end_line(0x73)
     501                      .dwattr $C$DW$32, DW_AT_TI_end_column(0x01)
     502                      .dwendentry
     503                      .dwendtag $C$DW$32
     504              
     505              ;**************************************************************
     506              ;* UNDEFINED EXTERNAL REFERENCES                              *
     507              ;**************************************************************
     508                      .global _SpiTxNotReady
     509                      .global _ConfigSpi
     510                      .global _TxSpi
     511                      .global _SpiRxNotReady
     512                      .global _RxSpi
     513                      .global _GpioDataRegs
     514                      .global U$$TOFS
     515                      .global FS$$DIV
     516                      .global FS$$MPY
     517                      .global FS$$TOL
     518              
     519              ;***************************************************************
     520              ;* TYPE INFORMATION                                            *
     521              ;***************************************************************
     522              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc1570.asm      PAGE   11

     523              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     524                      .dwattr $C$DW$T$20, DW_AT_name("GPACLEAR_BITS")
     525                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     526              $C$DW$36        .dwtag  DW_TAG_member
     527                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     528                      .dwattr $C$DW$36, DW_AT_name("GPIOA0")
     529                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_GPIOA0")
     530                      .dwattr $C$DW$36, DW_AT_bit_offset(0x0f)
     531                      .dwattr $C$DW$36, DW_AT_bit_size(0x01)
     532                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     533                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     534              
     535              $C$DW$37        .dwtag  DW_TAG_member
     536                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     537                      .dwattr $C$DW$37, DW_AT_name("GPIOA1")
     538                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_GPIOA1")
     539                      .dwattr $C$DW$37, DW_AT_bit_offset(0x0e)
     540                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     541                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     542                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     543              
     544              $C$DW$38        .dwtag  DW_TAG_member
     545                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     546                      .dwattr $C$DW$38, DW_AT_name("GPIOA2")
     547                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_GPIOA2")
     548                      .dwattr $C$DW$38, DW_AT_bit_offset(0x0d)
     549                      .dwattr $C$DW$38, DW_AT_bit_size(0x01)
     550                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     551                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     552              
     553              $C$DW$39        .dwtag  DW_TAG_member
     554                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     555                      .dwattr $C$DW$39, DW_AT_name("GPIOA3")
     556                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_GPIOA3")
     557                      .dwattr $C$DW$39, DW_AT_bit_offset(0x0c)
     558                      .dwattr $C$DW$39, DW_AT_bit_size(0x01)
     559                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     560                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     561              
     562              $C$DW$40        .dwtag  DW_TAG_member
     563                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     564                      .dwattr $C$DW$40, DW_AT_name("GPIOA4")
     565                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_GPIOA4")
     566                      .dwattr $C$DW$40, DW_AT_bit_offset(0x0b)
     567                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     568                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     569                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     570              
     571              $C$DW$41        .dwtag  DW_TAG_member
     572                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     573                      .dwattr $C$DW$41, DW_AT_name("GPIOA5")
     574                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_GPIOA5")
     575                      .dwattr $C$DW$41, DW_AT_bit_offset(0x0a)
     576                      .dwattr $C$DW$41, DW_AT_bit_size(0x01)
     577                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc1570.asm      PAGE   12

     578                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     579              
     580              $C$DW$42        .dwtag  DW_TAG_member
     581                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     582                      .dwattr $C$DW$42, DW_AT_name("GPIOA6")
     583                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_GPIOA6")
     584                      .dwattr $C$DW$42, DW_AT_bit_offset(0x09)
     585                      .dwattr $C$DW$42, DW_AT_bit_size(0x01)
     586                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     587                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     588              
     589              $C$DW$43        .dwtag  DW_TAG_member
     590                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     591                      .dwattr $C$DW$43, DW_AT_name("GPIOA7")
     592                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_GPIOA7")
     593                      .dwattr $C$DW$43, DW_AT_bit_offset(0x08)
     594                      .dwattr $C$DW$43, DW_AT_bit_size(0x01)
     595                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     596                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     597              
     598              $C$DW$44        .dwtag  DW_TAG_member
     599                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     600                      .dwattr $C$DW$44, DW_AT_name("GPIOA8")
     601                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_GPIOA8")
     602                      .dwattr $C$DW$44, DW_AT_bit_offset(0x07)
     603                      .dwattr $C$DW$44, DW_AT_bit_size(0x01)
     604                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     605                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     606              
     607              $C$DW$45        .dwtag  DW_TAG_member
     608                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     609                      .dwattr $C$DW$45, DW_AT_name("GPIOA9")
     610                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_GPIOA9")
     611                      .dwattr $C$DW$45, DW_AT_bit_offset(0x06)
     612                      .dwattr $C$DW$45, DW_AT_bit_size(0x01)
     613                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     614                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     615              
     616              $C$DW$46        .dwtag  DW_TAG_member
     617                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     618                      .dwattr $C$DW$46, DW_AT_name("GPIOA10")
     619                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_GPIOA10")
     620                      .dwattr $C$DW$46, DW_AT_bit_offset(0x05)
     621                      .dwattr $C$DW$46, DW_AT_bit_size(0x01)
     622                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     623                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     624              
     625              $C$DW$47        .dwtag  DW_TAG_member
     626                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     627                      .dwattr $C$DW$47, DW_AT_name("GPIOA11")
     628                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_GPIOA11")
     629                      .dwattr $C$DW$47, DW_AT_bit_offset(0x04)
     630                      .dwattr $C$DW$47, DW_AT_bit_size(0x01)
     631                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     632                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc1570.asm      PAGE   13

     633              
     634              $C$DW$48        .dwtag  DW_TAG_member
     635                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     636                      .dwattr $C$DW$48, DW_AT_name("GPIOA12")
     637                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_GPIOA12")
     638                      .dwattr $C$DW$48, DW_AT_bit_offset(0x03)
     639                      .dwattr $C$DW$48, DW_AT_bit_size(0x01)
     640                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     641                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     642              
     643              $C$DW$49        .dwtag  DW_TAG_member
     644                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     645                      .dwattr $C$DW$49, DW_AT_name("GPIOA13")
     646                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_GPIOA13")
     647                      .dwattr $C$DW$49, DW_AT_bit_offset(0x02)
     648                      .dwattr $C$DW$49, DW_AT_bit_size(0x01)
     649                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     650                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     651              
     652              $C$DW$50        .dwtag  DW_TAG_member
     653                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     654                      .dwattr $C$DW$50, DW_AT_name("GPIOA14")
     655                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_GPIOA14")
     656                      .dwattr $C$DW$50, DW_AT_bit_offset(0x01)
     657                      .dwattr $C$DW$50, DW_AT_bit_size(0x01)
     658                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     659                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     660              
     661              $C$DW$51        .dwtag  DW_TAG_member
     662                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     663                      .dwattr $C$DW$51, DW_AT_name("GPIOA15")
     664                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_GPIOA15")
     665                      .dwattr $C$DW$51, DW_AT_bit_offset(0x00)
     666                      .dwattr $C$DW$51, DW_AT_bit_size(0x01)
     667                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     668                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     669              
     670                      .dwendtag $C$DW$T$20
     671              
     672              
     673              $C$DW$T$21      .dwtag  DW_TAG_union_type
     674                      .dwattr $C$DW$T$21, DW_AT_name("GPACLEAR_REG")
     675                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     676              $C$DW$52        .dwtag  DW_TAG_member
     677                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     678                      .dwattr $C$DW$52, DW_AT_name("all")
     679                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_all")
     680                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     681                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     682              
     683              $C$DW$53        .dwtag  DW_TAG_member
     684                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$20)
     685                      .dwattr $C$DW$53, DW_AT_name("bit")
     686                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_bit")
     687                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc1570.asm      PAGE   14

     688                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     689              
     690                      .dwendtag $C$DW$T$21
     691              
     692              
     693              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     694                      .dwattr $C$DW$T$22, DW_AT_name("GPADAT_BITS")
     695                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     696              $C$DW$54        .dwtag  DW_TAG_member
     697                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     698                      .dwattr $C$DW$54, DW_AT_name("GPIOA0")
     699                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_GPIOA0")
     700                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0f)
     701                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
     702                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     703                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     704              
     705              $C$DW$55        .dwtag  DW_TAG_member
     706                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     707                      .dwattr $C$DW$55, DW_AT_name("GPIOA1")
     708                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_GPIOA1")
     709                      .dwattr $C$DW$55, DW_AT_bit_offset(0x0e)
     710                      .dwattr $C$DW$55, DW_AT_bit_size(0x01)
     711                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     712                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     713              
     714              $C$DW$56        .dwtag  DW_TAG_member
     715                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     716                      .dwattr $C$DW$56, DW_AT_name("GPIOA2")
     717                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_GPIOA2")
     718                      .dwattr $C$DW$56, DW_AT_bit_offset(0x0d)
     719                      .dwattr $C$DW$56, DW_AT_bit_size(0x01)
     720                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     721                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     722              
     723              $C$DW$57        .dwtag  DW_TAG_member
     724                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     725                      .dwattr $C$DW$57, DW_AT_name("GPIOA3")
     726                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_GPIOA3")
     727                      .dwattr $C$DW$57, DW_AT_bit_offset(0x0c)
     728                      .dwattr $C$DW$57, DW_AT_bit_size(0x01)
     729                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     730                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     731              
     732              $C$DW$58        .dwtag  DW_TAG_member
     733                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     734                      .dwattr $C$DW$58, DW_AT_name("GPIOA4")
     735                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_GPIOA4")
     736                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0b)
     737                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
     738                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     739                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     740              
     741              $C$DW$59        .dwtag  DW_TAG_member
     742                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc1570.asm      PAGE   15

     743                      .dwattr $C$DW$59, DW_AT_name("GPIOA5")
     744                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_GPIOA5")
     745                      .dwattr $C$DW$59, DW_AT_bit_offset(0x0a)
     746                      .dwattr $C$DW$59, DW_AT_bit_size(0x01)
     747                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     748                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     749              
     750              $C$DW$60        .dwtag  DW_TAG_member
     751                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     752                      .dwattr $C$DW$60, DW_AT_name("GPIOA6")
     753                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_GPIOA6")
     754                      .dwattr $C$DW$60, DW_AT_bit_offset(0x09)
     755                      .dwattr $C$DW$60, DW_AT_bit_size(0x01)
     756                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     757                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     758              
     759              $C$DW$61        .dwtag  DW_TAG_member
     760                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     761                      .dwattr $C$DW$61, DW_AT_name("GPIOA7")
     762                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_GPIOA7")
     763                      .dwattr $C$DW$61, DW_AT_bit_offset(0x08)
     764                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
     765                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     766                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     767              
     768              $C$DW$62        .dwtag  DW_TAG_member
     769                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     770                      .dwattr $C$DW$62, DW_AT_name("GPIOA8")
     771                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_GPIOA8")
     772                      .dwattr $C$DW$62, DW_AT_bit_offset(0x07)
     773                      .dwattr $C$DW$62, DW_AT_bit_size(0x01)
     774                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     775                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     776              
     777              $C$DW$63        .dwtag  DW_TAG_member
     778                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     779                      .dwattr $C$DW$63, DW_AT_name("GPIOA9")
     780                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_GPIOA9")
     781                      .dwattr $C$DW$63, DW_AT_bit_offset(0x06)
     782                      .dwattr $C$DW$63, DW_AT_bit_size(0x01)
     783                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     784                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     785              
     786              $C$DW$64        .dwtag  DW_TAG_member
     787                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     788                      .dwattr $C$DW$64, DW_AT_name("GPIOA10")
     789                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_GPIOA10")
     790                      .dwattr $C$DW$64, DW_AT_bit_offset(0x05)
     791                      .dwattr $C$DW$64, DW_AT_bit_size(0x01)
     792                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     793                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     794              
     795              $C$DW$65        .dwtag  DW_TAG_member
     796                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     797                      .dwattr $C$DW$65, DW_AT_name("GPIOA11")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc1570.asm      PAGE   16

     798                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_GPIOA11")
     799                      .dwattr $C$DW$65, DW_AT_bit_offset(0x04)
     800                      .dwattr $C$DW$65, DW_AT_bit_size(0x01)
     801                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     802                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     803              
     804              $C$DW$66        .dwtag  DW_TAG_member
     805                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     806                      .dwattr $C$DW$66, DW_AT_name("GPIOA12")
     807                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_GPIOA12")
     808                      .dwattr $C$DW$66, DW_AT_bit_offset(0x03)
     809                      .dwattr $C$DW$66, DW_AT_bit_size(0x01)
     810                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     811                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     812              
     813              $C$DW$67        .dwtag  DW_TAG_member
     814                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     815                      .dwattr $C$DW$67, DW_AT_name("GPIOA13")
     816                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_GPIOA13")
     817                      .dwattr $C$DW$67, DW_AT_bit_offset(0x02)
     818                      .dwattr $C$DW$67, DW_AT_bit_size(0x01)
     819                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     820                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     821              
     822              $C$DW$68        .dwtag  DW_TAG_member
     823                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     824                      .dwattr $C$DW$68, DW_AT_name("GPIOA14")
     825                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_GPIOA14")
     826                      .dwattr $C$DW$68, DW_AT_bit_offset(0x01)
     827                      .dwattr $C$DW$68, DW_AT_bit_size(0x01)
     828                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     829                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     830              
     831              $C$DW$69        .dwtag  DW_TAG_member
     832                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     833                      .dwattr $C$DW$69, DW_AT_name("GPIOA15")
     834                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_GPIOA15")
     835                      .dwattr $C$DW$69, DW_AT_bit_offset(0x00)
     836                      .dwattr $C$DW$69, DW_AT_bit_size(0x01)
     837                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     838                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     839              
     840                      .dwendtag $C$DW$T$22
     841              
     842              
     843              $C$DW$T$23      .dwtag  DW_TAG_union_type
     844                      .dwattr $C$DW$T$23, DW_AT_name("GPADAT_REG")
     845                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     846              $C$DW$70        .dwtag  DW_TAG_member
     847                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     848                      .dwattr $C$DW$70, DW_AT_name("all")
     849                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_all")
     850                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     851                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     852              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc1570.asm      PAGE   17

     853              $C$DW$71        .dwtag  DW_TAG_member
     854                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$22)
     855                      .dwattr $C$DW$71, DW_AT_name("bit")
     856                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_bit")
     857                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     858                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     859              
     860                      .dwendtag $C$DW$T$23
     861              
     862              
     863              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     864                      .dwattr $C$DW$T$24, DW_AT_name("GPASET_BITS")
     865                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     866              $C$DW$72        .dwtag  DW_TAG_member
     867                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     868                      .dwattr $C$DW$72, DW_AT_name("GPIOA0")
     869                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_GPIOA0")
     870                      .dwattr $C$DW$72, DW_AT_bit_offset(0x0f)
     871                      .dwattr $C$DW$72, DW_AT_bit_size(0x01)
     872                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     873                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     874              
     875              $C$DW$73        .dwtag  DW_TAG_member
     876                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     877                      .dwattr $C$DW$73, DW_AT_name("GPIOA1")
     878                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_GPIOA1")
     879                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0e)
     880                      .dwattr $C$DW$73, DW_AT_bit_size(0x01)
     881                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     882                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     883              
     884              $C$DW$74        .dwtag  DW_TAG_member
     885                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     886                      .dwattr $C$DW$74, DW_AT_name("GPIOA2")
     887                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_GPIOA2")
     888                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0d)
     889                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
     890                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     891                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     892              
     893              $C$DW$75        .dwtag  DW_TAG_member
     894                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     895                      .dwattr $C$DW$75, DW_AT_name("GPIOA3")
     896                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_GPIOA3")
     897                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0c)
     898                      .dwattr $C$DW$75, DW_AT_bit_size(0x01)
     899                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     900                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     901              
     902              $C$DW$76        .dwtag  DW_TAG_member
     903                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     904                      .dwattr $C$DW$76, DW_AT_name("GPIOA4")
     905                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_GPIOA4")
     906                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0b)
     907                      .dwattr $C$DW$76, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc1570.asm      PAGE   18

     908                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     909                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     910              
     911              $C$DW$77        .dwtag  DW_TAG_member
     912                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     913                      .dwattr $C$DW$77, DW_AT_name("GPIOA5")
     914                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_GPIOA5")
     915                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0a)
     916                      .dwattr $C$DW$77, DW_AT_bit_size(0x01)
     917                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     918                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     919              
     920              $C$DW$78        .dwtag  DW_TAG_member
     921                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     922                      .dwattr $C$DW$78, DW_AT_name("GPIOA6")
     923                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_GPIOA6")
     924                      .dwattr $C$DW$78, DW_AT_bit_offset(0x09)
     925                      .dwattr $C$DW$78, DW_AT_bit_size(0x01)
     926                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     927                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     928              
     929              $C$DW$79        .dwtag  DW_TAG_member
     930                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     931                      .dwattr $C$DW$79, DW_AT_name("GPIOA7")
     932                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_GPIOA7")
     933                      .dwattr $C$DW$79, DW_AT_bit_offset(0x08)
     934                      .dwattr $C$DW$79, DW_AT_bit_size(0x01)
     935                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     936                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     937              
     938              $C$DW$80        .dwtag  DW_TAG_member
     939                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     940                      .dwattr $C$DW$80, DW_AT_name("GPIOA8")
     941                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_GPIOA8")
     942                      .dwattr $C$DW$80, DW_AT_bit_offset(0x07)
     943                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
     944                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     945                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     946              
     947              $C$DW$81        .dwtag  DW_TAG_member
     948                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     949                      .dwattr $C$DW$81, DW_AT_name("GPIOA9")
     950                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_GPIOA9")
     951                      .dwattr $C$DW$81, DW_AT_bit_offset(0x06)
     952                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
     953                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     954                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     955              
     956              $C$DW$82        .dwtag  DW_TAG_member
     957                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     958                      .dwattr $C$DW$82, DW_AT_name("GPIOA10")
     959                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_GPIOA10")
     960                      .dwattr $C$DW$82, DW_AT_bit_offset(0x05)
     961                      .dwattr $C$DW$82, DW_AT_bit_size(0x01)
     962                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc1570.asm      PAGE   19

     963                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     964              
     965              $C$DW$83        .dwtag  DW_TAG_member
     966                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     967                      .dwattr $C$DW$83, DW_AT_name("GPIOA11")
     968                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_GPIOA11")
     969                      .dwattr $C$DW$83, DW_AT_bit_offset(0x04)
     970                      .dwattr $C$DW$83, DW_AT_bit_size(0x01)
     971                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     972                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     973              
     974              $C$DW$84        .dwtag  DW_TAG_member
     975                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     976                      .dwattr $C$DW$84, DW_AT_name("GPIOA12")
     977                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_GPIOA12")
     978                      .dwattr $C$DW$84, DW_AT_bit_offset(0x03)
     979                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
     980                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     981                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     982              
     983              $C$DW$85        .dwtag  DW_TAG_member
     984                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     985                      .dwattr $C$DW$85, DW_AT_name("GPIOA13")
     986                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_GPIOA13")
     987                      .dwattr $C$DW$85, DW_AT_bit_offset(0x02)
     988                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
     989                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     990                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     991              
     992              $C$DW$86        .dwtag  DW_TAG_member
     993                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     994                      .dwattr $C$DW$86, DW_AT_name("GPIOA14")
     995                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_GPIOA14")
     996                      .dwattr $C$DW$86, DW_AT_bit_offset(0x01)
     997                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
     998                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     999                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1000              
    1001              $C$DW$87        .dwtag  DW_TAG_member
    1002                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1003                      .dwattr $C$DW$87, DW_AT_name("GPIOA15")
    1004                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_GPIOA15")
    1005                      .dwattr $C$DW$87, DW_AT_bit_offset(0x00)
    1006                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
    1007                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1008                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1009              
    1010                      .dwendtag $C$DW$T$24
    1011              
    1012              
    1013              $C$DW$T$25      .dwtag  DW_TAG_union_type
    1014                      .dwattr $C$DW$T$25, DW_AT_name("GPASET_REG")
    1015                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1016              $C$DW$88        .dwtag  DW_TAG_member
    1017                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc1570.asm      PAGE   20

    1018                      .dwattr $C$DW$88, DW_AT_name("all")
    1019                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_all")
    1020                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1021                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1022              
    1023              $C$DW$89        .dwtag  DW_TAG_member
    1024                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$24)
    1025                      .dwattr $C$DW$89, DW_AT_name("bit")
    1026                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_bit")
    1027                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1028                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1029              
    1030                      .dwendtag $C$DW$T$25
    1031              
    1032              
    1033              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1034                      .dwattr $C$DW$T$26, DW_AT_name("GPATOGGLE_BITS")
    1035                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1036              $C$DW$90        .dwtag  DW_TAG_member
    1037                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1038                      .dwattr $C$DW$90, DW_AT_name("GPIOA0")
    1039                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPIOA0")
    1040                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0f)
    1041                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1042                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1043                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1044              
    1045              $C$DW$91        .dwtag  DW_TAG_member
    1046                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1047                      .dwattr $C$DW$91, DW_AT_name("GPIOA1")
    1048                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_GPIOA1")
    1049                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0e)
    1050                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1051                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1052                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1053              
    1054              $C$DW$92        .dwtag  DW_TAG_member
    1055                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1056                      .dwattr $C$DW$92, DW_AT_name("GPIOA2")
    1057                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_GPIOA2")
    1058                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0d)
    1059                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1060                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1061                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1062              
    1063              $C$DW$93        .dwtag  DW_TAG_member
    1064                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1065                      .dwattr $C$DW$93, DW_AT_name("GPIOA3")
    1066                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_GPIOA3")
    1067                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0c)
    1068                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1069                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1070                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1071              
    1072              $C$DW$94        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc1570.asm      PAGE   21

    1073                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1074                      .dwattr $C$DW$94, DW_AT_name("GPIOA4")
    1075                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPIOA4")
    1076                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0b)
    1077                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1078                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1079                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1080              
    1081              $C$DW$95        .dwtag  DW_TAG_member
    1082                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1083                      .dwattr $C$DW$95, DW_AT_name("GPIOA5")
    1084                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_GPIOA5")
    1085                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0a)
    1086                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1087                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1088                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1089              
    1090              $C$DW$96        .dwtag  DW_TAG_member
    1091                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1092                      .dwattr $C$DW$96, DW_AT_name("GPIOA6")
    1093                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_GPIOA6")
    1094                      .dwattr $C$DW$96, DW_AT_bit_offset(0x09)
    1095                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1096                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1097                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1098              
    1099              $C$DW$97        .dwtag  DW_TAG_member
    1100                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1101                      .dwattr $C$DW$97, DW_AT_name("GPIOA7")
    1102                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_GPIOA7")
    1103                      .dwattr $C$DW$97, DW_AT_bit_offset(0x08)
    1104                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1105                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1106                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1107              
    1108              $C$DW$98        .dwtag  DW_TAG_member
    1109                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1110                      .dwattr $C$DW$98, DW_AT_name("GPIOA8")
    1111                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_GPIOA8")
    1112                      .dwattr $C$DW$98, DW_AT_bit_offset(0x07)
    1113                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1114                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1115                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1116              
    1117              $C$DW$99        .dwtag  DW_TAG_member
    1118                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1119                      .dwattr $C$DW$99, DW_AT_name("GPIOA9")
    1120                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_GPIOA9")
    1121                      .dwattr $C$DW$99, DW_AT_bit_offset(0x06)
    1122                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1123                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1124                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1125              
    1126              $C$DW$100       .dwtag  DW_TAG_member
    1127                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc1570.asm      PAGE   22

    1128                      .dwattr $C$DW$100, DW_AT_name("GPIOA10")
    1129                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_GPIOA10")
    1130                      .dwattr $C$DW$100, DW_AT_bit_offset(0x05)
    1131                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1132                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1133                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1134              
    1135              $C$DW$101       .dwtag  DW_TAG_member
    1136                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1137                      .dwattr $C$DW$101, DW_AT_name("GPIOA11")
    1138                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_GPIOA11")
    1139                      .dwattr $C$DW$101, DW_AT_bit_offset(0x04)
    1140                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1141                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1142                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1143              
    1144              $C$DW$102       .dwtag  DW_TAG_member
    1145                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1146                      .dwattr $C$DW$102, DW_AT_name("GPIOA12")
    1147                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_GPIOA12")
    1148                      .dwattr $C$DW$102, DW_AT_bit_offset(0x03)
    1149                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1150                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1151                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1152              
    1153              $C$DW$103       .dwtag  DW_TAG_member
    1154                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1155                      .dwattr $C$DW$103, DW_AT_name("GPIOA13")
    1156                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_GPIOA13")
    1157                      .dwattr $C$DW$103, DW_AT_bit_offset(0x02)
    1158                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1159                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1160                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1161              
    1162              $C$DW$104       .dwtag  DW_TAG_member
    1163                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1164                      .dwattr $C$DW$104, DW_AT_name("GPIOA14")
    1165                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_GPIOA14")
    1166                      .dwattr $C$DW$104, DW_AT_bit_offset(0x01)
    1167                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1168                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1169                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1170              
    1171              $C$DW$105       .dwtag  DW_TAG_member
    1172                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1173                      .dwattr $C$DW$105, DW_AT_name("GPIOA15")
    1174                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_GPIOA15")
    1175                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00)
    1176                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1177                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1178                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1179              
    1180                      .dwendtag $C$DW$T$26
    1181              
    1182              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc1570.asm      PAGE   23

    1183              $C$DW$T$27      .dwtag  DW_TAG_union_type
    1184                      .dwattr $C$DW$T$27, DW_AT_name("GPATOGGLE_REG")
    1185                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1186              $C$DW$106       .dwtag  DW_TAG_member
    1187                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1188                      .dwattr $C$DW$106, DW_AT_name("all")
    1189                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_all")
    1190                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1191                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1192              
    1193              $C$DW$107       .dwtag  DW_TAG_member
    1194                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$26)
    1195                      .dwattr $C$DW$107, DW_AT_name("bit")
    1196                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_bit")
    1197                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1198                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1199              
    1200                      .dwendtag $C$DW$T$27
    1201              
    1202              
    1203              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1204                      .dwattr $C$DW$T$28, DW_AT_name("GPBCLEAR_BITS")
    1205                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    1206              $C$DW$108       .dwtag  DW_TAG_member
    1207                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1208                      .dwattr $C$DW$108, DW_AT_name("GPIOB0")
    1209                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIOB0")
    1210                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0f)
    1211                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1212                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1213                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1214              
    1215              $C$DW$109       .dwtag  DW_TAG_member
    1216                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1217                      .dwattr $C$DW$109, DW_AT_name("GPIOB1")
    1218                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIOB1")
    1219                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0e)
    1220                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1221                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1222                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1223              
    1224              $C$DW$110       .dwtag  DW_TAG_member
    1225                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1226                      .dwattr $C$DW$110, DW_AT_name("GPIOB2")
    1227                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIOB2")
    1228                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0d)
    1229                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1230                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1231                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1232              
    1233              $C$DW$111       .dwtag  DW_TAG_member
    1234                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1235                      .dwattr $C$DW$111, DW_AT_name("GPIOB3")
    1236                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIOB3")
    1237                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0c)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc1570.asm      PAGE   24

    1238                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1239                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1240                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1241              
    1242              $C$DW$112       .dwtag  DW_TAG_member
    1243                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1244                      .dwattr $C$DW$112, DW_AT_name("GPIOB4")
    1245                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GPIOB4")
    1246                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0b)
    1247                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1248                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1249                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1250              
    1251              $C$DW$113       .dwtag  DW_TAG_member
    1252                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1253                      .dwattr $C$DW$113, DW_AT_name("GPIOB5")
    1254                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPIOB5")
    1255                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0a)
    1256                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1257                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1258                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1259              
    1260              $C$DW$114       .dwtag  DW_TAG_member
    1261                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1262                      .dwattr $C$DW$114, DW_AT_name("GPIOB6")
    1263                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIOB6")
    1264                      .dwattr $C$DW$114, DW_AT_bit_offset(0x09)
    1265                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1266                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1267                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1268              
    1269              $C$DW$115       .dwtag  DW_TAG_member
    1270                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1271                      .dwattr $C$DW$115, DW_AT_name("GPIOB7")
    1272                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_GPIOB7")
    1273                      .dwattr $C$DW$115, DW_AT_bit_offset(0x08)
    1274                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1275                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1276                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1277              
    1278              $C$DW$116       .dwtag  DW_TAG_member
    1279                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1280                      .dwattr $C$DW$116, DW_AT_name("GPIOB8")
    1281                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_GPIOB8")
    1282                      .dwattr $C$DW$116, DW_AT_bit_offset(0x07)
    1283                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1284                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1285                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1286              
    1287              $C$DW$117       .dwtag  DW_TAG_member
    1288                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1289                      .dwattr $C$DW$117, DW_AT_name("GPIOB9")
    1290                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_GPIOB9")
    1291                      .dwattr $C$DW$117, DW_AT_bit_offset(0x06)
    1292                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc1570.asm      PAGE   25

    1293                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1294                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1295              
    1296              $C$DW$118       .dwtag  DW_TAG_member
    1297                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1298                      .dwattr $C$DW$118, DW_AT_name("GPIOB10")
    1299                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPIOB10")
    1300                      .dwattr $C$DW$118, DW_AT_bit_offset(0x05)
    1301                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1302                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1303                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1304              
    1305              $C$DW$119       .dwtag  DW_TAG_member
    1306                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1307                      .dwattr $C$DW$119, DW_AT_name("GPIOB11")
    1308                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_GPIOB11")
    1309                      .dwattr $C$DW$119, DW_AT_bit_offset(0x04)
    1310                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1311                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1312                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1313              
    1314              $C$DW$120       .dwtag  DW_TAG_member
    1315                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1316                      .dwattr $C$DW$120, DW_AT_name("GPIOB12")
    1317                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPIOB12")
    1318                      .dwattr $C$DW$120, DW_AT_bit_offset(0x03)
    1319                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1320                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1321                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1322              
    1323              $C$DW$121       .dwtag  DW_TAG_member
    1324                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1325                      .dwattr $C$DW$121, DW_AT_name("GPIOB13")
    1326                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_GPIOB13")
    1327                      .dwattr $C$DW$121, DW_AT_bit_offset(0x02)
    1328                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1329                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1330                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1331              
    1332              $C$DW$122       .dwtag  DW_TAG_member
    1333                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1334                      .dwattr $C$DW$122, DW_AT_name("GPIOB14")
    1335                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_GPIOB14")
    1336                      .dwattr $C$DW$122, DW_AT_bit_offset(0x01)
    1337                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1338                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1339                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1340              
    1341              $C$DW$123       .dwtag  DW_TAG_member
    1342                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1343                      .dwattr $C$DW$123, DW_AT_name("GPIOB15")
    1344                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPIOB15")
    1345                      .dwattr $C$DW$123, DW_AT_bit_offset(0x00)
    1346                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1347                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc1570.asm      PAGE   26

    1348                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1349              
    1350                      .dwendtag $C$DW$T$28
    1351              
    1352              
    1353              $C$DW$T$29      .dwtag  DW_TAG_union_type
    1354                      .dwattr $C$DW$T$29, DW_AT_name("GPBCLEAR_REG")
    1355                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1356              $C$DW$124       .dwtag  DW_TAG_member
    1357                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1358                      .dwattr $C$DW$124, DW_AT_name("all")
    1359                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_all")
    1360                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1361                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1362              
    1363              $C$DW$125       .dwtag  DW_TAG_member
    1364                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$28)
    1365                      .dwattr $C$DW$125, DW_AT_name("bit")
    1366                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_bit")
    1367                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1368                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1369              
    1370                      .dwendtag $C$DW$T$29
    1371              
    1372              
    1373              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1374                      .dwattr $C$DW$T$30, DW_AT_name("GPBDAT_BITS")
    1375                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    1376              $C$DW$126       .dwtag  DW_TAG_member
    1377                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1378                      .dwattr $C$DW$126, DW_AT_name("GPIOB0")
    1379                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_GPIOB0")
    1380                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0f)
    1381                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1382                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1383                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1384              
    1385              $C$DW$127       .dwtag  DW_TAG_member
    1386                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1387                      .dwattr $C$DW$127, DW_AT_name("GPIOB1")
    1388                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIOB1")
    1389                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0e)
    1390                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1391                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1392                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1393              
    1394              $C$DW$128       .dwtag  DW_TAG_member
    1395                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1396                      .dwattr $C$DW$128, DW_AT_name("GPIOB2")
    1397                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIOB2")
    1398                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0d)
    1399                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1400                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1401                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1402              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc1570.asm      PAGE   27

    1403              $C$DW$129       .dwtag  DW_TAG_member
    1404                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1405                      .dwattr $C$DW$129, DW_AT_name("GPIOB3")
    1406                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPIOB3")
    1407                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0c)
    1408                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1409                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1410                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1411              
    1412              $C$DW$130       .dwtag  DW_TAG_member
    1413                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1414                      .dwattr $C$DW$130, DW_AT_name("GPIOB4")
    1415                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPIOB4")
    1416                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0b)
    1417                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1418                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1419                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1420              
    1421              $C$DW$131       .dwtag  DW_TAG_member
    1422                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1423                      .dwattr $C$DW$131, DW_AT_name("GPIOB5")
    1424                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIOB5")
    1425                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0a)
    1426                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1427                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1428                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1429              
    1430              $C$DW$132       .dwtag  DW_TAG_member
    1431                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1432                      .dwattr $C$DW$132, DW_AT_name("GPIOB6")
    1433                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIOB6")
    1434                      .dwattr $C$DW$132, DW_AT_bit_offset(0x09)
    1435                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1436                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1437                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1438              
    1439              $C$DW$133       .dwtag  DW_TAG_member
    1440                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1441                      .dwattr $C$DW$133, DW_AT_name("GPIOB7")
    1442                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIOB7")
    1443                      .dwattr $C$DW$133, DW_AT_bit_offset(0x08)
    1444                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1445                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1446                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1447              
    1448              $C$DW$134       .dwtag  DW_TAG_member
    1449                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1450                      .dwattr $C$DW$134, DW_AT_name("GPIOB8")
    1451                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIOB8")
    1452                      .dwattr $C$DW$134, DW_AT_bit_offset(0x07)
    1453                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1454                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1455                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1456              
    1457              $C$DW$135       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc1570.asm      PAGE   28

    1458                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1459                      .dwattr $C$DW$135, DW_AT_name("GPIOB9")
    1460                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIOB9")
    1461                      .dwattr $C$DW$135, DW_AT_bit_offset(0x06)
    1462                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1463                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1464                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1465              
    1466              $C$DW$136       .dwtag  DW_TAG_member
    1467                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1468                      .dwattr $C$DW$136, DW_AT_name("GPIOB10")
    1469                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIOB10")
    1470                      .dwattr $C$DW$136, DW_AT_bit_offset(0x05)
    1471                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1472                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1473                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1474              
    1475              $C$DW$137       .dwtag  DW_TAG_member
    1476                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1477                      .dwattr $C$DW$137, DW_AT_name("GPIOB11")
    1478                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIOB11")
    1479                      .dwattr $C$DW$137, DW_AT_bit_offset(0x04)
    1480                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1481                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1482                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1483              
    1484              $C$DW$138       .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1486                      .dwattr $C$DW$138, DW_AT_name("GPIOB12")
    1487                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIOB12")
    1488                      .dwattr $C$DW$138, DW_AT_bit_offset(0x03)
    1489                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    1490                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1491                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1492              
    1493              $C$DW$139       .dwtag  DW_TAG_member
    1494                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1495                      .dwattr $C$DW$139, DW_AT_name("GPIOB13")
    1496                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIOB13")
    1497                      .dwattr $C$DW$139, DW_AT_bit_offset(0x02)
    1498                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1499                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1500                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1501              
    1502              $C$DW$140       .dwtag  DW_TAG_member
    1503                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1504                      .dwattr $C$DW$140, DW_AT_name("GPIOB14")
    1505                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPIOB14")
    1506                      .dwattr $C$DW$140, DW_AT_bit_offset(0x01)
    1507                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    1508                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1509                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1510              
    1511              $C$DW$141       .dwtag  DW_TAG_member
    1512                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc1570.asm      PAGE   29

    1513                      .dwattr $C$DW$141, DW_AT_name("GPIOB15")
    1514                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPIOB15")
    1515                      .dwattr $C$DW$141, DW_AT_bit_offset(0x00)
    1516                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    1517                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1518                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1519              
    1520                      .dwendtag $C$DW$T$30
    1521              
    1522              
    1523              $C$DW$T$31      .dwtag  DW_TAG_union_type
    1524                      .dwattr $C$DW$T$31, DW_AT_name("GPBDAT_REG")
    1525                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1526              $C$DW$142       .dwtag  DW_TAG_member
    1527                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1528                      .dwattr $C$DW$142, DW_AT_name("all")
    1529                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_all")
    1530                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1531                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1532              
    1533              $C$DW$143       .dwtag  DW_TAG_member
    1534                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$30)
    1535                      .dwattr $C$DW$143, DW_AT_name("bit")
    1536                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_bit")
    1537                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1538                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1539              
    1540                      .dwendtag $C$DW$T$31
    1541              
    1542              
    1543              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1544                      .dwattr $C$DW$T$32, DW_AT_name("GPBSET_BITS")
    1545                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1546              $C$DW$144       .dwtag  DW_TAG_member
    1547                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1548                      .dwattr $C$DW$144, DW_AT_name("GPIOB0")
    1549                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIOB0")
    1550                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0f)
    1551                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    1552                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1553                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1554              
    1555              $C$DW$145       .dwtag  DW_TAG_member
    1556                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1557                      .dwattr $C$DW$145, DW_AT_name("GPIOB1")
    1558                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIOB1")
    1559                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0e)
    1560                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    1561                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1562                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1563              
    1564              $C$DW$146       .dwtag  DW_TAG_member
    1565                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1566                      .dwattr $C$DW$146, DW_AT_name("GPIOB2")
    1567                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_GPIOB2")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc1570.asm      PAGE   30

    1568                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0d)
    1569                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    1570                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1571                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1572              
    1573              $C$DW$147       .dwtag  DW_TAG_member
    1574                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1575                      .dwattr $C$DW$147, DW_AT_name("GPIOB3")
    1576                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_GPIOB3")
    1577                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0c)
    1578                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    1579                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1580                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1581              
    1582              $C$DW$148       .dwtag  DW_TAG_member
    1583                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1584                      .dwattr $C$DW$148, DW_AT_name("GPIOB4")
    1585                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPIOB4")
    1586                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0b)
    1587                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    1588                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1589                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1590              
    1591              $C$DW$149       .dwtag  DW_TAG_member
    1592                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1593                      .dwattr $C$DW$149, DW_AT_name("GPIOB5")
    1594                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_GPIOB5")
    1595                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0a)
    1596                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    1597                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1598                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1599              
    1600              $C$DW$150       .dwtag  DW_TAG_member
    1601                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1602                      .dwattr $C$DW$150, DW_AT_name("GPIOB6")
    1603                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPIOB6")
    1604                      .dwattr $C$DW$150, DW_AT_bit_offset(0x09)
    1605                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    1606                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1607                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1608              
    1609              $C$DW$151       .dwtag  DW_TAG_member
    1610                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1611                      .dwattr $C$DW$151, DW_AT_name("GPIOB7")
    1612                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_GPIOB7")
    1613                      .dwattr $C$DW$151, DW_AT_bit_offset(0x08)
    1614                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    1615                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1616                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1617              
    1618              $C$DW$152       .dwtag  DW_TAG_member
    1619                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1620                      .dwattr $C$DW$152, DW_AT_name("GPIOB8")
    1621                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_GPIOB8")
    1622                      .dwattr $C$DW$152, DW_AT_bit_offset(0x07)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc1570.asm      PAGE   31

    1623                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    1624                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1625                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1626              
    1627              $C$DW$153       .dwtag  DW_TAG_member
    1628                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1629                      .dwattr $C$DW$153, DW_AT_name("GPIOB9")
    1630                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_GPIOB9")
    1631                      .dwattr $C$DW$153, DW_AT_bit_offset(0x06)
    1632                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    1633                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1634                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1635              
    1636              $C$DW$154       .dwtag  DW_TAG_member
    1637                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1638                      .dwattr $C$DW$154, DW_AT_name("GPIOB10")
    1639                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_GPIOB10")
    1640                      .dwattr $C$DW$154, DW_AT_bit_offset(0x05)
    1641                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    1642                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1643                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1644              
    1645              $C$DW$155       .dwtag  DW_TAG_member
    1646                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1647                      .dwattr $C$DW$155, DW_AT_name("GPIOB11")
    1648                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_GPIOB11")
    1649                      .dwattr $C$DW$155, DW_AT_bit_offset(0x04)
    1650                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    1651                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1652                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1653              
    1654              $C$DW$156       .dwtag  DW_TAG_member
    1655                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1656                      .dwattr $C$DW$156, DW_AT_name("GPIOB12")
    1657                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_GPIOB12")
    1658                      .dwattr $C$DW$156, DW_AT_bit_offset(0x03)
    1659                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    1660                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1661                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1662              
    1663              $C$DW$157       .dwtag  DW_TAG_member
    1664                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1665                      .dwattr $C$DW$157, DW_AT_name("GPIOB13")
    1666                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_GPIOB13")
    1667                      .dwattr $C$DW$157, DW_AT_bit_offset(0x02)
    1668                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    1669                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1670                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1671              
    1672              $C$DW$158       .dwtag  DW_TAG_member
    1673                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1674                      .dwattr $C$DW$158, DW_AT_name("GPIOB14")
    1675                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_GPIOB14")
    1676                      .dwattr $C$DW$158, DW_AT_bit_offset(0x01)
    1677                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc1570.asm      PAGE   32

    1678                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1679                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1680              
    1681              $C$DW$159       .dwtag  DW_TAG_member
    1682                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1683                      .dwattr $C$DW$159, DW_AT_name("GPIOB15")
    1684                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_GPIOB15")
    1685                      .dwattr $C$DW$159, DW_AT_bit_offset(0x00)
    1686                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    1687                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1688                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1689              
    1690                      .dwendtag $C$DW$T$32
    1691              
    1692              
    1693              $C$DW$T$33      .dwtag  DW_TAG_union_type
    1694                      .dwattr $C$DW$T$33, DW_AT_name("GPBSET_REG")
    1695                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1696              $C$DW$160       .dwtag  DW_TAG_member
    1697                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1698                      .dwattr $C$DW$160, DW_AT_name("all")
    1699                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_all")
    1700                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1701                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1702              
    1703              $C$DW$161       .dwtag  DW_TAG_member
    1704                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$32)
    1705                      .dwattr $C$DW$161, DW_AT_name("bit")
    1706                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_bit")
    1707                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1708                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1709              
    1710                      .dwendtag $C$DW$T$33
    1711              
    1712              
    1713              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1714                      .dwattr $C$DW$T$34, DW_AT_name("GPBTOGGLE_BITS")
    1715                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1716              $C$DW$162       .dwtag  DW_TAG_member
    1717                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1718                      .dwattr $C$DW$162, DW_AT_name("GPIOB0")
    1719                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_GPIOB0")
    1720                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0f)
    1721                      .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    1722                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1723                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1724              
    1725              $C$DW$163       .dwtag  DW_TAG_member
    1726                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1727                      .dwattr $C$DW$163, DW_AT_name("GPIOB1")
    1728                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_GPIOB1")
    1729                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0e)
    1730                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    1731                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1732                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc1570.asm      PAGE   33

    1733              
    1734              $C$DW$164       .dwtag  DW_TAG_member
    1735                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1736                      .dwattr $C$DW$164, DW_AT_name("GPIOB2")
    1737                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_GPIOB2")
    1738                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0d)
    1739                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    1740                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1741                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1742              
    1743              $C$DW$165       .dwtag  DW_TAG_member
    1744                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1745                      .dwattr $C$DW$165, DW_AT_name("GPIOB3")
    1746                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_GPIOB3")
    1747                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0c)
    1748                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    1749                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1750                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1751              
    1752              $C$DW$166       .dwtag  DW_TAG_member
    1753                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1754                      .dwattr $C$DW$166, DW_AT_name("GPIOB4")
    1755                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_GPIOB4")
    1756                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0b)
    1757                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    1758                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1759                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1760              
    1761              $C$DW$167       .dwtag  DW_TAG_member
    1762                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1763                      .dwattr $C$DW$167, DW_AT_name("GPIOB5")
    1764                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_GPIOB5")
    1765                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0a)
    1766                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    1767                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1768                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1769              
    1770              $C$DW$168       .dwtag  DW_TAG_member
    1771                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1772                      .dwattr $C$DW$168, DW_AT_name("GPIOB6")
    1773                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_GPIOB6")
    1774                      .dwattr $C$DW$168, DW_AT_bit_offset(0x09)
    1775                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    1776                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1777                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1778              
    1779              $C$DW$169       .dwtag  DW_TAG_member
    1780                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1781                      .dwattr $C$DW$169, DW_AT_name("GPIOB7")
    1782                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_GPIOB7")
    1783                      .dwattr $C$DW$169, DW_AT_bit_offset(0x08)
    1784                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    1785                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1786                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1787              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Adc1570.asm      PAGE   34

    1788              $C$DW$170       .dwtag  DW_TAG_member
    1789                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1790                      .dwattr $C$DW$170, DW_AT_name("GPIOB8")
    1791                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_GPIOB8")
    1792                      .dwattr $C$DW$170, DW_AT_bit_offset(0x07)
    1793                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    1794                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1795                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1796              
    1797              $C$DW$171       .dwtag  DW_TAG_member
    1798                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1799                      .dwattr $C$DW$171, DW_AT_name("GPIOB9")
    1800                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_GPIOB9")
    1801                      .dwattr $C$DW$171, DW_AT_bit_offset(0x06)
    1802                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    1803                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1804                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1805              
    1806              $C$DW$172       .dwtag  DW_TAG_member
    1807                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1808                      .dwattr $C$DW$172, DW_AT_name("GPIOB10")
