TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:10:57 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/AuxEeprom.asm PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.0 *
       3              ;* Date/Time created: Tue Sep 16 13:10:56 2008                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("AuxEeprom.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.0 Copyright (c) 1996-2005 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("TxSpi"), DW_AT_symbol_name("_TxSpi")
      15                      .dwattr DW$1, DW_AT_declaration(0x01)
      16                      .dwattr DW$1, DW_AT_external(0x01)
      17              DW$2    .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)

    1692                      .dwattr DW$86, DW_AT_low_pc(DW$L$_AuxEepromTest$2$B)
    1693                      .dwattr DW$86, DW_AT_high_pc(DW$L$_AuxEepromTest$2$E)
    1694              DW$87   .dwtag  DW_TAG_loop_range
    1695                      .dwattr DW$87, DW_AT_low_pc(DW$L$_AuxEepromTest$3$B)
    1696                      .dwattr DW$87, DW_AT_high_pc(DW$L$_AuxEepromTest$3$E)
    1697              DW$88   .dwtag  DW_TAG_loop_range
    1698                      .dwattr DW$88, DW_AT_low_pc(DW$L$_AuxEepromTest$4$B)
    1699                      .dwattr DW$88, DW_AT_high_pc(DW$L$_AuxEepromTest$4$E)
    1700                      .dwendtag DW$85
    1701              
    1702                      .dwattr DW$66, DW_AT_end_file("AuxEeprom.c")
    1703                      .dwattr DW$66, DW_AT_end_line(0x142)
    1704                      .dwattr DW$66, DW_AT_end_column(0x01)
    1705                      .dwendentry
    1706                      .dwendtag DW$66
    1707              
    1708              ;***************************************************************
    1709              ;* UNDEFINED EXTERNAL REFERENCES                               *
    1710              ;***************************************************************
    1711                      .global _TxSpi
    1712                      .global _ConfigSpi
    1713                      .global _FormatSpiTxWord
    1714                      .global _RxSpi
    1715                      .global _SpiRxNotReady
    1716                      .global _SpiTxNotReady
    1717                      .global _GpioDataRegs
    1718              
    1719              ;***************************************************************
    1720              ;* TYPE INFORMATION                                            *
    1721              ;***************************************************************
    1722              
    1723              DW$T$70 .dwtag  DW_TAG_subroutine_type
    1724                      .dwattr DW$T$70, DW_AT_language(DW_LANG_C)
    1725              DW$89   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    1726              DW$90   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    1727                      .dwendtag DW$T$70
    1728              
    1729              
    1730              DW$T$72 .dwtag  DW_TAG_subroutine_type
    1731                      .dwattr DW$T$72, DW_AT_language(DW_LANG_C)
    1732              DW$91   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1733                      .dwendtag DW$T$72
    1734              
    1735              
    1736              DW$T$74 .dwtag  DW_TAG_subroutine_type
    1737                      .dwattr DW$T$74, DW_AT_language(DW_LANG_C)
    1738              
    1739              DW$T$75 .dwtag  DW_TAG_subroutine_type
    1740                      .dwattr DW$T$75, DW_AT_language(DW_LANG_C)
    1741              DW$92   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1742              DW$93   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:10:57 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/AuxEeprom.asm PAGE   35

    1743                      .dwendtag DW$T$75
    1744              
    1745              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
    1746                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1747                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
    1748              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$11)
    1749                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
    1750              
    1751              DW$T$77 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
    1752                      .dwattr DW$T$77, DW_AT_language(DW_LANG_C)
    1753              
    1754              DW$T$79 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
    1755                      .dwattr DW$T$79, DW_AT_language(DW_LANG_C)
    1756              DW$94   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1757              DW$95   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1758                      .dwendtag DW$T$79
    1759              
    1760              
    1761              DW$T$81 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
    1762                      .dwattr DW$T$81, DW_AT_language(DW_LANG_C)
    1763              DW$96   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1764                      .dwendtag DW$T$81
    1765              
    1766              DW$T$84 .dwtag  DW_TAG_typedef, DW_AT_name("Uint32"), DW_AT_type(*DW$T$13)
    1767                      .dwattr DW$T$84, DW_AT_language(DW_LANG_C)
    1768              DW$97   .dwtag  DW_TAG_far_type
    1769                      .dwattr DW$97, DW_AT_type(*DW$T$69)
    1770              DW$T$89 .dwtag  DW_TAG_volatile_type
    1771                      .dwattr DW$T$89, DW_AT_type(*DW$97)
    1772              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    1773                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1774                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    1775              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    1776                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1777                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    1778              
    1779              DW$T$69 .dwtag  DW_TAG_structure_type
    1780                      .dwattr DW$T$69, DW_AT_name("GPIO_DATA_REGS")
    1781                      .dwattr DW$T$69, DW_AT_byte_size(0x20)
    1782              DW$98   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    1783                      .dwattr DW$98, DW_AT_name("GPADAT"), DW_AT_symbol_name("_GPADAT")
    1784                      .dwattr DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1785                      .dwattr DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1786              DW$99   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1787                      .dwattr DW$99, DW_AT_name("GPASET"), DW_AT_symbol_name("_GPASET")
    1788                      .dwattr DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1789                      .dwattr DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1790              DW$100  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    1791                      .dwattr DW$100, DW_AT_name("GPACLEAR"), DW_AT_symbol_name("_GPACLEAR")
    1792                      .dwattr DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1793                      .dwattr DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1794              DW$101  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    1795                      .dwattr DW$101, DW_AT_name("GPATOGGLE"), DW_AT_symbol_name("_GPATOGGLE")
    1796                      .dwattr DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1797                      .dwattr DW$101, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:10:57 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/AuxEeprom.asm PAGE   36

    1798              DW$102  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    1799                      .dwattr DW$102, DW_AT_name("GPBDAT"), DW_AT_symbol_name("_GPBDAT")
    1800                      .dwattr DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1801                      .dwattr DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1802              DW$103  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    1803                      .dwattr DW$103, DW_AT_name("GPBSET"), DW_AT_symbol_name("_GPBSET")
    1804                      .dwattr DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1805                      .dwattr DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1806              DW$104  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    1807                      .dwattr DW$104, DW_AT_name("GPBCLEAR"), DW_AT_symbol_name("_GPBCLEAR")
    1808                      .dwattr DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1809                      .dwattr DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1810              DW$105  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    1811                      .dwattr DW$105, DW_AT_name("GPBTOGGLE"), DW_AT_symbol_name("_GPBTOGGLE")
    1812                      .dwattr DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1813                      .dwattr DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1814              DW$106  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    1815                      .dwattr DW$106, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    1816                      .dwattr DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1817                      .dwattr DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1818              DW$107  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    1819                      .dwattr DW$107, DW_AT_name("GPDDAT"), DW_AT_symbol_name("_GPDDAT")
    1820                      .dwattr DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1821                      .dwattr DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1822              DW$108  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    1823                      .dwattr DW$108, DW_AT_name("GPDSET"), DW_AT_symbol_name("_GPDSET")
    1824                      .dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1825                      .dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1826              DW$109  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    1827                      .dwattr DW$109, DW_AT_name("GPDCLEAR"), DW_AT_symbol_name("_GPDCLEAR")
    1828                      .dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1829                      .dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1830              DW$110  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
    1831                      .dwattr DW$110, DW_AT_name("GPDTOGGLE"), DW_AT_symbol_name("_GPDTOGGLE")
    1832                      .dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1833                      .dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1834              DW$111  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
    1835                      .dwattr DW$111, DW_AT_name("GPEDAT"), DW_AT_symbol_name("_GPEDAT")
    1836                      .dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1837                      .dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1838              DW$112  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    1839                      .dwattr DW$112, DW_AT_name("GPESET"), DW_AT_symbol_name("_GPESET")
    1840                      .dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1841                      .dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1842              DW$113  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    1843                      .dwattr DW$113, DW_AT_name("GPECLEAR"), DW_AT_symbol_name("_GPECLEAR")
    1844                      .dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1845                      .dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1846              DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
    1847                      .dwattr DW$114, DW_AT_name("GPETOGGLE"), DW_AT_symbol_name("_GPETOGGLE")
    1848                      .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1849                      .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1850              DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$53)
    1851                      .dwattr DW$115, DW_AT_name("GPFDAT"), DW_AT_symbol_name("_GPFDAT")
    1852                      .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:10:57 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/AuxEeprom.asm PAGE   37

    1853                      .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1854              DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
    1855                      .dwattr DW$116, DW_AT_name("GPFSET"), DW_AT_symbol_name("_GPFSET")
    1856                      .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1857                      .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1858              DW$117  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
    1859                      .dwattr DW$117, DW_AT_name("GPFCLEAR"), DW_AT_symbol_name("_GPFCLEAR")
    1860                      .dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1861                      .dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1862              DW$118  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
    1863                      .dwattr DW$118, DW_AT_name("GPFTOGGLE"), DW_AT_symbol_name("_GPFTOGGLE")
    1864                      .dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1865                      .dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1866              DW$119  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
    1867                      .dwattr DW$119, DW_AT_name("GPGDAT"), DW_AT_symbol_name("_GPGDAT")
    1868                      .dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1869                      .dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1870              DW$120  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
    1871                      .dwattr DW$120, DW_AT_name("GPGSET"), DW_AT_symbol_name("_GPGSET")
    1872                      .dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1873                      .dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1874              DW$121  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    1875                      .dwattr DW$121, DW_AT_name("GPGCLEAR"), DW_AT_symbol_name("_GPGCLEAR")
    1876                      .dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1877                      .dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1878              DW$122  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
    1879                      .dwattr DW$122, DW_AT_name("GPGTOGGLE"), DW_AT_symbol_name("_GPGTOGGLE")
    1880                      .dwattr DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1881                      .dwattr DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1882              DW$123  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    1883                      .dwattr DW$123, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    1884                      .dwattr DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1885                      .dwattr DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1886                      .dwendtag DW$T$69
    1887              
    1888              
    1889              DW$T$68 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    1890                      .dwattr DW$T$68, DW_AT_language(DW_LANG_C)
    1891                      .dwattr DW$T$68, DW_AT_byte_size(0x04)
    1892              DW$124  .dwtag  DW_TAG_subrange_type
    1893                      .dwattr DW$124, DW_AT_upper_bound(0x03)
    1894                      .dwendtag DW$T$68
    1895              
    1896              
    1897              DW$T$21 .dwtag  DW_TAG_union_type
    1898                      .dwattr DW$T$21, DW_AT_name("GPADAT_REG")
    1899                      .dwattr DW$T$21, DW_AT_byte_size(0x01)
    1900              DW$125  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1901                      .dwattr DW$125, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1902                      .dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1903                      .dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1904              DW$126  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1905                      .dwattr DW$126, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1906                      .dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1907                      .dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:10:57 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/AuxEeprom.asm PAGE   38

    1908                      .dwendtag DW$T$21
    1909              
    1910              
    1911              DW$T$23 .dwtag  DW_TAG_union_type
    1912                      .dwattr DW$T$23, DW_AT_name("GPASET_REG")
    1913                      .dwattr DW$T$23, DW_AT_byte_size(0x01)
    1914              DW$127  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1915                      .dwattr DW$127, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1916                      .dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1917                      .dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1918              DW$128  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1919                      .dwattr DW$128, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1920                      .dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1921                      .dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1922                      .dwendtag DW$T$23
    1923              
    1924              
    1925              DW$T$25 .dwtag  DW_TAG_union_type
    1926                      .dwattr DW$T$25, DW_AT_name("GPACLEAR_REG")
    1927                      .dwattr DW$T$25, DW_AT_byte_size(0x01)
    1928              DW$129  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1929                      .dwattr DW$129, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1930                      .dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1931                      .dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1932              DW$130  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1933                      .dwattr DW$130, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1934                      .dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1935                      .dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1936                      .dwendtag DW$T$25
    1937              
    1938              
    1939              DW$T$27 .dwtag  DW_TAG_union_type
    1940                      .dwattr DW$T$27, DW_AT_name("GPATOGGLE_REG")
    1941                      .dwattr DW$T$27, DW_AT_byte_size(0x01)
    1942              DW$131  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1943                      .dwattr DW$131, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1944                      .dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1945                      .dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1946              DW$132  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    1947                      .dwattr DW$132, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1948                      .dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1949                      .dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1950                      .dwendtag DW$T$27
    1951              
    1952              
    1953              DW$T$29 .dwtag  DW_TAG_union_type
    1954                      .dwattr DW$T$29, DW_AT_name("GPBDAT_REG")
    1955                      .dwattr DW$T$29, DW_AT_byte_size(0x01)
    1956              DW$133  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1957                      .dwattr DW$133, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1958                      .dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1959                      .dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1960              DW$134  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    1961                      .dwattr DW$134, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1962                      .dwattr DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:10:57 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/AuxEeprom.asm PAGE   39

    1963                      .dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1964                      .dwendtag DW$T$29
    1965              
    1966              
    1967              DW$T$31 .dwtag  DW_TAG_union_type
    1968                      .dwattr DW$T$31, DW_AT_name("GPBSET_REG")
    1969                      .dwattr DW$T$31, DW_AT_byte_size(0x01)
    1970              DW$135  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1971                      .dwattr DW$135, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1972                      .dwattr DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1973                      .dwattr DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1974              DW$136  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    1975                      .dwattr DW$136, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1976                      .dwattr DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1977                      .dwattr DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1978                      .dwendtag DW$T$31
    1979              
    1980              
    1981              DW$T$33 .dwtag  DW_TAG_union_type
    1982                      .dwattr DW$T$33, DW_AT_name("GPBCLEAR_REG")
    1983                      .dwattr DW$T$33, DW_AT_byte_size(0x01)
    1984              DW$137  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1985                      .dwattr DW$137, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1986                      .dwattr DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1987                      .dwattr DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1988              DW$138  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    1989                      .dwattr DW$138, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1990                      .dwattr DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1991                      .dwattr DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1992                      .dwendtag DW$T$33
    1993              
    1994              
    1995              DW$T$35 .dwtag  DW_TAG_union_type
    1996                      .dwattr DW$T$35, DW_AT_name("GPBTOGGLE_REG")
    1997                      .dwattr DW$T$35, DW_AT_byte_size(0x01)
    1998              DW$139  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1999                      .dwattr DW$139, DW_AT_name("all"), DW_AT_symbol_name("_all")
    2000                      .dwattr DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2001                      .dwattr DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2002              DW$140  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    2003                      .dwattr DW$140, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    2004                      .dwattr DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2005                      .dwattr DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2006                      .dwendtag DW$T$35
    2007              
    2008              
    2009              DW$T$37 .dwtag  DW_TAG_union_type
    2010                      .dwattr DW$T$37, DW_AT_name("GPDDAT_REG")
    2011                      .dwattr DW$T$37, DW_AT_byte_size(0x01)
    2012              DW$141  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2013                      .dwattr DW$141, DW_AT_name("all"), DW_AT_symbol_name("_all")
    2014                      .dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2015                      .dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2016              DW$142  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    2017                      .dwattr DW$142, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:10:57 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/AuxEeprom.asm PAGE   40

    2018                      .dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2019                      .dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2020                      .dwendtag DW$T$37
    2021              
    2022              
    2023              DW$T$39 .dwtag  DW_TAG_union_type
    2024                      .dwattr DW$T$39, DW_AT_name("GPDSET_REG")
    2025                      .dwattr DW$T$39, DW_AT_byte_size(0x01)
    2026              DW$143  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2027                      .dwattr DW$143, DW_AT_name("all"), DW_AT_symbol_name("_all")
    2028                      .dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2029                      .dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2030              DW$144  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    2031                      .dwattr DW$144, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    2032                      .dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2033                      .dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2034                      .dwendtag DW$T$39
    2035              
    2036              
    2037              DW$T$41 .dwtag  DW_TAG_union_type
    2038                      .dwattr DW$T$41, DW_AT_name("GPDCLEAR_REG")
    2039                      .dwattr DW$T$41, DW_AT_byte_size(0x01)
    2040              DW$145  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2041                      .dwattr DW$145, DW_AT_name("all"), DW_AT_symbol_name("_all")
    2042                      .dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2043                      .dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2044              DW$146  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
    2045                      .dwattr DW$146, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    2046                      .dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2047                      .dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2048                      .dwendtag DW$T$41
    2049              
    2050              
    2051              DW$T$43 .dwtag  DW_TAG_union_type
    2052                      .dwattr DW$T$43, DW_AT_name("GPDTOGGLE_REG")
    2053                      .dwattr DW$T$43, DW_AT_byte_size(0x01)
    2054              DW$147  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2055                      .dwattr DW$147, DW_AT_name("all"), DW_AT_symbol_name("_all")
    2056                      .dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2057                      .dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2058              DW$148  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    2059                      .dwattr DW$148, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    2060                      .dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2061                      .dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2062                      .dwendtag DW$T$43
    2063              
    2064              
    2065              DW$T$45 .dwtag  DW_TAG_union_type
    2066                      .dwattr DW$T$45, DW_AT_name("GPEDAT_REG")
    2067                      .dwattr DW$T$45, DW_AT_byte_size(0x01)
    2068              DW$149  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2069                      .dwattr DW$149, DW_AT_name("all"), DW_AT_symbol_name("_all")
    2070                      .dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2071                      .dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2072              DW$150  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:10:57 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/AuxEeprom.asm PAGE   41

    2073                      .dwattr DW$150, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    2074                      .dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2075                      .dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2076                      .dwendtag DW$T$45
    2077              
    2078              
    2079              DW$T$47 .dwtag  DW_TAG_union_type
    2080                      .dwattr DW$T$47, DW_AT_name("GPESET_REG")
    2081                      .dwattr DW$T$47, DW_AT_byte_size(0x01)
    2082              DW$151  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2083                      .dwattr DW$151, DW_AT_name("all"), DW_AT_symbol_name("_all")
    2084                      .dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2085                      .dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2086              DW$152  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
    2087                      .dwattr DW$152, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    2088                      .dwattr DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2089                      .dwattr DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2090                      .dwendtag DW$T$47
    2091              
    2092              
    2093              DW$T$49 .dwtag  DW_TAG_union_type
    2094                      .dwattr DW$T$49, DW_AT_name("GPECLEAR_REG")
    2095                      .dwattr DW$T$49, DW_AT_byte_size(0x01)
    2096              DW$153  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2097                      .dwattr DW$153, DW_AT_name("all"), DW_AT_symbol_name("_all")
    2098                      .dwattr DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2099                      .dwattr DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2100              DW$154  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
    2101                      .dwattr DW$154, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    2102                      .dwattr DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2103                      .dwattr DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2104                      .dwendtag DW$T$49
    2105              
    2106              
    2107              DW$T$51 .dwtag  DW_TAG_union_type
    2108                      .dwattr DW$T$51, DW_AT_name("GPETOGGLE_REG")
    2109                      .dwattr DW$T$51, DW_AT_byte_size(0x01)
    2110              DW$155  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2111                      .dwattr DW$155, DW_AT_name("all"), DW_AT_symbol_name("_all")
    2112                      .dwattr DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2113                      .dwattr DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2114              DW$156  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
    2115                      .dwattr DW$156, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    2116                      .dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2117                      .dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2118                      .dwendtag DW$T$51
    2119              
    2120              
    2121              DW$T$53 .dwtag  DW_TAG_union_type
    2122                      .dwattr DW$T$53, DW_AT_name("GPFDAT_REG")
    2123                      .dwattr DW$T$53, DW_AT_byte_size(0x01)
    2124              DW$157  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2125                      .dwattr DW$157, DW_AT_name("all"), DW_AT_symbol_name("_all")
    2126                      .dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2127                      .dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:10:57 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/AuxEeprom.asm PAGE   42

    2128              DW$158  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
    2129                      .dwattr DW$158, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    2130                      .dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2131                      .dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2132                      .dwendtag DW$T$53
    2133              
    2134              
    2135              DW$T$55 .dwtag  DW_TAG_union_type
    2136                      .dwattr DW$T$55, DW_AT_name("GPFSET_REG")
    2137                      .dwattr DW$T$55, DW_AT_byte_size(0x01)
    2138              DW$159  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2139                      .dwattr DW$159, DW_AT_name("all"), DW_AT_symbol_name("_all")
    2140                      .dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2141                      .dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2142              DW$160  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
    2143                      .dwattr DW$160, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    2144                      .dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2145                      .dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2146                      .dwendtag DW$T$55
    2147              
    2148              
    2149              DW$T$57 .dwtag  DW_TAG_union_type
    2150                      .dwattr DW$T$57, DW_AT_name("GPFCLEAR_REG")
    2151                      .dwattr DW$T$57, DW_AT_byte_size(0x01)
    2152              DW$161  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2153                      .dwattr DW$161, DW_AT_name("all"), DW_AT_symbol_name("_all")
    2154                      .dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2155                      .dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2156              DW$162  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
    2157                      .dwattr DW$162, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    2158                      .dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2159                      .dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2160                      .dwendtag DW$T$57
    2161              
    2162              
    2163              DW$T$59 .dwtag  DW_TAG_union_type
    2164                      .dwattr DW$T$59, DW_AT_name("GPFTOGGLE_REG")
    2165                      .dwattr DW$T$59, DW_AT_byte_size(0x01)
    2166              DW$163  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2167                      .dwattr DW$163, DW_AT_name("all"), DW_AT_symbol_name("_all")
    2168                      .dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2169                      .dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2170              DW$164  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    2171                      .dwattr DW$164, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    2172                      .dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2173                      .dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2174                      .dwendtag DW$T$59
    2175              
    2176              
    2177              DW$T$61 .dwtag  DW_TAG_union_type
    2178                      .dwattr DW$T$61, DW_AT_name("GPGDAT_REG")
    2179                      .dwattr DW$T$61, DW_AT_byte_size(0x01)
    2180              DW$165  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2181                      .dwattr DW$165, DW_AT_name("all"), DW_AT_symbol_name("_all")
    2182                      .dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:10:57 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/AuxEeprom.asm PAGE   43

    2183                      .dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2184              DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
    2185                      .dwattr DW$166, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    2186                      .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2187                      .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2188                      .dwendtag DW$T$61
    2189              
    2190              
    2191              DW$T$63 .dwtag  DW_TAG_union_type
    2192                      .dwattr DW$T$63, DW_AT_name("GPGSET_REG")
    2193                      .dwattr DW$T$63, DW_AT_byte_size(0x01)
    2194              DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2195                      .dwattr DW$167, DW_AT_name("all"), DW_AT_symbol_name("_all")
    2196                      .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2197                      .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2198              DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
    2199                      .dwattr DW$168, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    2200                      .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2201                      .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2202                      .dwendtag DW$T$63
    2203              
    2204              
    2205              DW$T$65 .dwtag  DW_TAG_union_type
    2206                      .dwattr DW$T$65, DW_AT_name("GPGCLEAR_REG")
    2207                      .dwattr DW$T$65, DW_AT_byte_size(0x01)
    2208              DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2209                      .dwattr DW$169, DW_AT_name("all"), DW_AT_symbol_name("_all")
    2210                      .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2211                      .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2212              DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
    2213                      .dwattr DW$170, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    2214                      .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2215                      .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2216                      .dwendtag DW$T$65
    2217              
    2218              
    2219              DW$T$67 .dwtag  DW_TAG_union_type
    2220                      .dwattr DW$T$67, DW_AT_name("GPGTOGGLE_REG")
    2221                      .dwattr DW$T$67, DW_AT_byte_size(0x01)
    2222              DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2223                      .dwattr DW$171, DW_AT_name("all"), DW_AT_symbol_name("_all")
    2224                      .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2225                      .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2226              DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
    2227                      .dwattr DW$172, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    2228                      .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2229                      .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2230                      .dwendtag DW$T$67
    2231              
    2232              
    2233              DW$T$20 .dwtag  DW_TAG_structure_type
    2234                      .dwattr DW$T$20, DW_AT_name("GPADAT_BITS")
    2235                      .dwattr DW$T$20, DW_AT_byte_size(0x01)
    2236              DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2237                      .dwattr DW$173, DW_AT_name("GPIOA0"), DW_AT_symbol_name("_GPIOA0")
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:10:57 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/AuxEeprom.asm PAGE   44

    2238                      .dwattr DW$173, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2239                      .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2240                      .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2241              DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2242                      .dwattr DW$174, DW_AT_name("GPIOA1"), DW_AT_symbol_name("_GPIOA1")
    2243                      .dwattr DW$174, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2244                      .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2245                      .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2246              DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2247                      .dwattr DW$175, DW_AT_name("GPIOA2"), DW_AT_symbol_name("_GPIOA2")
    2248                      .dwattr DW$175, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2249                      .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2250                      .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2251              DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2252                      .dwattr DW$176, DW_AT_name("GPIOA3"), DW_AT_symbol_name("_GPIOA3")
    2253                      .dwattr DW$176, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2254                      .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2255                      .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2256              DW$177  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2257                      .dwattr DW$177, DW_AT_name("GPIOA4"), DW_AT_symbol_name("_GPIOA4")
    2258                      .dwattr DW$177, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2259                      .dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2260                      .dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2261              DW$178  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2262                      .dwattr DW$178, DW_AT_name("GPIOA5"), DW_AT_symbol_name("_GPIOA5")
    2263                      .dwattr DW$178, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2264                      .dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2265                      .dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2266              DW$179  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2267                      .dwattr DW$179, DW_AT_name("GPIOA6"), DW_AT_symbol_name("_GPIOA6")
    2268                      .dwattr DW$179, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2269                      .dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2270                      .dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2271              DW$180  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2272                      .dwattr DW$180, DW_AT_name("GPIOA7"), DW_AT_symbol_name("_GPIOA7")
    2273                      .dwattr DW$180, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2274                      .dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2275                      .dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2276              DW$181  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2277                      .dwattr DW$181, DW_AT_name("GPIOA8"), DW_AT_symbol_name("_GPIOA8")
    2278                      .dwattr DW$181, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2279                      .dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2280                      .dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2281              DW$182  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2282                      .dwattr DW$182, DW_AT_name("GPIOA9"), DW_AT_symbol_name("_GPIOA9")
    2283                      .dwattr DW$182, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2284                      .dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2285                      .dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2286              DW$183  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2287                      .dwattr DW$183, DW_AT_name("GPIOA10"), DW_AT_symbol_name("_GPIOA10")
    2288                      .dwattr DW$183, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2289                      .dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2290                      .dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2291              DW$184  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2292                      .dwattr DW$184, DW_AT_name("GPIOA11"), DW_AT_symbol_name("_GPIOA11")
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:10:57 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/AuxEeprom.asm PAGE   45

    2293                      .dwattr DW$184, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2294                      .dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2295                      .dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2296              DW$185  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2297                      .dwattr DW$185, DW_AT_name("GPIOA12"), DW_AT_symbol_name("_GPIOA12")
    2298                      .dwattr DW$185, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2299                      .dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2300                      .dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2301              DW$186  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2302                      .dwattr DW$186, DW_AT_name("GPIOA13"), DW_AT_symbol_name("_GPIOA13")
    2303                      .dwattr DW$186, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2304                      .dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2305                      .dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2306              DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2307                      .dwattr DW$187, DW_AT_name("GPIOA14"), DW_AT_symbol_name("_GPIOA14")
    2308                      .dwattr DW$187, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2309                      .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2310                      .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2311              DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2312                      .dwattr DW$188, DW_AT_name("GPIOA15"), DW_AT_symbol_name("_GPIOA15")
    2313                      .dwattr DW$188, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2314                      .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2315                      .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2316                      .dwendtag DW$T$20
    2317              
    2318              
    2319              DW$T$22 .dwtag  DW_TAG_structure_type
    2320                      .dwattr DW$T$22, DW_AT_name("GPASET_BITS")
    2321                      .dwattr DW$T$22, DW_AT_byte_size(0x01)
    2322              DW$189  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2323                      .dwattr DW$189, DW_AT_name("GPIOA0"), DW_AT_symbol_name("_GPIOA0")
    2324                      .dwattr DW$189, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2325                      .dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2326                      .dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2327              DW$190  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2328                      .dwattr DW$190, DW_AT_name("GPIOA1"), DW_AT_symbol_name("_GPIOA1")
    2329                      .dwattr DW$190, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2330                      .dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2331                      .dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2332              DW$191  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2333                      .dwattr DW$191, DW_AT_name("GPIOA2"), DW_AT_symbol_name("_GPIOA2")
    2334                      .dwattr DW$191, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2335                      .dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2336                      .dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2337              DW$192  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2338                      .dwattr DW$192, DW_AT_name("GPIOA3"), DW_AT_symbol_name("_GPIOA3")
    2339                      .dwattr DW$192, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2340                      .dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2341                      .dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2342              DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2343                      .dwattr DW$193, DW_AT_name("GPIOA4"), DW_AT_symbol_name("_GPIOA4")
    2344                      .dwattr DW$193, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2345                      .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2346                      .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2347              DW$194  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:10:57 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/AuxEeprom.asm PAGE   46

    2348                      .dwattr DW$194, DW_AT_name("GPIOA5"), DW_AT_symbol_name("_GPIOA5")
    2349                      .dwattr DW$194, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2350                      .dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2351                      .dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2352              DW$195  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2353                      .dwattr DW$195, DW_AT_name("GPIOA6"), DW_AT_symbol_name("_GPIOA6")
    2354                      .dwattr DW$195, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2355                      .dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2356                      .dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2357              DW$196  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2358                      .dwattr DW$196, DW_AT_name("GPIOA7"), DW_AT_symbol_name("_GPIOA7")
    2359                      .dwattr DW$196, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2360                      .dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2361                      .dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2362              DW$197  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2363                      .dwattr DW$197, DW_AT_name("GPIOA8"), DW_AT_symbol_name("_GPIOA8")
    2364                      .dwattr DW$197, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2365                      .dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2366                      .dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2367              DW$198  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2368                      .dwattr DW$198, DW_AT_name("GPIOA9"), DW_AT_symbol_name("_GPIOA9")
    2369                      .dwattr DW$198, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2370                      .dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2371                      .dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2372              DW$199  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2373                      .dwattr DW$199, DW_AT_name("GPIOA10"), DW_AT_symbol_name("_GPIOA10")
    2374                      .dwattr DW$199, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2375                      .dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2376                      .dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2377              DW$200  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2378                      .dwattr DW$200, DW_AT_name("GPIOA11"), DW_AT_symbol_name("_GPIOA11")
    2379                      .dwattr DW$200, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2380                      .dwattr DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2381                      .dwattr DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2382              DW$201  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2383                      .dwattr DW$201, DW_AT_name("GPIOA12"), DW_AT_symbol_name("_GPIOA12")
    2384                      .dwattr DW$201, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2385                      .dwattr DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2386                      .dwattr DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2387              DW$202  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2388                      .dwattr DW$202, DW_AT_name("GPIOA13"), DW_AT_symbol_name("_GPIOA13")
    2389                      .dwattr DW$202, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2390                      .dwattr DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2391                      .dwattr DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2392              DW$203  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2393                      .dwattr DW$203, DW_AT_name("GPIOA14"), DW_AT_symbol_name("_GPIOA14")
    2394                      .dwattr DW$203, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2395                      .dwattr DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2396                      .dwattr DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2397              DW$204  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2398                      .dwattr DW$204, DW_AT_name("GPIOA15"), DW_AT_symbol_name("_GPIOA15")
    2399                      .dwattr DW$204, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2400                      .dwattr DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2401                      .dwattr DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2402                      .dwendtag DW$T$22
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:10:57 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/AuxEeprom.asm PAGE   47

    2403              
    2404              
    2405              DW$T$24 .dwtag  DW_TAG_structure_type
    2406                      .dwattr DW$T$24, DW_AT_name("GPACLEAR_BITS")
    2407                      .dwattr DW$T$24, DW_AT_byte_size(0x01)
    2408              DW$205  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2409                      .dwattr DW$205, DW_AT_name("GPIOA0"), DW_AT_symbol_name("_GPIOA0")
    2410                      .dwattr DW$205, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2411                      .dwattr DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2412                      .dwattr DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2413              DW$206  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2414                      .dwattr DW$206, DW_AT_name("GPIOA1"), DW_AT_symbol_name("_GPIOA1")
    2415                      .dwattr DW$206, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2416                      .dwattr DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2417                      .dwattr DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2418              DW$207  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2419                      .dwattr DW$207, DW_AT_name("GPIOA2"), DW_AT_symbol_name("_GPIOA2")
    2420                      .dwattr DW$207, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2421                      .dwattr DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2422                      .dwattr DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2423              DW$208  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2424                      .dwattr DW$208, DW_AT_name("GPIOA3"), DW_AT_symbol_name("_GPIOA3")
    2425                      .dwattr DW$208, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2426                      .dwattr DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2427                      .dwattr DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2428              DW$209  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2429                      .dwattr DW$209, DW_AT_name("GPIOA4"), DW_AT_symbol_name("_GPIOA4")
    2430                      .dwattr DW$209, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2431                      .dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2432                      .dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2433              DW$210  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2434                      .dwattr DW$210, DW_AT_name("GPIOA5"), DW_AT_symbol_name("_GPIOA5")
    2435                      .dwattr DW$210, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2436                      .dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2437                      .dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2438              DW$211  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2439                      .dwattr DW$211, DW_AT_name("GPIOA6"), DW_AT_symbol_name("_GPIOA6")
    2440                      .dwattr DW$211, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2441                      .dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2442                      .dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2443              DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2444                      .dwattr DW$212, DW_AT_name("GPIOA7"), DW_AT_symbol_name("_GPIOA7")
    2445                      .dwattr DW$212, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2446                      .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2447                      .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2448              DW$213  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2449                      .dwattr DW$213, DW_AT_name("GPIOA8"), DW_AT_symbol_name("_GPIOA8")
    2450                      .dwattr DW$213, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2451                      .dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2452                      .dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2453              DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2454                      .dwattr DW$214, DW_AT_name("GPIOA9"), DW_AT_symbol_name("_GPIOA9")
    2455                      .dwattr DW$214, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2456                      .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2457                      .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:10:57 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/AuxEeprom.asm PAGE   48

    2458              DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2459                      .dwattr DW$215, DW_AT_name("GPIOA10"), DW_AT_symbol_name("_GPIOA10")
    2460                      .dwattr DW$215, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2461                      .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2462                      .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2463              DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2464                      .dwattr DW$216, DW_AT_name("GPIOA11"), DW_AT_symbol_name("_GPIOA11")
    2465                      .dwattr DW$216, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2466                      .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2467                      .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2468              DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2469                      .dwattr DW$217, DW_AT_name("GPIOA12"), DW_AT_symbol_name("_GPIOA12")
    2470                      .dwattr DW$217, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2471                      .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2472                      .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2473              DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2474                      .dwattr DW$218, DW_AT_name("GPIOA13"), DW_AT_symbol_name("_GPIOA13")
    2475                      .dwattr DW$218, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2476                      .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2477                      .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2478              DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2479                      .dwattr DW$219, DW_AT_name("GPIOA14"), DW_AT_symbol_name("_GPIOA14")
    2480                      .dwattr DW$219, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2481                      .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2482                      .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2483              DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2484                      .dwattr DW$220, DW_AT_name("GPIOA15"), DW_AT_symbol_name("_GPIOA15")
    2485                      .dwattr DW$220, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2486                      .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2487                      .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2488                      .dwendtag DW$T$24
    2489              
    2490              
    2491              DW$T$26 .dwtag  DW_TAG_structure_type
    2492                      .dwattr DW$T$26, DW_AT_name("GPATOGGLE_BITS")
    2493                      .dwattr DW$T$26, DW_AT_byte_size(0x01)
    2494              DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2495                      .dwattr DW$221, DW_AT_name("GPIOA0"), DW_AT_symbol_name("_GPIOA0")
    2496                      .dwattr DW$221, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2497                      .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2498                      .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2499              DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2500                      .dwattr DW$222, DW_AT_name("GPIOA1"), DW_AT_symbol_name("_GPIOA1")
    2501                      .dwattr DW$222, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2502                      .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2503                      .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2504              DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2505                      .dwattr DW$223, DW_AT_name("GPIOA2"), DW_AT_symbol_name("_GPIOA2")
    2506                      .dwattr DW$223, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2507                      .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2508                      .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2509              DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2510                      .dwattr DW$224, DW_AT_name("GPIOA3"), DW_AT_symbol_name("_GPIOA3")
    2511                      .dwattr DW$224, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2512                      .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:10:57 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/AuxEeprom.asm PAGE   49

    2513                      .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2514              DW$225  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2515                      .dwattr DW$225, DW_AT_name("GPIOA4"), DW_AT_symbol_name("_GPIOA4")
    2516                      .dwattr DW$225, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2517                      .dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2518                      .dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2519              DW$226  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2520                      .dwattr DW$226, DW_AT_name("GPIOA5"), DW_AT_symbol_name("_GPIOA5")
    2521                      .dwattr DW$226, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2522                      .dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2523                      .dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2524              DW$227  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2525                      .dwattr DW$227, DW_AT_name("GPIOA6"), DW_AT_symbol_name("_GPIOA6")
    2526                      .dwattr DW$227, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2527                      .dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2528                      .dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2529              DW$228  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2530                      .dwattr DW$228, DW_AT_name("GPIOA7"), DW_AT_symbol_name("_GPIOA7")
    2531                      .dwattr DW$228, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2532                      .dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2533                      .dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2534              DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2535                      .dwattr DW$229, DW_AT_name("GPIOA8"), DW_AT_symbol_name("_GPIOA8")
    2536                      .dwattr DW$229, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2537                      .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2538                      .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2539              DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2540                      .dwattr DW$230, DW_AT_name("GPIOA9"), DW_AT_symbol_name("_GPIOA9")
    2541                      .dwattr DW$230, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2542                      .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2543                      .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2544              DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2545                      .dwattr DW$231, DW_AT_name("GPIOA10"), DW_AT_symbol_name("_GPIOA10")
    2546                      .dwattr DW$231, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2547                      .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2548                      .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2549              DW$232  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2550                      .dwattr DW$232, DW_AT_name("GPIOA11"), DW_AT_symbol_name("_GPIOA11")
    2551                      .dwattr DW$232, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2552                      .dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2553                      .dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2554              DW$233  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2555                      .dwattr DW$233, DW_AT_name("GPIOA12"), DW_AT_symbol_name("_GPIOA12")
    2556                      .dwattr DW$233, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2557                      .dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2558                      .dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2559              DW$234  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2560                      .dwattr DW$234, DW_AT_name("GPIOA13"), DW_AT_symbol_name("_GPIOA13")
    2561                      .dwattr DW$234, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2562                      .dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2563                      .dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2564              DW$235  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2565                      .dwattr DW$235, DW_AT_name("GPIOA14"), DW_AT_symbol_name("_GPIOA14")
    2566                      .dwattr DW$235, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2567                      .dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:10:57 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/AuxEeprom.asm PAGE   50

    2568                      .dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2569              DW$236  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2570                      .dwattr DW$236, DW_AT_name("GPIOA15"), DW_AT_symbol_name("_GPIOA15")
    2571                      .dwattr DW$236, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2572                      .dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2573                      .dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2574                      .dwendtag DW$T$26
    2575              
    2576              
    2577              DW$T$28 .dwtag  DW_TAG_structure_type
    2578                      .dwattr DW$T$28, DW_AT_name("GPBDAT_BITS")
    2579                      .dwattr DW$T$28, DW_AT_byte_size(0x01)
    2580              DW$237  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2581                      .dwattr DW$237, DW_AT_name("GPIOB0"), DW_AT_symbol_name("_GPIOB0")
    2582                      .dwattr DW$237, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2583                      .dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2584                      .dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2585              DW$238  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2586                      .dwattr DW$238, DW_AT_name("GPIOB1"), DW_AT_symbol_name("_GPIOB1")
    2587                      .dwattr DW$238, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2588                      .dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2589                      .dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2590              DW$239  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2591                      .dwattr DW$239, DW_AT_name("GPIOB2"), DW_AT_symbol_name("_GPIOB2")
    2592                      .dwattr DW$239, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2593                      .dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2594                      .dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2595              DW$240  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2596                      .dwattr DW$240, DW_AT_name("GPIOB3"), DW_AT_symbol_name("_GPIOB3")
    2597                      .dwattr DW$240, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2598                      .dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2599                      .dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2600              DW$241  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2601                      .dwattr DW$241, DW_AT_name("GPIOB4"), DW_AT_symbol_name("_GPIOB4")
    2602                      .dwattr DW$241, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2603                      .dwattr DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2604                      .dwattr DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2605              DW$242  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2606                      .dwattr DW$242, DW_AT_name("GPIOB5"), DW_AT_symbol_name("_GPIOB5")
    2607                      .dwattr DW$242, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2608                      .dwattr DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2609                      .dwattr DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2610              DW$243  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2611                      .dwattr DW$243, DW_AT_name("GPIOB6"), DW_AT_symbol_name("_GPIOB6")
    2612                      .dwattr DW$243, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2613                      .dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2614                      .dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2615              DW$244  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2616                      .dwattr DW$244, DW_AT_name("GPIOB7"), DW_AT_symbol_name("_GPIOB7")
    2617                      .dwattr DW$244, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2618                      .dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2619                      .dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2620              DW$245  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2621                      .dwattr DW$245, DW_AT_name("GPIOB8"), DW_AT_symbol_name("_GPIOB8")
    2622                      .dwattr DW$245, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:10:57 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/AuxEeprom.asm PAGE   51

    2623                      .dwattr DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2624                      .dwattr DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2625              DW$246  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2626                      .dwattr DW$246, DW_AT_name("GPIOB9"), DW_AT_symbol_name("_GPIOB9")
    2627                      .dwattr DW$246, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2628                      .dwattr DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2629                      .dwattr DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2630              DW$247  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2631                      .dwattr DW$247, DW_AT_name("GPIOB10"), DW_AT_symbol_name("_GPIOB10")
    2632                      .dwattr DW$247, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2633                      .dwattr DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2634                      .dwattr DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2635              DW$248  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2636                      .dwattr DW$248, DW_AT_name("GPIOB11"), DW_AT_symbol_name("_GPIOB11")
    2637                      .dwattr DW$248, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2638                      .dwattr DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2639                      .dwattr DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2640              DW$249  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2641                      .dwattr DW$249, DW_AT_name("GPIOB12"), DW_AT_symbol_name("_GPIOB12")
    2642                      .dwattr DW$249, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2643                      .dwattr DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2644                      .dwattr DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2645              DW$250  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2646                      .dwattr DW$250, DW_AT_name("GPIOB13"), DW_AT_symbol_name("_GPIOB13")
    2647                      .dwattr DW$250, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2648                      .dwattr DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2649                      .dwattr DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2650              DW$251  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2651                      .dwattr DW$251, DW_AT_name("GPIOB14"), DW_AT_symbol_name("_GPIOB14")
    2652                      .dwattr DW$251, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2653                      .dwattr DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2654                      .dwattr DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2655              DW$252  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2656                      .dwattr DW$252, DW_AT_name("GPIOB15"), DW_AT_symbol_name("_GPIOB15")
    2657                      .dwattr DW$252, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2658                      .dwattr DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2659                      .dwattr DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2660                      .dwendtag DW$T$28
    2661              
    2662              
    2663              DW$T$30 .dwtag  DW_TAG_structure_type
    2664                      .dwattr DW$T$30, DW_AT_name("GPBSET_BITS")
    2665                      .dwattr DW$T$30, DW_AT_byte_size(0x01)
    2666              DW$253  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2667                      .dwattr DW$253, DW_AT_name("GPIOB0"), DW_AT_symbol_name("_GPIOB0")
    2668                      .dwattr DW$253, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2669                      .dwattr DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2670                      .dwattr DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2671              DW$254  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2672                      .dwattr DW$254, DW_AT_name("GPIOB1"), DW_AT_symbol_name("_GPIOB1")
    2673                      .dwattr DW$254, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2674                      .dwattr DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2675                      .dwattr DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2676              DW$255  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2677                      .dwattr DW$255, DW_AT_name("GPIOB2"), DW_AT_symbol_name("_GPIOB2")
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:10:57 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/AuxEeprom.asm PAGE   52

    2678                      .dwattr DW$255, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2679                      .dwattr DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2680                      .dwattr DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2681              DW$256  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2682                      .dwattr DW$256, DW_AT_name("GPIOB3"), DW_AT_symbol_name("_GPIOB3")
    2683                      .dwattr DW$256, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2684                      .dwattr DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2685                      .dwattr DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2686              DW$257  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2687                      .dwattr DW$257, DW_AT_name("GPIOB4"), DW_AT_symbol_name("_GPIOB4")
    2688                      .dwattr DW$257, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2689                      .dwattr DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2690                      .dwattr DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2691              DW$258  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2692                      .dwattr DW$258, DW_AT_name("GPIOB5"), DW_AT_symbol_name("_GPIOB5")
    2693                      .dwattr DW$258, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2694                      .dwattr DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2695                      .dwattr DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2696              DW$259  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2697                      .dwattr DW$259, DW_AT_name("GPIOB6"), DW_AT_symbol_name("_GPIOB6")
    2698                      .dwattr DW$259, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2699                      .dwattr DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2700                      .dwattr DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2701              DW$260  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2702                      .dwattr DW$260, DW_AT_name("GPIOB7"), DW_AT_symbol_name("_GPIOB7")
    2703                      .dwattr DW$260, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2704                      .dwattr DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2705                      .dwattr DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2706              DW$261  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2707                      .dwattr DW$261, DW_AT_name("GPIOB8"), DW_AT_symbol_name("_GPIOB8")
    2708                      .dwattr DW$261, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2709                      .dwattr DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2710                      .dwattr DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2711              DW$262  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2712                      .dwattr DW$262, DW_AT_name("GPIOB9"), DW_AT_symbol_name("_GPIOB9")
    2713                      .dwattr DW$262, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2714                      .dwattr DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2715                      .dwattr DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2716              DW$263  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2717                      .dwattr DW$263, DW_AT_name("GPIOB10"), DW_AT_symbol_name("_GPIOB10")
    2718                      .dwattr DW$263, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2719                      .dwattr DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2720                      .dwattr DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2721              DW$264  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2722                      .dwattr DW$264, DW_AT_name("GPIOB11"), DW_AT_symbol_name("_GPIOB11")
    2723                      .dwattr DW$264, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2724                      .dwattr DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2725                      .dwattr DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2726              DW$265  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2727                      .dwattr DW$265, DW_AT_name("GPIOB12"), DW_AT_symbol_name("_GPIOB12")
    2728                      .dwattr DW$265, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2729                      .dwattr DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2730                      .dwattr DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2731              DW$266  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2732                      .dwattr DW$266, DW_AT_name("GPIOB13"), DW_AT_symbol_name("_GPIOB13")
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:10:57 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/AuxEeprom.asm PAGE   53

    2733                      .dwattr DW$266, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2734                      .dwattr DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2735                      .dwattr DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2736              DW$267  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2737                      .dwattr DW$267, DW_AT_name("GPIOB14"), DW_AT_symbol_name("_GPIOB14")
    2738                      .dwattr DW$267, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2739                      .dwattr DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2740                      .dwattr DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2741              DW$268  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2742                      .dwattr DW$268, DW_AT_name("GPIOB15"), DW_AT_symbol_name("_GPIOB15")
    2743                      .dwattr DW$268, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2744                      .dwattr DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2745                      .dwattr DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2746                      .dwendtag DW$T$30
    2747              
    2748              
    2749              DW$T$32 .dwtag  DW_TAG_structure_type
    2750                      .dwattr DW$T$32, DW_AT_name("GPBCLEAR_BITS")
    2751                      .dwattr DW$T$32, DW_AT_byte_size(0x01)
    2752              DW$269  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2753                      .dwattr DW$269, DW_AT_name("GPIOB0"), DW_AT_symbol_name("_GPIOB0")
    2754                      .dwattr DW$269, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2755                      .dwattr DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2756                      .dwattr DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2757              DW$270  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2758                      .dwattr DW$270, DW_AT_name("GPIOB1"), DW_AT_symbol_name("_GPIOB1")
    2759                      .dwattr DW$270, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2760                      .dwattr DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2761                      .dwattr DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2762              DW$271  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2763                      .dwattr DW$271, DW_AT_name("GPIOB2"), DW_AT_symbol_name("_GPIOB2")
    2764                      .dwattr DW$271, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2765                      .dwattr DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2766                      .dwattr DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2767              DW$272  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2768                      .dwattr DW$272, DW_AT_name("GPIOB3"), DW_AT_symbol_name("_GPIOB3")
    2769                      .dwattr DW$272, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2770                      .dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2771                      .dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2772              DW$273  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2773                      .dwattr DW$273, DW_AT_name("GPIOB4"), DW_AT_symbol_name("_GPIOB4")
    2774                      .dwattr DW$273, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2775                      .dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2776                      .dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2777              DW$274  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2778                      .dwattr DW$274, DW_AT_name("GPIOB5"), DW_AT_symbol_name("_GPIOB5")
    2779                      .dwattr DW$274, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2780                      .dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2781                      .dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2782              DW$275  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2783                      .dwattr DW$275, DW_AT_name("GPIOB6"), DW_AT_symbol_name("_GPIOB6")
    2784                      .dwattr DW$275, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2785                      .dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2786                      .dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2787              DW$276  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:10:57 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/AuxEeprom.asm PAGE   54

    2788                      .dwattr DW$276, DW_AT_name("GPIOB7"), DW_AT_symbol_name("_GPIOB7")
    2789                      .dwattr DW$276, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2790                      .dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2791                      .dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2792              DW$277  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2793                      .dwattr DW$277, DW_AT_name("GPIOB8"), DW_AT_symbol_name("_GPIOB8")
    2794                      .dwattr DW$277, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2795                      .dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2796                      .dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2797              DW$278  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2798                      .dwattr DW$278, DW_AT_name("GPIOB9"), DW_AT_symbol_name("_GPIOB9")
    2799                      .dwattr DW$278, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2800                      .dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2801                      .dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2802              DW$279  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2803                      .dwattr DW$279, DW_AT_name("GPIOB10"), DW_AT_symbol_name("_GPIOB10")
    2804                      .dwattr DW$279, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2805                      .dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2806                      .dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2807              DW$280  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2808                      .dwattr DW$280, DW_AT_name("GPIOB11"), DW_AT_symbol_name("_GPIOB11")
    2809                      .dwattr DW$280, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2810                      .dwattr DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2811                      .dwattr DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2812              DW$281  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2813                      .dwattr DW$281, DW_AT_name("GPIOB12"), DW_AT_symbol_name("_GPIOB12")
    2814                      .dwattr DW$281, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2815                      .dwattr DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2816                      .dwattr DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2817              DW$282  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2818                      .dwattr DW$282, DW_AT_name("GPIOB13"), DW_AT_symbol_name("_GPIOB13")
    2819                      .dwattr DW$282, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2820                      .dwattr DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2821                      .dwattr DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2822              DW$283  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2823                      .dwattr DW$283, DW_AT_name("GPIOB14"), DW_AT_symbol_name("_GPIOB14")
    2824                      .dwattr DW$283, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2825                      .dwattr DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2826                      .dwattr DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2827              DW$284  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2828                      .dwattr DW$284, DW_AT_name("GPIOB15"), DW_AT_symbol_name("_GPIOB15")
    2829                      .dwattr DW$284, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2830                      .dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2831                      .dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2832                      .dwendtag DW$T$32
    2833              
    2834              
    2835              DW$T$34 .dwtag  DW_TAG_structure_type
    2836                      .dwattr DW$T$34, DW_AT_name("GPBTOGGLE_BITS")
    2837                      .dwattr DW$T$34, DW_AT_byte_size(0x01)
    2838              DW$285  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2839                      .dwattr DW$285, DW_AT_name("GPIOB0"), DW_AT_symbol_name("_GPIOB0")
    2840                      .dwattr DW$285, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2841                      .dwattr DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2842                      .dwattr DW$285, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:10:57 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/AuxEeprom.asm PAGE   55

    2843              DW$286  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2844                      .dwattr DW$286, DW_AT_name("GPIOB1"), DW_AT_symbol_name("_GPIOB1")
    2845                      .dwattr DW$286, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2846                      .dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2847                      .dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2848              DW$287  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2849                      .dwattr DW$287, DW_AT_name("GPIOB2"), DW_AT_symbol_name("_GPIOB2")
    2850                      .dwattr DW$287, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2851                      .dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2852                      .dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2853              DW$288  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2854                      .dwattr DW$288, DW_AT_name("GPIOB3"), DW_AT_symbol_name("_GPIOB3")
    2855                      .dwattr DW$288, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2856                      .dwattr DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2857                      .dwattr DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2858              DW$289  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2859                      .dwattr DW$289, DW_AT_name("GPIOB4"), DW_AT_symbol_name("_GPIOB4")
    2860                      .dwattr DW$289, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2861                      .dwattr DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2862                      .dwattr DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2863              DW$290  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2864                      .dwattr DW$290, DW_AT_name("GPIOB5"), DW_AT_symbol_name("_GPIOB5")
    2865                      .dwattr DW$290, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2866                      .dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2867                      .dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2868              DW$291  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2869                      .dwattr DW$291, DW_AT_name("GPIOB6"), DW_AT_symbol_name("_GPIOB6")
    2870                      .dwattr DW$291, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2871                      .dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2872                      .dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
