TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Dac.asm          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Tue Apr  8 10:05:52 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=softlib --hll_source=on --mem_model:code
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/repo/jabil2025/gpb/gpb_project_v3/Dac.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\repo\jabil2025\gpb\gpb_project_v3\projects\example_nonBIOS_ram\D
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("DelayUs")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_DelayUs")

     728              ;***************************************************************
     729              ;* FNAME: _LoadDac                      FR SIZE:   0           *
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Dac.asm          PAGE   15

     730              ;*                                                             *
     731              ;* FUNCTION ENVIRONMENT                                        *
     732              ;*                                                             *
     733              ;* FUNCTION PROPERTIES                                         *
     734              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     735              ;***************************************************************
     736              
     737 00000098       _LoadDac:
     738                      .dwcfi  cfa_offset, -2
     739                      .dwcfi  save_reg_to_mem, 26, 0
     740                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Dac.c",line 174,column 2,is_stmt,isa 0
     741              ;----------------------------------------------------------------------
     742              ; 174 | GpioDataRegs.GPDCLEAR.bit.GPIOD5 = 1;   // Set LD_DA LOW               
     743              ;----------------------------------------------------------------------
     744 00000098 761F!         MOVW      DP,#_GpioDataRegs+14  ; [CPU_ARAU] 
         00000099 0000 
     745 0000009a 1A0E!         OR        @$BLOCKED(_GpioDataRegs)+14,#0x0020 ; [CPU_ALU] |174| 
         0000009b 0020 
     746                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Dac.c",line 175,column 2,is_stmt,isa 0
     747              ;----------------------------------------------------------------------
     748              ; 175 | DelayUs(5);                                                            
     749              ;----------------------------------------------------------------------
     750 0000009c 9A05          MOVB      AL,#5                 ; [CPU_ALU] |175| 
     751              $C$DW$50        .dwtag  DW_TAG_TI_branch
     752                      .dwattr $C$DW$50, DW_AT_low_pc(0x00)
     753                      .dwattr $C$DW$50, DW_AT_name("_DelayUs")
     754                      .dwattr $C$DW$50, DW_AT_TI_call
     755              
     756 0000009d 7640!         LCR       #_DelayUs             ; [CPU_ALU] |175| 
         0000009e 0000 
     757                      ; call occurs [#_DelayUs] ; [] |175| 
     758                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Dac.c",line 176,column 2,is_stmt,isa 0
     759              ;----------------------------------------------------------------------
     760              ; 176 | GpioDataRegs.GPDSET.bit.GPIOD5  = 1;    // Set LD_DA HIGH              
     761              ;----------------------------------------------------------------------
     762 0000009f 761F!         MOVW      DP,#_GpioDataRegs+13  ; [CPU_ARAU] 
         000000a0 0000 
     763 000000a1 1A0D!         OR        @$BLOCKED(_GpioDataRegs)+13,#0x0020 ; [CPU_ALU] |176| 
         000000a2 0020 
     764                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Dac.c",line 178,column 1,is_stmt,isa 0
     765              $C$DW$51        .dwtag  DW_TAG_TI_branch
     766                      .dwattr $C$DW$51, DW_AT_low_pc(0x00)
     767                      .dwattr $C$DW$51, DW_AT_TI_return
     768              
     769 000000a3 0006          LRETR     ; [CPU_ALU] 
     770                      ; return occurs ; [] 
     771                      .dwattr $C$DW$49, DW_AT_TI_end_file("C:/repo/jabil2025/gpb/gpb_project_v3/Dac.c")
     772                      .dwattr $C$DW$49, DW_AT_TI_end_line(0xb2)
     773                      .dwattr $C$DW$49, DW_AT_TI_end_column(0x01)
     774                      .dwendentry
     775                      .dwendtag $C$DW$49
     776              
     777              ;**************************************************************
     778              ;* UNDEFINED EXTERNAL REFERENCES                              *
     779              ;**************************************************************
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Dac.asm          PAGE   16

     780                      .global _DelayUs
     781                      .global _SpiTxNotReady
     782                      .global _ConfigSpi
     783                      .global _TxSpi
     784                      .global _SpiRxNotReady
     785                      .global _RxSpi
     786                      .global _GpioDataRegs
     787                      .global FS$$CMP
     788                      .global FS$$DIV
     789                      .global FS$$MPY
     790                      .global FS$$TOU
     791              
     792              ;***************************************************************
     793              ;* TYPE INFORMATION                                            *
     794              ;***************************************************************
     795              
     796              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     797                      .dwattr $C$DW$T$20, DW_AT_name("GPACLEAR_BITS")
     798                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     799              $C$DW$52        .dwtag  DW_TAG_member
     800                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     801                      .dwattr $C$DW$52, DW_AT_name("GPIOA0")
     802                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_GPIOA0")
     803                      .dwattr $C$DW$52, DW_AT_bit_offset(0x0f)
     804                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
     805                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     806                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     807              
     808              $C$DW$53        .dwtag  DW_TAG_member
     809                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     810                      .dwattr $C$DW$53, DW_AT_name("GPIOA1")
     811                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_GPIOA1")
     812                      .dwattr $C$DW$53, DW_AT_bit_offset(0x0e)
     813                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
     814                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     815                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     816              
     817              $C$DW$54        .dwtag  DW_TAG_member
     818                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     819                      .dwattr $C$DW$54, DW_AT_name("GPIOA2")
     820                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_GPIOA2")
     821                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0d)
     822                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
     823                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     824                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     825              
     826              $C$DW$55        .dwtag  DW_TAG_member
     827                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     828                      .dwattr $C$DW$55, DW_AT_name("GPIOA3")
     829                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_GPIOA3")
     830                      .dwattr $C$DW$55, DW_AT_bit_offset(0x0c)
     831                      .dwattr $C$DW$55, DW_AT_bit_size(0x01)
     832                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     833                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     834              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Dac.asm          PAGE   17

     835              $C$DW$56        .dwtag  DW_TAG_member
     836                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     837                      .dwattr $C$DW$56, DW_AT_name("GPIOA4")
     838                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_GPIOA4")
     839                      .dwattr $C$DW$56, DW_AT_bit_offset(0x0b)
     840                      .dwattr $C$DW$56, DW_AT_bit_size(0x01)
     841                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     842                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     843              
     844              $C$DW$57        .dwtag  DW_TAG_member
     845                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     846                      .dwattr $C$DW$57, DW_AT_name("GPIOA5")
     847                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_GPIOA5")
     848                      .dwattr $C$DW$57, DW_AT_bit_offset(0x0a)
     849                      .dwattr $C$DW$57, DW_AT_bit_size(0x01)
     850                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     851                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     852              
     853              $C$DW$58        .dwtag  DW_TAG_member
     854                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     855                      .dwattr $C$DW$58, DW_AT_name("GPIOA6")
     856                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_GPIOA6")
     857                      .dwattr $C$DW$58, DW_AT_bit_offset(0x09)
     858                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
     859                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     860                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     861              
     862              $C$DW$59        .dwtag  DW_TAG_member
     863                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     864                      .dwattr $C$DW$59, DW_AT_name("GPIOA7")
     865                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_GPIOA7")
     866                      .dwattr $C$DW$59, DW_AT_bit_offset(0x08)
     867                      .dwattr $C$DW$59, DW_AT_bit_size(0x01)
     868                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     869                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     870              
     871              $C$DW$60        .dwtag  DW_TAG_member
     872                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     873                      .dwattr $C$DW$60, DW_AT_name("GPIOA8")
     874                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_GPIOA8")
     875                      .dwattr $C$DW$60, DW_AT_bit_offset(0x07)
     876                      .dwattr $C$DW$60, DW_AT_bit_size(0x01)
     877                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     878                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     879              
     880              $C$DW$61        .dwtag  DW_TAG_member
     881                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     882                      .dwattr $C$DW$61, DW_AT_name("GPIOA9")
     883                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_GPIOA9")
     884                      .dwattr $C$DW$61, DW_AT_bit_offset(0x06)
     885                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
     886                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     887                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     888              
     889              $C$DW$62        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Dac.asm          PAGE   18

     890                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     891                      .dwattr $C$DW$62, DW_AT_name("GPIOA10")
     892                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_GPIOA10")
     893                      .dwattr $C$DW$62, DW_AT_bit_offset(0x05)
     894                      .dwattr $C$DW$62, DW_AT_bit_size(0x01)
     895                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     896                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     897              
     898              $C$DW$63        .dwtag  DW_TAG_member
     899                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     900                      .dwattr $C$DW$63, DW_AT_name("GPIOA11")
     901                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_GPIOA11")
     902                      .dwattr $C$DW$63, DW_AT_bit_offset(0x04)
     903                      .dwattr $C$DW$63, DW_AT_bit_size(0x01)
     904                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     905                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     906              
     907              $C$DW$64        .dwtag  DW_TAG_member
     908                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     909                      .dwattr $C$DW$64, DW_AT_name("GPIOA12")
     910                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_GPIOA12")
     911                      .dwattr $C$DW$64, DW_AT_bit_offset(0x03)
     912                      .dwattr $C$DW$64, DW_AT_bit_size(0x01)
     913                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     914                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     915              
     916              $C$DW$65        .dwtag  DW_TAG_member
     917                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     918                      .dwattr $C$DW$65, DW_AT_name("GPIOA13")
     919                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_GPIOA13")
     920                      .dwattr $C$DW$65, DW_AT_bit_offset(0x02)
     921                      .dwattr $C$DW$65, DW_AT_bit_size(0x01)
     922                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     923                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     924              
     925              $C$DW$66        .dwtag  DW_TAG_member
     926                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     927                      .dwattr $C$DW$66, DW_AT_name("GPIOA14")
     928                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_GPIOA14")
     929                      .dwattr $C$DW$66, DW_AT_bit_offset(0x01)
     930                      .dwattr $C$DW$66, DW_AT_bit_size(0x01)
     931                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     932                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     933              
     934              $C$DW$67        .dwtag  DW_TAG_member
     935                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     936                      .dwattr $C$DW$67, DW_AT_name("GPIOA15")
     937                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_GPIOA15")
     938                      .dwattr $C$DW$67, DW_AT_bit_offset(0x00)
     939                      .dwattr $C$DW$67, DW_AT_bit_size(0x01)
     940                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     941                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     942              
     943                      .dwendtag $C$DW$T$20
     944              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Dac.asm          PAGE   19

     945              
     946              $C$DW$T$21      .dwtag  DW_TAG_union_type
     947                      .dwattr $C$DW$T$21, DW_AT_name("GPACLEAR_REG")
     948                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     949              $C$DW$68        .dwtag  DW_TAG_member
     950                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     951                      .dwattr $C$DW$68, DW_AT_name("all")
     952                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_all")
     953                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     954                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     955              
     956              $C$DW$69        .dwtag  DW_TAG_member
     957                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$20)
     958                      .dwattr $C$DW$69, DW_AT_name("bit")
     959                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_bit")
     960                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     961                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     962              
     963                      .dwendtag $C$DW$T$21
     964              
     965              
     966              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     967                      .dwattr $C$DW$T$22, DW_AT_name("GPADAT_BITS")
     968                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     969              $C$DW$70        .dwtag  DW_TAG_member
     970                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     971                      .dwattr $C$DW$70, DW_AT_name("GPIOA0")
     972                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_GPIOA0")
     973                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0f)
     974                      .dwattr $C$DW$70, DW_AT_bit_size(0x01)
     975                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     976                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     977              
     978              $C$DW$71        .dwtag  DW_TAG_member
     979                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     980                      .dwattr $C$DW$71, DW_AT_name("GPIOA1")
     981                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_GPIOA1")
     982                      .dwattr $C$DW$71, DW_AT_bit_offset(0x0e)
     983                      .dwattr $C$DW$71, DW_AT_bit_size(0x01)
     984                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     985                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     986              
     987              $C$DW$72        .dwtag  DW_TAG_member
     988                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     989                      .dwattr $C$DW$72, DW_AT_name("GPIOA2")
     990                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_GPIOA2")
     991                      .dwattr $C$DW$72, DW_AT_bit_offset(0x0d)
     992                      .dwattr $C$DW$72, DW_AT_bit_size(0x01)
     993                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     994                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     995              
     996              $C$DW$73        .dwtag  DW_TAG_member
     997                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     998                      .dwattr $C$DW$73, DW_AT_name("GPIOA3")
     999                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_GPIOA3")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Dac.asm          PAGE   20

    1000                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0c)
    1001                      .dwattr $C$DW$73, DW_AT_bit_size(0x01)
    1002                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1003                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1004              
    1005              $C$DW$74        .dwtag  DW_TAG_member
    1006                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1007                      .dwattr $C$DW$74, DW_AT_name("GPIOA4")
    1008                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_GPIOA4")
    1009                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0b)
    1010                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
    1011                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1012                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1013              
    1014              $C$DW$75        .dwtag  DW_TAG_member
    1015                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1016                      .dwattr $C$DW$75, DW_AT_name("GPIOA5")
    1017                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_GPIOA5")
    1018                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0a)
    1019                      .dwattr $C$DW$75, DW_AT_bit_size(0x01)
    1020                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1021                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1022              
    1023              $C$DW$76        .dwtag  DW_TAG_member
    1024                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1025                      .dwattr $C$DW$76, DW_AT_name("GPIOA6")
    1026                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_GPIOA6")
    1027                      .dwattr $C$DW$76, DW_AT_bit_offset(0x09)
    1028                      .dwattr $C$DW$76, DW_AT_bit_size(0x01)
    1029                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1030                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1031              
    1032              $C$DW$77        .dwtag  DW_TAG_member
    1033                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1034                      .dwattr $C$DW$77, DW_AT_name("GPIOA7")
    1035                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_GPIOA7")
    1036                      .dwattr $C$DW$77, DW_AT_bit_offset(0x08)
    1037                      .dwattr $C$DW$77, DW_AT_bit_size(0x01)
    1038                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1039                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1040              
    1041              $C$DW$78        .dwtag  DW_TAG_member
    1042                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1043                      .dwattr $C$DW$78, DW_AT_name("GPIOA8")
    1044                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_GPIOA8")
    1045                      .dwattr $C$DW$78, DW_AT_bit_offset(0x07)
    1046                      .dwattr $C$DW$78, DW_AT_bit_size(0x01)
    1047                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1048                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1049              
    1050              $C$DW$79        .dwtag  DW_TAG_member
    1051                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1052                      .dwattr $C$DW$79, DW_AT_name("GPIOA9")
    1053                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_GPIOA9")
    1054                      .dwattr $C$DW$79, DW_AT_bit_offset(0x06)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Dac.asm          PAGE   21

    1055                      .dwattr $C$DW$79, DW_AT_bit_size(0x01)
    1056                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1057                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1058              
    1059              $C$DW$80        .dwtag  DW_TAG_member
    1060                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1061                      .dwattr $C$DW$80, DW_AT_name("GPIOA10")
    1062                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_GPIOA10")
    1063                      .dwattr $C$DW$80, DW_AT_bit_offset(0x05)
    1064                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
    1065                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1066                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1067              
    1068              $C$DW$81        .dwtag  DW_TAG_member
    1069                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1070                      .dwattr $C$DW$81, DW_AT_name("GPIOA11")
    1071                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_GPIOA11")
    1072                      .dwattr $C$DW$81, DW_AT_bit_offset(0x04)
    1073                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1074                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1075                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1076              
    1077              $C$DW$82        .dwtag  DW_TAG_member
    1078                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1079                      .dwattr $C$DW$82, DW_AT_name("GPIOA12")
    1080                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_GPIOA12")
    1081                      .dwattr $C$DW$82, DW_AT_bit_offset(0x03)
    1082                      .dwattr $C$DW$82, DW_AT_bit_size(0x01)
    1083                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1084                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1085              
    1086              $C$DW$83        .dwtag  DW_TAG_member
    1087                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1088                      .dwattr $C$DW$83, DW_AT_name("GPIOA13")
    1089                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_GPIOA13")
    1090                      .dwattr $C$DW$83, DW_AT_bit_offset(0x02)
    1091                      .dwattr $C$DW$83, DW_AT_bit_size(0x01)
    1092                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1093                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1094              
    1095              $C$DW$84        .dwtag  DW_TAG_member
    1096                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1097                      .dwattr $C$DW$84, DW_AT_name("GPIOA14")
    1098                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_GPIOA14")
    1099                      .dwattr $C$DW$84, DW_AT_bit_offset(0x01)
    1100                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
    1101                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1102                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1103              
    1104              $C$DW$85        .dwtag  DW_TAG_member
    1105                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1106                      .dwattr $C$DW$85, DW_AT_name("GPIOA15")
    1107                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_GPIOA15")
    1108                      .dwattr $C$DW$85, DW_AT_bit_offset(0x00)
    1109                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Dac.asm          PAGE   22

    1110                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1111                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1112              
    1113                      .dwendtag $C$DW$T$22
    1114              
    1115              
    1116              $C$DW$T$23      .dwtag  DW_TAG_union_type
    1117                      .dwattr $C$DW$T$23, DW_AT_name("GPADAT_REG")
    1118                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1119              $C$DW$86        .dwtag  DW_TAG_member
    1120                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1121                      .dwattr $C$DW$86, DW_AT_name("all")
    1122                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_all")
    1123                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1124                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1125              
    1126              $C$DW$87        .dwtag  DW_TAG_member
    1127                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$22)
    1128                      .dwattr $C$DW$87, DW_AT_name("bit")
    1129                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_bit")
    1130                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1131                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1132              
    1133                      .dwendtag $C$DW$T$23
    1134              
    1135              
    1136              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1137                      .dwattr $C$DW$T$24, DW_AT_name("GPASET_BITS")
    1138                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1139              $C$DW$88        .dwtag  DW_TAG_member
    1140                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1141                      .dwattr $C$DW$88, DW_AT_name("GPIOA0")
    1142                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_GPIOA0")
    1143                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0f)
    1144                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1145                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1146                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1147              
    1148              $C$DW$89        .dwtag  DW_TAG_member
    1149                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1150                      .dwattr $C$DW$89, DW_AT_name("GPIOA1")
    1151                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_GPIOA1")
    1152                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0e)
    1153                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    1154                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1155                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1156              
    1157              $C$DW$90        .dwtag  DW_TAG_member
    1158                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1159                      .dwattr $C$DW$90, DW_AT_name("GPIOA2")
    1160                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPIOA2")
    1161                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0d)
    1162                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1163                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1164                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Dac.asm          PAGE   23

    1165              
    1166              $C$DW$91        .dwtag  DW_TAG_member
    1167                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1168                      .dwattr $C$DW$91, DW_AT_name("GPIOA3")
    1169                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_GPIOA3")
    1170                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0c)
    1171                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1172                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1173                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1174              
    1175              $C$DW$92        .dwtag  DW_TAG_member
    1176                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1177                      .dwattr $C$DW$92, DW_AT_name("GPIOA4")
    1178                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_GPIOA4")
    1179                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0b)
    1180                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1181                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1182                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1183              
    1184              $C$DW$93        .dwtag  DW_TAG_member
    1185                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1186                      .dwattr $C$DW$93, DW_AT_name("GPIOA5")
    1187                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_GPIOA5")
    1188                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0a)
    1189                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1190                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1191                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1192              
    1193              $C$DW$94        .dwtag  DW_TAG_member
    1194                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1195                      .dwattr $C$DW$94, DW_AT_name("GPIOA6")
    1196                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPIOA6")
    1197                      .dwattr $C$DW$94, DW_AT_bit_offset(0x09)
    1198                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1199                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1200                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1201              
    1202              $C$DW$95        .dwtag  DW_TAG_member
    1203                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1204                      .dwattr $C$DW$95, DW_AT_name("GPIOA7")
    1205                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_GPIOA7")
    1206                      .dwattr $C$DW$95, DW_AT_bit_offset(0x08)
    1207                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1208                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1209                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1210              
    1211              $C$DW$96        .dwtag  DW_TAG_member
    1212                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1213                      .dwattr $C$DW$96, DW_AT_name("GPIOA8")
    1214                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_GPIOA8")
    1215                      .dwattr $C$DW$96, DW_AT_bit_offset(0x07)
    1216                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1217                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1218                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1219              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Dac.asm          PAGE   24

    1220              $C$DW$97        .dwtag  DW_TAG_member
    1221                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1222                      .dwattr $C$DW$97, DW_AT_name("GPIOA9")
    1223                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_GPIOA9")
    1224                      .dwattr $C$DW$97, DW_AT_bit_offset(0x06)
    1225                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1226                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1227                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1228              
    1229              $C$DW$98        .dwtag  DW_TAG_member
    1230                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1231                      .dwattr $C$DW$98, DW_AT_name("GPIOA10")
    1232                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_GPIOA10")
    1233                      .dwattr $C$DW$98, DW_AT_bit_offset(0x05)
    1234                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1235                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1236                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1237              
    1238              $C$DW$99        .dwtag  DW_TAG_member
    1239                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1240                      .dwattr $C$DW$99, DW_AT_name("GPIOA11")
    1241                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_GPIOA11")
    1242                      .dwattr $C$DW$99, DW_AT_bit_offset(0x04)
    1243                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1244                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1245                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1246              
    1247              $C$DW$100       .dwtag  DW_TAG_member
    1248                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1249                      .dwattr $C$DW$100, DW_AT_name("GPIOA12")
    1250                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_GPIOA12")
    1251                      .dwattr $C$DW$100, DW_AT_bit_offset(0x03)
    1252                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1253                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1254                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1255              
    1256              $C$DW$101       .dwtag  DW_TAG_member
    1257                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1258                      .dwattr $C$DW$101, DW_AT_name("GPIOA13")
    1259                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_GPIOA13")
    1260                      .dwattr $C$DW$101, DW_AT_bit_offset(0x02)
    1261                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1262                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1263                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1264              
    1265              $C$DW$102       .dwtag  DW_TAG_member
    1266                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1267                      .dwattr $C$DW$102, DW_AT_name("GPIOA14")
    1268                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_GPIOA14")
    1269                      .dwattr $C$DW$102, DW_AT_bit_offset(0x01)
    1270                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1271                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1272                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1273              
    1274              $C$DW$103       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Dac.asm          PAGE   25

    1275                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1276                      .dwattr $C$DW$103, DW_AT_name("GPIOA15")
    1277                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_GPIOA15")
    1278                      .dwattr $C$DW$103, DW_AT_bit_offset(0x00)
    1279                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1280                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1281                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1282              
    1283                      .dwendtag $C$DW$T$24
    1284              
    1285              
    1286              $C$DW$T$25      .dwtag  DW_TAG_union_type
    1287                      .dwattr $C$DW$T$25, DW_AT_name("GPASET_REG")
    1288                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1289              $C$DW$104       .dwtag  DW_TAG_member
    1290                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1291                      .dwattr $C$DW$104, DW_AT_name("all")
    1292                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_all")
    1293                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1294                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1295              
    1296              $C$DW$105       .dwtag  DW_TAG_member
    1297                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$24)
    1298                      .dwattr $C$DW$105, DW_AT_name("bit")
    1299                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_bit")
    1300                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1301                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1302              
    1303                      .dwendtag $C$DW$T$25
    1304              
    1305              
    1306              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1307                      .dwattr $C$DW$T$26, DW_AT_name("GPATOGGLE_BITS")
    1308                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1309              $C$DW$106       .dwtag  DW_TAG_member
    1310                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1311                      .dwattr $C$DW$106, DW_AT_name("GPIOA0")
    1312                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_GPIOA0")
    1313                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0f)
    1314                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1315                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1316                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1317              
    1318              $C$DW$107       .dwtag  DW_TAG_member
    1319                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1320                      .dwattr $C$DW$107, DW_AT_name("GPIOA1")
    1321                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_GPIOA1")
    1322                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0e)
    1323                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1324                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1325                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1326              
    1327              $C$DW$108       .dwtag  DW_TAG_member
    1328                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1329                      .dwattr $C$DW$108, DW_AT_name("GPIOA2")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Dac.asm          PAGE   26

    1330                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIOA2")
    1331                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0d)
    1332                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1333                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1334                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1335              
    1336              $C$DW$109       .dwtag  DW_TAG_member
    1337                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1338                      .dwattr $C$DW$109, DW_AT_name("GPIOA3")
    1339                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIOA3")
    1340                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0c)
    1341                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1342                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1343                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1344              
    1345              $C$DW$110       .dwtag  DW_TAG_member
    1346                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1347                      .dwattr $C$DW$110, DW_AT_name("GPIOA4")
    1348                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIOA4")
    1349                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0b)
    1350                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1351                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1352                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1353              
    1354              $C$DW$111       .dwtag  DW_TAG_member
    1355                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1356                      .dwattr $C$DW$111, DW_AT_name("GPIOA5")
    1357                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIOA5")
    1358                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0a)
    1359                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1360                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1361                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1362              
    1363              $C$DW$112       .dwtag  DW_TAG_member
    1364                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1365                      .dwattr $C$DW$112, DW_AT_name("GPIOA6")
    1366                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GPIOA6")
    1367                      .dwattr $C$DW$112, DW_AT_bit_offset(0x09)
    1368                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1369                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1370                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1371              
    1372              $C$DW$113       .dwtag  DW_TAG_member
    1373                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1374                      .dwattr $C$DW$113, DW_AT_name("GPIOA7")
    1375                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPIOA7")
    1376                      .dwattr $C$DW$113, DW_AT_bit_offset(0x08)
    1377                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1378                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1379                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1380              
    1381              $C$DW$114       .dwtag  DW_TAG_member
    1382                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1383                      .dwattr $C$DW$114, DW_AT_name("GPIOA8")
    1384                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIOA8")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Dac.asm          PAGE   27

    1385                      .dwattr $C$DW$114, DW_AT_bit_offset(0x07)
    1386                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1387                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1388                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1389              
    1390              $C$DW$115       .dwtag  DW_TAG_member
    1391                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1392                      .dwattr $C$DW$115, DW_AT_name("GPIOA9")
    1393                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_GPIOA9")
    1394                      .dwattr $C$DW$115, DW_AT_bit_offset(0x06)
    1395                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1396                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1397                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1398              
    1399              $C$DW$116       .dwtag  DW_TAG_member
    1400                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1401                      .dwattr $C$DW$116, DW_AT_name("GPIOA10")
    1402                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_GPIOA10")
    1403                      .dwattr $C$DW$116, DW_AT_bit_offset(0x05)
    1404                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1405                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1406                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1407              
    1408              $C$DW$117       .dwtag  DW_TAG_member
    1409                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1410                      .dwattr $C$DW$117, DW_AT_name("GPIOA11")
    1411                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_GPIOA11")
    1412                      .dwattr $C$DW$117, DW_AT_bit_offset(0x04)
    1413                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1414                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1415                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1416              
    1417              $C$DW$118       .dwtag  DW_TAG_member
    1418                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1419                      .dwattr $C$DW$118, DW_AT_name("GPIOA12")
    1420                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPIOA12")
    1421                      .dwattr $C$DW$118, DW_AT_bit_offset(0x03)
    1422                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1423                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1424                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1425              
    1426              $C$DW$119       .dwtag  DW_TAG_member
    1427                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1428                      .dwattr $C$DW$119, DW_AT_name("GPIOA13")
    1429                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_GPIOA13")
    1430                      .dwattr $C$DW$119, DW_AT_bit_offset(0x02)
    1431                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1432                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1433                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1434              
    1435              $C$DW$120       .dwtag  DW_TAG_member
    1436                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1437                      .dwattr $C$DW$120, DW_AT_name("GPIOA14")
    1438                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPIOA14")
    1439                      .dwattr $C$DW$120, DW_AT_bit_offset(0x01)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Dac.asm          PAGE   28

    1440                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1441                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1442                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1443              
    1444              $C$DW$121       .dwtag  DW_TAG_member
    1445                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1446                      .dwattr $C$DW$121, DW_AT_name("GPIOA15")
    1447                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_GPIOA15")
    1448                      .dwattr $C$DW$121, DW_AT_bit_offset(0x00)
    1449                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1450                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1451                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1452              
    1453                      .dwendtag $C$DW$T$26
    1454              
    1455              
    1456              $C$DW$T$27      .dwtag  DW_TAG_union_type
    1457                      .dwattr $C$DW$T$27, DW_AT_name("GPATOGGLE_REG")
    1458                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1459              $C$DW$122       .dwtag  DW_TAG_member
    1460                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1461                      .dwattr $C$DW$122, DW_AT_name("all")
    1462                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_all")
    1463                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1464                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1465              
    1466              $C$DW$123       .dwtag  DW_TAG_member
    1467                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$26)
    1468                      .dwattr $C$DW$123, DW_AT_name("bit")
    1469                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_bit")
    1470                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1471                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1472              
    1473                      .dwendtag $C$DW$T$27
    1474              
    1475              
    1476              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1477                      .dwattr $C$DW$T$28, DW_AT_name("GPBCLEAR_BITS")
    1478                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    1479              $C$DW$124       .dwtag  DW_TAG_member
    1480                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1481                      .dwattr $C$DW$124, DW_AT_name("GPIOB0")
    1482                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIOB0")
    1483                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0f)
    1484                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1485                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1486                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1487              
    1488              $C$DW$125       .dwtag  DW_TAG_member
    1489                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1490                      .dwattr $C$DW$125, DW_AT_name("GPIOB1")
    1491                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_GPIOB1")
    1492                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0e)
    1493                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1494                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Dac.asm          PAGE   29

    1495                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1496              
    1497              $C$DW$126       .dwtag  DW_TAG_member
    1498                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1499                      .dwattr $C$DW$126, DW_AT_name("GPIOB2")
    1500                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_GPIOB2")
    1501                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0d)
    1502                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1503                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1504                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1505              
    1506              $C$DW$127       .dwtag  DW_TAG_member
    1507                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1508                      .dwattr $C$DW$127, DW_AT_name("GPIOB3")
    1509                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIOB3")
    1510                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0c)
    1511                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1512                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1513                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1514              
    1515              $C$DW$128       .dwtag  DW_TAG_member
    1516                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1517                      .dwattr $C$DW$128, DW_AT_name("GPIOB4")
    1518                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIOB4")
    1519                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0b)
    1520                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1521                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1522                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1523              
    1524              $C$DW$129       .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1526                      .dwattr $C$DW$129, DW_AT_name("GPIOB5")
    1527                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPIOB5")
    1528                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0a)
    1529                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1530                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1531                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1532              
    1533              $C$DW$130       .dwtag  DW_TAG_member
    1534                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1535                      .dwattr $C$DW$130, DW_AT_name("GPIOB6")
    1536                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPIOB6")
    1537                      .dwattr $C$DW$130, DW_AT_bit_offset(0x09)
    1538                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1539                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1540                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1541              
    1542              $C$DW$131       .dwtag  DW_TAG_member
    1543                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1544                      .dwattr $C$DW$131, DW_AT_name("GPIOB7")
    1545                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIOB7")
    1546                      .dwattr $C$DW$131, DW_AT_bit_offset(0x08)
    1547                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1548                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1549                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Dac.asm          PAGE   30

    1550              
    1551              $C$DW$132       .dwtag  DW_TAG_member
    1552                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1553                      .dwattr $C$DW$132, DW_AT_name("GPIOB8")
    1554                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIOB8")
    1555                      .dwattr $C$DW$132, DW_AT_bit_offset(0x07)
    1556                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1557                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1558                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1559              
    1560              $C$DW$133       .dwtag  DW_TAG_member
    1561                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1562                      .dwattr $C$DW$133, DW_AT_name("GPIOB9")
    1563                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIOB9")
    1564                      .dwattr $C$DW$133, DW_AT_bit_offset(0x06)
    1565                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1566                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1567                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1568              
    1569              $C$DW$134       .dwtag  DW_TAG_member
    1570                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1571                      .dwattr $C$DW$134, DW_AT_name("GPIOB10")
    1572                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIOB10")
    1573                      .dwattr $C$DW$134, DW_AT_bit_offset(0x05)
    1574                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1575                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1576                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1577              
    1578              $C$DW$135       .dwtag  DW_TAG_member
    1579                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1580                      .dwattr $C$DW$135, DW_AT_name("GPIOB11")
    1581                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIOB11")
    1582                      .dwattr $C$DW$135, DW_AT_bit_offset(0x04)
    1583                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1584                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1585                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1586              
    1587              $C$DW$136       .dwtag  DW_TAG_member
    1588                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1589                      .dwattr $C$DW$136, DW_AT_name("GPIOB12")
    1590                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIOB12")
    1591                      .dwattr $C$DW$136, DW_AT_bit_offset(0x03)
    1592                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1593                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1594                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1595              
    1596              $C$DW$137       .dwtag  DW_TAG_member
    1597                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1598                      .dwattr $C$DW$137, DW_AT_name("GPIOB13")
    1599                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIOB13")
    1600                      .dwattr $C$DW$137, DW_AT_bit_offset(0x02)
    1601                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1602                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1603                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1604              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Dac.asm          PAGE   31

    1605              $C$DW$138       .dwtag  DW_TAG_member
    1606                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1607                      .dwattr $C$DW$138, DW_AT_name("GPIOB14")
    1608                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIOB14")
    1609                      .dwattr $C$DW$138, DW_AT_bit_offset(0x01)
    1610                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    1611                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1612                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1613              
    1614              $C$DW$139       .dwtag  DW_TAG_member
    1615                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1616                      .dwattr $C$DW$139, DW_AT_name("GPIOB15")
    1617                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIOB15")
    1618                      .dwattr $C$DW$139, DW_AT_bit_offset(0x00)
    1619                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1620                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1621                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1622              
    1623                      .dwendtag $C$DW$T$28
    1624              
    1625              
    1626              $C$DW$T$29      .dwtag  DW_TAG_union_type
    1627                      .dwattr $C$DW$T$29, DW_AT_name("GPBCLEAR_REG")
    1628                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1629              $C$DW$140       .dwtag  DW_TAG_member
    1630                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1631                      .dwattr $C$DW$140, DW_AT_name("all")
    1632                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_all")
    1633                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1634                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1635              
    1636              $C$DW$141       .dwtag  DW_TAG_member
    1637                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$28)
    1638                      .dwattr $C$DW$141, DW_AT_name("bit")
    1639                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_bit")
    1640                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1641                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1642              
    1643                      .dwendtag $C$DW$T$29
    1644              
    1645              
    1646              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1647                      .dwattr $C$DW$T$30, DW_AT_name("GPBDAT_BITS")
    1648                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    1649              $C$DW$142       .dwtag  DW_TAG_member
    1650                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1651                      .dwattr $C$DW$142, DW_AT_name("GPIOB0")
    1652                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPIOB0")
    1653                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0f)
    1654                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    1655                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1656                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1657              
    1658              $C$DW$143       .dwtag  DW_TAG_member
    1659                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Dac.asm          PAGE   32

    1660                      .dwattr $C$DW$143, DW_AT_name("GPIOB1")
    1661                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPIOB1")
    1662                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0e)
    1663                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    1664                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1665                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1666              
    1667              $C$DW$144       .dwtag  DW_TAG_member
    1668                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1669                      .dwattr $C$DW$144, DW_AT_name("GPIOB2")
    1670                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIOB2")
    1671                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0d)
    1672                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    1673                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1674                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1675              
    1676              $C$DW$145       .dwtag  DW_TAG_member
    1677                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1678                      .dwattr $C$DW$145, DW_AT_name("GPIOB3")
    1679                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIOB3")
    1680                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0c)
    1681                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    1682                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1683                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1684              
    1685              $C$DW$146       .dwtag  DW_TAG_member
    1686                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1687                      .dwattr $C$DW$146, DW_AT_name("GPIOB4")
    1688                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_GPIOB4")
    1689                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0b)
    1690                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    1691                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1692                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1693              
    1694              $C$DW$147       .dwtag  DW_TAG_member
    1695                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1696                      .dwattr $C$DW$147, DW_AT_name("GPIOB5")
    1697                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_GPIOB5")
    1698                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0a)
    1699                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    1700                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1701                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1702              
    1703              $C$DW$148       .dwtag  DW_TAG_member
    1704                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1705                      .dwattr $C$DW$148, DW_AT_name("GPIOB6")
    1706                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPIOB6")
    1707                      .dwattr $C$DW$148, DW_AT_bit_offset(0x09)
    1708                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    1709                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1710                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1711              
    1712              $C$DW$149       .dwtag  DW_TAG_member
    1713                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1714                      .dwattr $C$DW$149, DW_AT_name("GPIOB7")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Dac.asm          PAGE   33

    1715                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_GPIOB7")
    1716                      .dwattr $C$DW$149, DW_AT_bit_offset(0x08)
    1717                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    1718                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1719                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1720              
    1721              $C$DW$150       .dwtag  DW_TAG_member
    1722                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1723                      .dwattr $C$DW$150, DW_AT_name("GPIOB8")
    1724                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPIOB8")
    1725                      .dwattr $C$DW$150, DW_AT_bit_offset(0x07)
    1726                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    1727                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1728                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1729              
    1730              $C$DW$151       .dwtag  DW_TAG_member
    1731                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1732                      .dwattr $C$DW$151, DW_AT_name("GPIOB9")
    1733                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_GPIOB9")
    1734                      .dwattr $C$DW$151, DW_AT_bit_offset(0x06)
    1735                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    1736                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1737                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1738              
    1739              $C$DW$152       .dwtag  DW_TAG_member
    1740                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1741                      .dwattr $C$DW$152, DW_AT_name("GPIOB10")
    1742                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_GPIOB10")
    1743                      .dwattr $C$DW$152, DW_AT_bit_offset(0x05)
    1744                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    1745                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1746                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1747              
    1748              $C$DW$153       .dwtag  DW_TAG_member
    1749                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1750                      .dwattr $C$DW$153, DW_AT_name("GPIOB11")
    1751                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_GPIOB11")
    1752                      .dwattr $C$DW$153, DW_AT_bit_offset(0x04)
    1753                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    1754                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1755                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1756              
    1757              $C$DW$154       .dwtag  DW_TAG_member
    1758                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1759                      .dwattr $C$DW$154, DW_AT_name("GPIOB12")
    1760                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_GPIOB12")
    1761                      .dwattr $C$DW$154, DW_AT_bit_offset(0x03)
    1762                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    1763                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1764                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1765              
    1766              $C$DW$155       .dwtag  DW_TAG_member
    1767                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1768                      .dwattr $C$DW$155, DW_AT_name("GPIOB13")
    1769                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_GPIOB13")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Dac.asm          PAGE   34

    1770                      .dwattr $C$DW$155, DW_AT_bit_offset(0x02)
    1771                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    1772                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1773                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1774              
    1775              $C$DW$156       .dwtag  DW_TAG_member
    1776                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1777                      .dwattr $C$DW$156, DW_AT_name("GPIOB14")
    1778                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_GPIOB14")
    1779                      .dwattr $C$DW$156, DW_AT_bit_offset(0x01)
    1780                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    1781                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1782                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1783              
    1784              $C$DW$157       .dwtag  DW_TAG_member
    1785                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1786                      .dwattr $C$DW$157, DW_AT_name("GPIOB15")
    1787                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_GPIOB15")
    1788                      .dwattr $C$DW$157, DW_AT_bit_offset(0x00)
    1789                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    1790                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1791                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1792              
    1793                      .dwendtag $C$DW$T$30
    1794              
    1795              
    1796              $C$DW$T$31      .dwtag  DW_TAG_union_type
    1797                      .dwattr $C$DW$T$31, DW_AT_name("GPBDAT_REG")
    1798                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1799              $C$DW$158       .dwtag  DW_TAG_member
    1800                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1801                      .dwattr $C$DW$158, DW_AT_name("all")
    1802                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_all")
    1803                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1804                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1805              
    1806              $C$DW$159       .dwtag  DW_TAG_member
    1807                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$30)
    1808                      .dwattr $C$DW$159, DW_AT_name("bit")
    1809                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_bit")
    1810                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1811                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1812              
    1813                      .dwendtag $C$DW$T$31
    1814              
    1815              
    1816              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1817                      .dwattr $C$DW$T$32, DW_AT_name("GPBSET_BITS")
    1818                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1819              $C$DW$160       .dwtag  DW_TAG_member
    1820                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1821                      .dwattr $C$DW$160, DW_AT_name("GPIOB0")
    1822                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_GPIOB0")
    1823                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0f)
    1824                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Dac.asm          PAGE   35

    1825                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1826                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1827              
    1828              $C$DW$161       .dwtag  DW_TAG_member
    1829                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1830                      .dwattr $C$DW$161, DW_AT_name("GPIOB1")
    1831                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_GPIOB1")
    1832                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0e)
    1833                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    1834                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1835                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1836              
    1837              $C$DW$162       .dwtag  DW_TAG_member
    1838                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1839                      .dwattr $C$DW$162, DW_AT_name("GPIOB2")
    1840                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_GPIOB2")
    1841                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0d)
    1842                      .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    1843                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1844                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1845              
    1846              $C$DW$163       .dwtag  DW_TAG_member
    1847                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1848                      .dwattr $C$DW$163, DW_AT_name("GPIOB3")
    1849                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_GPIOB3")
    1850                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0c)
    1851                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    1852                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1853                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1854              
    1855              $C$DW$164       .dwtag  DW_TAG_member
    1856                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1857                      .dwattr $C$DW$164, DW_AT_name("GPIOB4")
    1858                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_GPIOB4")
    1859                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0b)
    1860                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    1861                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1862                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1863              
    1864              $C$DW$165       .dwtag  DW_TAG_member
    1865                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1866                      .dwattr $C$DW$165, DW_AT_name("GPIOB5")
    1867                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_GPIOB5")
    1868                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0a)
    1869                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    1870                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1871                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1872              
    1873              $C$DW$166       .dwtag  DW_TAG_member
    1874                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1875                      .dwattr $C$DW$166, DW_AT_name("GPIOB6")
    1876                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_GPIOB6")
    1877                      .dwattr $C$DW$166, DW_AT_bit_offset(0x09)
    1878                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    1879                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Dac.asm          PAGE   36

    1880                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1881              
    1882              $C$DW$167       .dwtag  DW_TAG_member
    1883                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1884                      .dwattr $C$DW$167, DW_AT_name("GPIOB7")
    1885                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_GPIOB7")
    1886                      .dwattr $C$DW$167, DW_AT_bit_offset(0x08)
    1887                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    1888                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1889                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1890              
    1891              $C$DW$168       .dwtag  DW_TAG_member
    1892                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1893                      .dwattr $C$DW$168, DW_AT_name("GPIOB8")
    1894                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_GPIOB8")
    1895                      .dwattr $C$DW$168, DW_AT_bit_offset(0x07)
    1896                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    1897                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1898                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1899              
    1900              $C$DW$169       .dwtag  DW_TAG_member
    1901                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1902                      .dwattr $C$DW$169, DW_AT_name("GPIOB9")
    1903                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_GPIOB9")
    1904                      .dwattr $C$DW$169, DW_AT_bit_offset(0x06)
    1905                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    1906                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1907                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1908              
    1909              $C$DW$170       .dwtag  DW_TAG_member
    1910                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1911                      .dwattr $C$DW$170, DW_AT_name("GPIOB10")
    1912                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_GPIOB10")
    1913                      .dwattr $C$DW$170, DW_AT_bit_offset(0x05)
    1914                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    1915                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1916                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1917              
    1918              $C$DW$171       .dwtag  DW_TAG_member
    1919                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1920                      .dwattr $C$DW$171, DW_AT_name("GPIOB11")
    1921                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_GPIOB11")
    1922                      .dwattr $C$DW$171, DW_AT_bit_offset(0x04)
    1923                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    1924                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1925                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1926              
    1927              $C$DW$172       .dwtag  DW_TAG_member
    1928                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1929                      .dwattr $C$DW$172, DW_AT_name("GPIOB12")
    1930                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_GPIOB12")
    1931                      .dwattr $C$DW$172, DW_AT_bit_offset(0x03)
    1932                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    1933                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1934                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Dac.asm          PAGE   37

    1935              
    1936              $C$DW$173       .dwtag  DW_TAG_member
    1937                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1938                      .dwattr $C$DW$173, DW_AT_name("GPIOB13")
    1939                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_GPIOB13")
    1940                      .dwattr $C$DW$173, DW_AT_bit_offset(0x02)
    1941                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    1942                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1943                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1944              
    1945              $C$DW$174       .dwtag  DW_TAG_member
    1946                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1947                      .dwattr $C$DW$174, DW_AT_name("GPIOB14")
    1948                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_GPIOB14")
    1949                      .dwattr $C$DW$174, DW_AT_bit_offset(0x01)
    1950                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    1951                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1952                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1953              
    1954              $C$DW$175       .dwtag  DW_TAG_member
    1955                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1956                      .dwattr $C$DW$175, DW_AT_name("GPIOB15")
    1957                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_GPIOB15")
    1958                      .dwattr $C$DW$175, DW_AT_bit_offset(0x00)
    1959                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    1960                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1961                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1962              
    1963                      .dwendtag $C$DW$T$32
    1964              
    1965              
    1966              $C$DW$T$33      .dwtag  DW_TAG_union_type
    1967                      .dwattr $C$DW$T$33, DW_AT_name("GPBSET_REG")
    1968                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1969              $C$DW$176       .dwtag  DW_TAG_member
    1970                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1971                      .dwattr $C$DW$176, DW_AT_name("all")
    1972                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_all")
    1973                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1974                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1975              
    1976              $C$DW$177       .dwtag  DW_TAG_member
    1977                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$32)
    1978                      .dwattr $C$DW$177, DW_AT_name("bit")
    1979                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_bit")
    1980                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1981                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1982              
    1983                      .dwendtag $C$DW$T$33
    1984              
    1985              
    1986              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1987                      .dwattr $C$DW$T$34, DW_AT_name("GPBTOGGLE_BITS")
    1988                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1989              $C$DW$178       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Dac.asm          PAGE   38

    1990                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1991                      .dwattr $C$DW$178, DW_AT_name("GPIOB0")
    1992                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_GPIOB0")
    1993                      .dwattr $C$DW$178, DW_AT_bit_offset(0x0f)
    1994                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    1995                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1996                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1997              
    1998              $C$DW$179       .dwtag  DW_TAG_member
    1999                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2000                      .dwattr $C$DW$179, DW_AT_name("GPIOB1")
    2001                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_GPIOB1")
    2002                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0e)
    2003                      .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    2004                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2005                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2006              
    2007              $C$DW$180       .dwtag  DW_TAG_member
    2008                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2009                      .dwattr $C$DW$180, DW_AT_name("GPIOB2")
    2010                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_GPIOB2")
    2011                      .dwattr $C$DW$180, DW_AT_bit_offset(0x0d)
    2012                      .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    2013                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2014                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2015              
    2016              $C$DW$181       .dwtag  DW_TAG_member
    2017                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2018                      .dwattr $C$DW$181, DW_AT_name("GPIOB3")
    2019                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_GPIOB3")
    2020                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0c)
    2021                      .dwattr $C$DW$181, DW_AT_bit_size(0x01)
    2022                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2023                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2024              
    2025              $C$DW$182       .dwtag  DW_TAG_member
    2026                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2027                      .dwattr $C$DW$182, DW_AT_name("GPIOB4")
    2028                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_GPIOB4")
    2029                      .dwattr $C$DW$182, DW_AT_bit_offset(0x0b)
    2030                      .dwattr $C$DW$182, DW_AT_bit_size(0x01)
    2031                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2032                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2033              
    2034              $C$DW$183       .dwtag  DW_TAG_member
    2035                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2036                      .dwattr $C$DW$183, DW_AT_name("GPIOB5")
    2037                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_GPIOB5")
    2038                      .dwattr $C$DW$183, DW_AT_bit_offset(0x0a)
    2039                      .dwattr $C$DW$183, DW_AT_bit_size(0x01)
    2040                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2041                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2042              
    2043              $C$DW$184       .dwtag  DW_TAG_member
    2044                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Dac.asm          PAGE   39

    2045                      .dwattr $C$DW$184, DW_AT_name("GPIOB6")
    2046                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_GPIOB6")
    2047                      .dwattr $C$DW$184, DW_AT_bit_offset(0x09)
    2048                      .dwattr $C$DW$184, DW_AT_bit_size(0x01)
    2049                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2050                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2051              
    2052              $C$DW$185       .dwtag  DW_TAG_member
    2053                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2054                      .dwattr $C$DW$185, DW_AT_name("GPIOB7")
    2055                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_GPIOB7")
    2056                      .dwattr $C$DW$185, DW_AT_bit_offset(0x08)
    2057                      .dwattr $C$DW$185, DW_AT_bit_size(0x01)
    2058                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2059                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2060              
    2061              $C$DW$186       .dwtag  DW_TAG_member
    2062                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2063                      .dwattr $C$DW$186, DW_AT_name("GPIOB8")
    2064                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_GPIOB8")
    2065                      .dwattr $C$DW$186, DW_AT_bit_offset(0x07)
    2066                      .dwattr $C$DW$186, DW_AT_bit_size(0x01)
    2067                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2068                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2069              
    2070              $C$DW$187       .dwtag  DW_TAG_member
    2071                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2072                      .dwattr $C$DW$187, DW_AT_name("GPIOB9")
    2073                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_GPIOB9")
    2074                      .dwattr $C$DW$187, DW_AT_bit_offset(0x06)
    2075                      .dwattr $C$DW$187, DW_AT_bit_size(0x01)
    2076                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2077                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2078              
