TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:06 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/DefaultIsr_nonBIOS.asm PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.0 *
       3              ;* Date/Time created: Tue Sep 16 13:11:04 2008                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("DefaultIsr_nonBIOS.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.0 Copyright (c) 1996-2005 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"

    4821              ;----------------------------------------------------------------------
    4822 00000226 761B          ASP
    4823                      .dwcfa  0x1d, -2
    4824                      .dwcfa  0x1c, 26, 0
    4825                      .dwcfa  0x09, 40, 26
    4826 00000227 2942          CLRC      PAGE0,OVM
    4827 00000228 5616          CLRC      AMODE
    4828                      .dwpsn  "DefaultIsr_nonBIOS.c",667,2
    4829              ;----------------------------------------------------------------------
    4830              ; 667 | asm (" ESTOP0");                                        // Emulator Hal
    4831              ;     | t instruction                                                          
    4832              ;----------------------------------------------------------------------
    4833 00000229 7625   ESTOP0
    4834                      .dwpsn  "DefaultIsr_nonBIOS.c",668,8
    4835              ;----------------------------------------------------------------------
    4836              ; 668 | while(1);                                                              
    4837              ;----------------------------------------------------------------------
    4838 0000022a       L67:    
    4839 0000022a       DW$L$_rsvd_ISR$2$B:
    4840 0000022a 6F00          B         L67,UNC               ; |668| 
    4841                      ; branch occurs ; |668| 
    4842 0000022b       DW$L$_rsvd_ISR$2$E:
    4843              
    4844              DW$203  .dwtag  DW_TAG_loop
    4845                      .dwattr DW$203, DW_AT_name("G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Defa
    4846                      .dwattr DW$203, DW_AT_begin_file("DefaultIsr_nonBIOS.c")
    4847                      .dwattr DW$203, DW_AT_begin_line(0x29c)
    4848                      .dwattr DW$203, DW_AT_end_line(0x29c)
    4849              DW$204  .dwtag  DW_TAG_loop_range
    4850                      .dwattr DW$204, DW_AT_low_pc(DW$L$_rsvd_ISR$2$B)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:06 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/DefaultIsr_nonBIOS.asm PAGE   91

    4851                      .dwattr DW$204, DW_AT_high_pc(DW$L$_rsvd_ISR$2$E)
    4852                      .dwendtag DW$203
    4853              
    4854                      .dwattr DW$202, DW_AT_end_file("DefaultIsr_nonBIOS.c")
    4855                      .dwattr DW$202, DW_AT_end_line(0x29d)
    4856                      .dwattr DW$202, DW_AT_end_column(0x01)
    4857                      .dwendentry
    4858                      .dwendtag DW$202
    4859              
    4860              ;***************************************************************
    4861              ;* UNDEFINED EXTERNAL REFERENCES                               *
    4862              ;***************************************************************
    4863                      .global _WriteCpld
    4864                      .global _ReadCpld
    4865                      .global _PieCtrlRegs
    4866              
    4867              ;***************************************************************
    4868              ;* TYPE INFORMATION                                            *
    4869              ;***************************************************************
    4870              
    4871              DW$T$30 .dwtag  DW_TAG_subroutine_type
    4872                      .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
    4873              DW$205  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    4874              DW$206  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$29)
    4875                      .dwendtag DW$T$30
    4876              
    4877              
    4878              DW$T$32 .dwtag  DW_TAG_subroutine_type
    4879                      .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
    4880              DW$T$29 .dwtag  DW_TAG_typedef, DW_AT_name("Byte"), DW_AT_type(*DW$T$6)
    4881                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
    4882              
    4883              DW$T$33 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$29)
    4884                      .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
    4885              DW$207  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    4886                      .dwendtag DW$T$33
    4887              
    4888              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$11)
    4889                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
    4890              DW$208  .dwtag  DW_TAG_far_type
    4891                      .dwattr DW$208, DW_AT_type(*DW$T$28)
    4892              DW$T$37 .dwtag  DW_TAG_volatile_type
    4893                      .dwattr DW$T$37, DW_AT_type(*DW$208)
    4894              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    4895                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4896                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
    4897              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    4898                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    4899                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    4900              
    4901              DW$T$28 .dwtag  DW_TAG_structure_type
    4902                      .dwattr DW$T$28, DW_AT_name("PIE_CTRL_REGS")
    4903                      .dwattr DW$T$28, DW_AT_byte_size(0x1a)
    4904              DW$209  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    4905                      .dwattr DW$209, DW_AT_name("PIECRTL"), DW_AT_symbol_name("_PIECRTL")
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:06 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/DefaultIsr_nonBIOS.asm PAGE   92

    4906                      .dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4907                      .dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
    4908              DW$210  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    4909                      .dwattr DW$210, DW_AT_name("PIEACK"), DW_AT_symbol_name("_PIEACK")
    4910                      .dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4911                      .dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
    4912              DW$211  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    4913                      .dwattr DW$211, DW_AT_name("PIEIER1"), DW_AT_symbol_name("_PIEIER1")
    4914                      .dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4915                      .dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
    4916              DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    4917                      .dwattr DW$212, DW_AT_name("PIEIFR1"), DW_AT_symbol_name("_PIEIFR1")
    4918                      .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4919                      .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
    4920              DW$213  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    4921                      .dwattr DW$213, DW_AT_name("PIEIER2"), DW_AT_symbol_name("_PIEIER2")
    4922                      .dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4923                      .dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
    4924              DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    4925                      .dwattr DW$214, DW_AT_name("PIEIFR2"), DW_AT_symbol_name("_PIEIFR2")
    4926                      .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4927                      .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    4928              DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    4929                      .dwattr DW$215, DW_AT_name("PIEIER3"), DW_AT_symbol_name("_PIEIER3")
    4930                      .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4931                      .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    4932              DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    4933                      .dwattr DW$216, DW_AT_name("PIEIFR3"), DW_AT_symbol_name("_PIEIFR3")
    4934                      .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4935                      .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    4936              DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    4937                      .dwattr DW$217, DW_AT_name("PIEIER4"), DW_AT_symbol_name("_PIEIER4")
    4938                      .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4939                      .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    4940              DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    4941                      .dwattr DW$218, DW_AT_name("PIEIFR4"), DW_AT_symbol_name("_PIEIFR4")
    4942                      .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4943                      .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    4944              DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    4945                      .dwattr DW$219, DW_AT_name("PIEIER5"), DW_AT_symbol_name("_PIEIER5")
    4946                      .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4947                      .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    4948              DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    4949                      .dwattr DW$220, DW_AT_name("PIEIFR5"), DW_AT_symbol_name("_PIEIFR5")
    4950                      .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4951                      .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
    4952              DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    4953                      .dwattr DW$221, DW_AT_name("PIEIER6"), DW_AT_symbol_name("_PIEIER6")
    4954                      .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4955                      .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    4956              DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    4957                      .dwattr DW$222, DW_AT_name("PIEIFR6"), DW_AT_symbol_name("_PIEIFR6")
    4958                      .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4959                      .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
    4960              DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:06 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/DefaultIsr_nonBIOS.asm PAGE   93

    4961                      .dwattr DW$223, DW_AT_name("PIEIER7"), DW_AT_symbol_name("_PIEIER7")
    4962                      .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4963                      .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    4964              DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    4965                      .dwattr DW$224, DW_AT_name("PIEIFR7"), DW_AT_symbol_name("_PIEIFR7")
    4966                      .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    4967                      .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    4968              DW$225  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    4969                      .dwattr DW$225, DW_AT_name("PIEIER8"), DW_AT_symbol_name("_PIEIER8")
    4970                      .dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4971                      .dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
    4972              DW$226  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    4973                      .dwattr DW$226, DW_AT_name("PIEIFR8"), DW_AT_symbol_name("_PIEIFR8")
    4974                      .dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    4975                      .dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
    4976              DW$227  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    4977                      .dwattr DW$227, DW_AT_name("PIEIER9"), DW_AT_symbol_name("_PIEIER9")
    4978                      .dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4979                      .dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
    4980              DW$228  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    4981                      .dwattr DW$228, DW_AT_name("PIEIFR9"), DW_AT_symbol_name("_PIEIFR9")
    4982                      .dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    4983                      .dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
    4984              DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    4985                      .dwattr DW$229, DW_AT_name("PIEIER10"), DW_AT_symbol_name("_PIEIER10")
    4986                      .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4987                      .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
    4988              DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    4989                      .dwattr DW$230, DW_AT_name("PIEIFR10"), DW_AT_symbol_name("_PIEIFR10")
    4990                      .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    4991                      .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    4992              DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    4993                      .dwattr DW$231, DW_AT_name("PIEIER11"), DW_AT_symbol_name("_PIEIER11")
    4994                      .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4995                      .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    4996              DW$232  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    4997                      .dwattr DW$232, DW_AT_name("PIEIFR11"), DW_AT_symbol_name("_PIEIFR11")
    4998                      .dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    4999                      .dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
    5000              DW$233  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    5001                      .dwattr DW$233, DW_AT_name("PIEIER12"), DW_AT_symbol_name("_PIEIER12")
    5002                      .dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5003                      .dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
    5004              DW$234  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    5005                      .dwattr DW$234, DW_AT_name("PIEIFR12"), DW_AT_symbol_name("_PIEIFR12")
    5006                      .dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    5007                      .dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
    5008                      .dwendtag DW$T$28
    5009              
    5010              
    5011              DW$T$21 .dwtag  DW_TAG_union_type
    5012                      .dwattr DW$T$21, DW_AT_name("PIECTRL_REG")
    5013                      .dwattr DW$T$21, DW_AT_byte_size(0x01)
    5014              DW$235  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5015                      .dwattr DW$235, DW_AT_name("all"), DW_AT_symbol_name("_all")
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:06 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/DefaultIsr_nonBIOS.asm PAGE   94

    5016                      .dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5017                      .dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
    5018              DW$236  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    5019                      .dwattr DW$236, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    5020                      .dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5021                      .dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
    5022                      .dwendtag DW$T$21
    5023              
    5024              
    5025              DW$T$23 .dwtag  DW_TAG_union_type
    5026                      .dwattr DW$T$23, DW_AT_name("PIEACK_REG")
    5027                      .dwattr DW$T$23, DW_AT_byte_size(0x01)
    5028              DW$237  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5029                      .dwattr DW$237, DW_AT_name("all"), DW_AT_symbol_name("_all")
    5030                      .dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5031                      .dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
    5032              DW$238  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    5033                      .dwattr DW$238, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    5034                      .dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5035                      .dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
    5036                      .dwendtag DW$T$23
    5037              
    5038              
    5039              DW$T$25 .dwtag  DW_TAG_union_type
    5040                      .dwattr DW$T$25, DW_AT_name("PIEIER_REG")
    5041                      .dwattr DW$T$25, DW_AT_byte_size(0x01)
    5042              DW$239  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5043                      .dwattr DW$239, DW_AT_name("all"), DW_AT_symbol_name("_all")
    5044                      .dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5045                      .dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
    5046              DW$240  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    5047                      .dwattr DW$240, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    5048                      .dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5049                      .dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
    5050                      .dwendtag DW$T$25
    5051              
    5052              
    5053              DW$T$27 .dwtag  DW_TAG_union_type
    5054                      .dwattr DW$T$27, DW_AT_name("PIEIFR_REG")
    5055                      .dwattr DW$T$27, DW_AT_byte_size(0x01)
    5056              DW$241  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5057                      .dwattr DW$241, DW_AT_name("all"), DW_AT_symbol_name("_all")
    5058                      .dwattr DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5059                      .dwattr DW$241, DW_AT_accessibility(DW_ACCESS_public)
    5060              DW$242  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    5061                      .dwattr DW$242, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    5062                      .dwattr DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5063                      .dwattr DW$242, DW_AT_accessibility(DW_ACCESS_public)
    5064                      .dwendtag DW$T$27
    5065              
    5066              
    5067              DW$T$20 .dwtag  DW_TAG_structure_type
    5068                      .dwattr DW$T$20, DW_AT_name("PIECTRL_BITS")
    5069                      .dwattr DW$T$20, DW_AT_byte_size(0x01)
    5070              DW$243  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:06 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/DefaultIsr_nonBIOS.asm PAGE   95

    5071                      .dwattr DW$243, DW_AT_name("ENPIE"), DW_AT_symbol_name("_ENPIE")
    5072                      .dwattr DW$243, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    5073                      .dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5074                      .dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
    5075              DW$244  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5076                      .dwattr DW$244, DW_AT_name("PIEVECT"), DW_AT_symbol_name("_PIEVECT")
    5077                      .dwattr DW$244, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    5078                      .dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5079                      .dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
    5080                      .dwendtag DW$T$20
    5081              
    5082              
    5083              DW$T$22 .dwtag  DW_TAG_structure_type
    5084                      .dwattr DW$T$22, DW_AT_name("PIEACK_BITS")
    5085                      .dwattr DW$T$22, DW_AT_byte_size(0x01)
    5086              DW$245  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5087                      .dwattr DW$245, DW_AT_name("ACK1"), DW_AT_symbol_name("_ACK1")
    5088                      .dwattr DW$245, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    5089                      .dwattr DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5090                      .dwattr DW$245, DW_AT_accessibility(DW_ACCESS_public)
    5091              DW$246  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5092                      .dwattr DW$246, DW_AT_name("ACK2"), DW_AT_symbol_name("_ACK2")
    5093                      .dwattr DW$246, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    5094                      .dwattr DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5095                      .dwattr DW$246, DW_AT_accessibility(DW_ACCESS_public)
    5096              DW$247  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5097                      .dwattr DW$247, DW_AT_name("ACK3"), DW_AT_symbol_name("_ACK3")
    5098                      .dwattr DW$247, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    5099                      .dwattr DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5100                      .dwattr DW$247, DW_AT_accessibility(DW_ACCESS_public)
    5101              DW$248  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5102                      .dwattr DW$248, DW_AT_name("ACK4"), DW_AT_symbol_name("_ACK4")
    5103                      .dwattr DW$248, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    5104                      .dwattr DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5105                      .dwattr DW$248, DW_AT_accessibility(DW_ACCESS_public)
    5106              DW$249  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5107                      .dwattr DW$249, DW_AT_name("ACK5"), DW_AT_symbol_name("_ACK5")
    5108                      .dwattr DW$249, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    5109                      .dwattr DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5110                      .dwattr DW$249, DW_AT_accessibility(DW_ACCESS_public)
    5111              DW$250  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5112                      .dwattr DW$250, DW_AT_name("ACK6"), DW_AT_symbol_name("_ACK6")
    5113                      .dwattr DW$250, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    5114                      .dwattr DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5115                      .dwattr DW$250, DW_AT_accessibility(DW_ACCESS_public)
    5116              DW$251  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5117                      .dwattr DW$251, DW_AT_name("ACK7"), DW_AT_symbol_name("_ACK7")
    5118                      .dwattr DW$251, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    5119                      .dwattr DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5120                      .dwattr DW$251, DW_AT_accessibility(DW_ACCESS_public)
    5121              DW$252  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5122                      .dwattr DW$252, DW_AT_name("ACK8"), DW_AT_symbol_name("_ACK8")
    5123                      .dwattr DW$252, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    5124                      .dwattr DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5125                      .dwattr DW$252, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:06 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/DefaultIsr_nonBIOS.asm PAGE   96

    5126              DW$253  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5127                      .dwattr DW$253, DW_AT_name("ACK9"), DW_AT_symbol_name("_ACK9")
    5128                      .dwattr DW$253, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    5129                      .dwattr DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5130                      .dwattr DW$253, DW_AT_accessibility(DW_ACCESS_public)
    5131              DW$254  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5132                      .dwattr DW$254, DW_AT_name("ACK10"), DW_AT_symbol_name("_ACK10")
    5133                      .dwattr DW$254, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    5134                      .dwattr DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5135                      .dwattr DW$254, DW_AT_accessibility(DW_ACCESS_public)
    5136              DW$255  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5137                      .dwattr DW$255, DW_AT_name("ACK11"), DW_AT_symbol_name("_ACK11")
    5138                      .dwattr DW$255, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    5139                      .dwattr DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5140                      .dwattr DW$255, DW_AT_accessibility(DW_ACCESS_public)
    5141              DW$256  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5142                      .dwattr DW$256, DW_AT_name("ACK12"), DW_AT_symbol_name("_ACK12")
    5143                      .dwattr DW$256, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    5144                      .dwattr DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5145                      .dwattr DW$256, DW_AT_accessibility(DW_ACCESS_public)
    5146              DW$257  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5147                      .dwattr DW$257, DW_AT_name("rsvd"), DW_AT_symbol_name("_rsvd")
    5148                      .dwattr DW$257, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    5149                      .dwattr DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5150                      .dwattr DW$257, DW_AT_accessibility(DW_ACCESS_public)
    5151                      .dwendtag DW$T$22
    5152              
    5153              
    5154              DW$T$24 .dwtag  DW_TAG_structure_type
    5155                      .dwattr DW$T$24, DW_AT_name("PIEIER_BITS")
    5156                      .dwattr DW$T$24, DW_AT_byte_size(0x01)
    5157              DW$258  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5158                      .dwattr DW$258, DW_AT_name("INTx1"), DW_AT_symbol_name("_INTx1")
    5159                      .dwattr DW$258, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    5160                      .dwattr DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5161                      .dwattr DW$258, DW_AT_accessibility(DW_ACCESS_public)
    5162              DW$259  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5163                      .dwattr DW$259, DW_AT_name("INTx2"), DW_AT_symbol_name("_INTx2")
    5164                      .dwattr DW$259, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    5165                      .dwattr DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5166                      .dwattr DW$259, DW_AT_accessibility(DW_ACCESS_public)
    5167              DW$260  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5168                      .dwattr DW$260, DW_AT_name("INTx3"), DW_AT_symbol_name("_INTx3")
    5169                      .dwattr DW$260, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    5170                      .dwattr DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5171                      .dwattr DW$260, DW_AT_accessibility(DW_ACCESS_public)
    5172              DW$261  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5173                      .dwattr DW$261, DW_AT_name("INTx4"), DW_AT_symbol_name("_INTx4")
    5174                      .dwattr DW$261, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    5175                      .dwattr DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5176                      .dwattr DW$261, DW_AT_accessibility(DW_ACCESS_public)
    5177              DW$262  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5178                      .dwattr DW$262, DW_AT_name("INTx5"), DW_AT_symbol_name("_INTx5")
    5179                      .dwattr DW$262, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    5180                      .dwattr DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:06 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/DefaultIsr_nonBIOS.asm PAGE   97

    5181                      .dwattr DW$262, DW_AT_accessibility(DW_ACCESS_public)
    5182              DW$263  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5183                      .dwattr DW$263, DW_AT_name("INTx6"), DW_AT_symbol_name("_INTx6")
    5184                      .dwattr DW$263, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    5185                      .dwattr DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5186                      .dwattr DW$263, DW_AT_accessibility(DW_ACCESS_public)
    5187              DW$264  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5188                      .dwattr DW$264, DW_AT_name("INTx7"), DW_AT_symbol_name("_INTx7")
    5189                      .dwattr DW$264, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    5190                      .dwattr DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5191                      .dwattr DW$264, DW_AT_accessibility(DW_ACCESS_public)
    5192              DW$265  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5193                      .dwattr DW$265, DW_AT_name("INTx8"), DW_AT_symbol_name("_INTx8")
    5194                      .dwattr DW$265, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    5195                      .dwattr DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5196                      .dwattr DW$265, DW_AT_accessibility(DW_ACCESS_public)
    5197              DW$266  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5198                      .dwattr DW$266, DW_AT_name("rsvd"), DW_AT_symbol_name("_rsvd")
    5199                      .dwattr DW$266, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    5200                      .dwattr DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5201                      .dwattr DW$266, DW_AT_accessibility(DW_ACCESS_public)
    5202                      .dwendtag DW$T$24
    5203              
    5204              
    5205              DW$T$26 .dwtag  DW_TAG_structure_type
    5206                      .dwattr DW$T$26, DW_AT_name("PIEIFR_BITS")
    5207                      .dwattr DW$T$26, DW_AT_byte_size(0x01)
    5208              DW$267  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5209                      .dwattr DW$267, DW_AT_name("INTx1"), DW_AT_symbol_name("_INTx1")
    5210                      .dwattr DW$267, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    5211                      .dwattr DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5212                      .dwattr DW$267, DW_AT_accessibility(DW_ACCESS_public)
    5213              DW$268  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5214                      .dwattr DW$268, DW_AT_name("INTx2"), DW_AT_symbol_name("_INTx2")
    5215                      .dwattr DW$268, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    5216                      .dwattr DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5217                      .dwattr DW$268, DW_AT_accessibility(DW_ACCESS_public)
    5218              DW$269  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5219                      .dwattr DW$269, DW_AT_name("INTx3"), DW_AT_symbol_name("_INTx3")
    5220                      .dwattr DW$269, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    5221                      .dwattr DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5222                      .dwattr DW$269, DW_AT_accessibility(DW_ACCESS_public)
    5223              DW$270  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5224                      .dwattr DW$270, DW_AT_name("INTx4"), DW_AT_symbol_name("_INTx4")
    5225                      .dwattr DW$270, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    5226                      .dwattr DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5227                      .dwattr DW$270, DW_AT_accessibility(DW_ACCESS_public)
    5228              DW$271  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5229                      .dwattr DW$271, DW_AT_name("INTx5"), DW_AT_symbol_name("_INTx5")
    5230                      .dwattr DW$271, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    5231                      .dwattr DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5232                      .dwattr DW$271, DW_AT_accessibility(DW_ACCESS_public)
    5233              DW$272  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5234                      .dwattr DW$272, DW_AT_name("INTx6"), DW_AT_symbol_name("_INTx6")
    5235                      .dwattr DW$272, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:06 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/DefaultIsr_nonBIOS.asm PAGE   98

    5236                      .dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5237                      .dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
    5238              DW$273  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5239                      .dwattr DW$273, DW_AT_name("INTx7"), DW_AT_symbol_name("_INTx7")
    5240                      .dwattr DW$273, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    5241                      .dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5242                      .dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
    5243              DW$274  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5244                      .dwattr DW$274, DW_AT_name("INTx8"), DW_AT_symbol_name("_INTx8")
    5245                      .dwattr DW$274, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    5246                      .dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5247                      .dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
    5248              DW$275  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5249                      .dwattr DW$275, DW_AT_name("rsvd"), DW_AT_symbol_name("_rsvd")
    5250                      .dwattr DW$275, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    5251                      .dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5252                      .dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
    5253                      .dwendtag DW$T$26
    5254              
    5255              
    5256                      .dwattr DW$76, DW_AT_external(0x01)
    5257                      .dwattr DW$118, DW_AT_external(0x01)
    5258                      .dwattr DW$121, DW_AT_external(0x01)
    5259                      .dwattr DW$124, DW_AT_external(0x01)
    5260                      .dwattr DW$160, DW_AT_external(0x01)
    5261                      .dwattr DW$163, DW_AT_external(0x01)
    5262                      .dwattr DW$166, DW_AT_external(0x01)
    5263                      .dwattr DW$85, DW_AT_external(0x01)
    5264                      .dwattr DW$88, DW_AT_external(0x01)
    5265                      .dwattr DW$91, DW_AT_external(0x01)
    5266                      .dwattr DW$127, DW_AT_external(0x01)
    5267                      .dwattr DW$130, DW_AT_external(0x01)
    5268                      .dwattr DW$133, DW_AT_external(0x01)
    5269                      .dwattr DW$13, DW_AT_external(0x01)
    5270                      .dwattr DW$193, DW_AT_external(0x01)
    5271                      .dwattr DW$196, DW_AT_external(0x01)
    5272                      .dwattr DW$19, DW_AT_external(0x01)
    5273                      .dwattr DW$25, DW_AT_external(0x01)
    5274                      .dwattr DW$7, DW_AT_external(0x01)
    5275                      .dwattr DW$10, DW_AT_external(0x01)
    5276                      .dwattr DW$175, DW_AT_external(0x01)
    5277                      .dwattr DW$178, DW_AT_external(0x01)
    5278                      .dwattr DW$22, DW_AT_external(0x01)
    5279                      .dwattr DW$64, DW_AT_external(0x01)
    5280                      .dwattr DW$67, DW_AT_external(0x01)
    5281                      .dwattr DW$199, DW_AT_external(0x01)
    5282                      .dwattr DW$16, DW_AT_external(0x01)
    5283                      .dwattr DW$181, DW_AT_external(0x01)
    5284                      .dwattr DW$187, DW_AT_external(0x01)
    5285                      .dwattr DW$184, DW_AT_external(0x01)
    5286                      .dwattr DW$190, DW_AT_external(0x01)
    5287                      .dwattr DW$169, DW_AT_external(0x01)
    5288                      .dwattr DW$172, DW_AT_external(0x01)
    5289                      .dwattr DW$97, DW_AT_external(0x01)
    5290                      .dwattr DW$103, DW_AT_external(0x01)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:06 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/DefaultIsr_nonBIOS.asm PAGE   99

    5291                      .dwattr DW$94, DW_AT_external(0x01)
    5292                      .dwattr DW$100, DW_AT_external(0x01)
    5293                      .dwattr DW$109, DW_AT_external(0x01)
    5294                      .dwattr DW$115, DW_AT_external(0x01)
    5295                      .dwattr DW$106, DW_AT_external(0x01)
    5296                      .dwattr DW$112, DW_AT_external(0x01)
    5297                      .dwattr DW$139, DW_AT_external(0x01)
    5298                      .dwattr DW$145, DW_AT_external(0x01)
    5299                      .dwattr DW$136, DW_AT_external(0x01)
    5300                      .dwattr DW$142, DW_AT_external(0x01)
    5301                      .dwattr DW$151, DW_AT_external(0x01)
    5302                      .dwattr DW$157, DW_AT_external(0x01)
    5303                      .dwattr DW$148, DW_AT_external(0x01)
    5304                      .dwattr DW$154, DW_AT_external(0x01)
    5305                      .dwattr DW$79, DW_AT_external(0x01)
    5306                      .dwattr DW$55, DW_AT_external(0x01)
    5307                      .dwattr DW$58, DW_AT_external(0x01)
    5308                      .dwattr DW$61, DW_AT_external(0x01)
