TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/DSP281x_GlobalVariableDefs.asm PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Tue Apr  8 10:05:52 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=softlib --hll_source=on --mem_model:code
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/repo/jabil2025/gpb/gpb_project_v3/DSP281x_GlobalVariableDefs.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\repo\jabil2025\gpb\gpb_project_v3\projects\example_nonBIOS_ram\D
      13                      .global _CpuTimer0Regs
      14 00000000       _CpuTimer0Regs: .usect  "CpuTimer0RegsFile",8,1,1
      15              $C$DW$1 .dwtag  DW_TAG_variable

     178                      .dwattr $C$DW$19, DW_AT_name("ECanaLAMRegs")
     179                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_ECanaLAMRegs")
     180                      .dwattr $C$DW$19, DW_AT_location[DW_OP_addr _ECanaLAMRegs]
     181                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$454)
     182                      .dwattr $C$DW$19, DW_AT_external
     183              
     184                      .global _ECanaMOTSRegs
     185 00000000       _ECanaMOTSRegs: .usect  "ECanaMOTSRegsFile",64,1,1
     186              $C$DW$20        .dwtag  DW_TAG_variable
     187                      .dwattr $C$DW$20, DW_AT_name("ECanaMOTSRegs")
     188                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_ECanaMOTSRegs")
     189                      .dwattr $C$DW$20, DW_AT_location[DW_OP_addr _ECanaMOTSRegs]
     190                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$457)
     191                      .dwattr $C$DW$20, DW_AT_external
     192              
     193                      .global _ECanaMOTORegs
     194 00000000       _ECanaMOTORegs: .usect  "ECanaMOTORegsFile",64,1,1
     195              $C$DW$21        .dwtag  DW_TAG_variable
     196                      .dwattr $C$DW$21, DW_AT_name("ECanaMOTORegs")
     197                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_ECanaMOTORegs")
     198                      .dwattr $C$DW$21, DW_AT_location[DW_OP_addr _ECanaMOTORegs]
     199                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$456)
     200                      .dwattr $C$DW$21, DW_AT_external
     201              
     202                      .global _DevEmuRegs
     203 00000000       _DevEmuRegs:    .usect  "DevEmuRegsFile",208,1,1
     204              $C$DW$22        .dwtag  DW_TAG_variable
     205                      .dwattr $C$DW$22, DW_AT_name("DevEmuRegs")
     206                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_DevEmuRegs")
     207                      .dwattr $C$DW$22, DW_AT_location[DW_OP_addr _DevEmuRegs]
     208                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$446)
     209                      .dwattr $C$DW$22, DW_AT_external
     210              
     211                      .global _ECanaMboxes
     212 00000000       _ECanaMboxes:   .usect  "ECanaMboxesFile",256,1,1
     213              $C$DW$23        .dwtag  DW_TAG_variable
     214                      .dwattr $C$DW$23, DW_AT_name("ECanaMboxes")
     215                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_ECanaMboxes")
     216                      .dwattr $C$DW$23, DW_AT_location[DW_OP_addr _ECanaMboxes]
     217                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$447)
     218                      .dwattr $C$DW$23, DW_AT_external
     219              
     220                      .global _PieVectTable
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/DSP281x_GlobalVariableDefs.asm PAGE    5

     221 00000000       _PieVectTable:  .usect  "PieVectTableFile",256,1,1
     222              $C$DW$24        .dwtag  DW_TAG_variable
     223                      .dwattr $C$DW$24, DW_AT_name("PieVectTable")
     224                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_PieVectTable")
     225                      .dwattr $C$DW$24, DW_AT_location[DW_OP_addr _PieVectTable]
     226                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$322)
     227                      .dwattr $C$DW$24, DW_AT_external
     228              
     229                      .sblock "AdcRegsFile"
     230                      .sblock "CpuTimer0RegsFile"
     231                      .sblock "CsmPwlFile"
     232                      .sblock "CsmRegsFile"
     233                      .sblock "DevEmuRegsFile"
     234                      .sblock "ECanaLAMRegsFile"
     235                      .sblock "ECanaMOTORegsFile"
     236                      .sblock "ECanaMOTSRegsFile"
     237                      .sblock "ECanaMboxesFile"
     238                      .sblock "ECanaRegsFile"
     239                      .sblock "EvaRegsFile"
     240                      .sblock "EvbRegsFile"
     241                      .sblock "FlashRegsFile"
     242                      .sblock "GpioDataRegsFile"
     243                      .sblock "GpioMuxRegsFile"
     244                      .sblock "McbspaRegsFile"
     245                      .sblock "PieCtrlRegsFile"
     246                      .sblock "PieVectTableFile"
     247                      .sblock "SciaRegsFile"
     248                      .sblock "ScibRegsFile"
     249                      .sblock "SpiaRegsFile"
     250                      .sblock "SysCtrlRegsFile"
     251                      .sblock "XIntruptRegsFile"
     252                      .sblock "XintfRegsFile"
     253              ;       C:\ti\ccs1281\ccs\tools\compiler\ti-cgt-c2000_22.6.2.LTS\bin\ac2000.exe -@C:\\Users\\fgjlb01\\AppData
     254              
     255              ;***************************************************************
     256              ;* TYPE INFORMATION                                            *
     257              ;***************************************************************
     258              
     259              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     260                      .dwattr $C$DW$T$20, DW_AT_name("ACTRA_BITS")
     261                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     262              $C$DW$25        .dwtag  DW_TAG_member
     263                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     264                      .dwattr $C$DW$25, DW_AT_name("CMP1ACT")
     265                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_CMP1ACT")
     266                      .dwattr $C$DW$25, DW_AT_bit_offset(0x0e)
     267                      .dwattr $C$DW$25, DW_AT_bit_size(0x02)
     268                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     269                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     270              
     271              $C$DW$26        .dwtag  DW_TAG_member
     272                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     273                      .dwattr $C$DW$26, DW_AT_name("CMP2ACT")
     274                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_CMP2ACT")
     275                      .dwattr $C$DW$26, DW_AT_bit_offset(0x0c)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/DSP281x_GlobalVariableDefs.asm PAGE    6

     276                      .dwattr $C$DW$26, DW_AT_bit_size(0x02)
     277                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     278                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     279              
     280              $C$DW$27        .dwtag  DW_TAG_member
     281                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     282                      .dwattr $C$DW$27, DW_AT_name("CMP3ACT")
     283                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_CMP3ACT")
     284                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0a)
     285                      .dwattr $C$DW$27, DW_AT_bit_size(0x02)
     286                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     287                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     288              
     289              $C$DW$28        .dwtag  DW_TAG_member
     290                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     291                      .dwattr $C$DW$28, DW_AT_name("CMP4ACT")
     292                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_CMP4ACT")
     293                      .dwattr $C$DW$28, DW_AT_bit_offset(0x08)
     294                      .dwattr $C$DW$28, DW_AT_bit_size(0x02)
     295                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     296                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     297              
     298              $C$DW$29        .dwtag  DW_TAG_member
     299                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     300                      .dwattr $C$DW$29, DW_AT_name("CMP5ACT")
     301                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_CMP5ACT")
     302                      .dwattr $C$DW$29, DW_AT_bit_offset(0x06)
     303                      .dwattr $C$DW$29, DW_AT_bit_size(0x02)
     304                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     305                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     306              
     307              $C$DW$30        .dwtag  DW_TAG_member
     308                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     309                      .dwattr $C$DW$30, DW_AT_name("CMP6ACT")
     310                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_CMP6ACT")
     311                      .dwattr $C$DW$30, DW_AT_bit_offset(0x04)
     312                      .dwattr $C$DW$30, DW_AT_bit_size(0x02)
     313                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     314                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     315              
     316              $C$DW$31        .dwtag  DW_TAG_member
     317                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     318                      .dwattr $C$DW$31, DW_AT_name("D")
     319                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_D")
     320                      .dwattr $C$DW$31, DW_AT_bit_offset(0x01)
     321                      .dwattr $C$DW$31, DW_AT_bit_size(0x03)
     322                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     323                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     324              
     325              $C$DW$32        .dwtag  DW_TAG_member
     326                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     327                      .dwattr $C$DW$32, DW_AT_name("SVRDIR")
     328                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_SVRDIR")
     329                      .dwattr $C$DW$32, DW_AT_bit_offset(0x00)
     330                      .dwattr $C$DW$32, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/DSP281x_GlobalVariableDefs.asm PAGE    7

     331                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     332                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     333              
     334                      .dwendtag $C$DW$T$20
     335              
     336              
     337              $C$DW$T$21      .dwtag  DW_TAG_union_type
     338                      .dwattr $C$DW$T$21, DW_AT_name("ACTRA_REG")
     339                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     340              $C$DW$33        .dwtag  DW_TAG_member
     341                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     342                      .dwattr $C$DW$33, DW_AT_name("all")
     343                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_all")
     344                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     345                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     346              
     347              $C$DW$34        .dwtag  DW_TAG_member
     348                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$20)
     349                      .dwattr $C$DW$34, DW_AT_name("bit")
     350                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_bit")
     351                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     352                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     353              
     354                      .dwendtag $C$DW$T$21
     355              
     356              
     357              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     358                      .dwattr $C$DW$T$22, DW_AT_name("ACTRB_BITS")
     359                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     360              $C$DW$35        .dwtag  DW_TAG_member
     361                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     362                      .dwattr $C$DW$35, DW_AT_name("CMP7ACT")
     363                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_CMP7ACT")
     364                      .dwattr $C$DW$35, DW_AT_bit_offset(0x0e)
     365                      .dwattr $C$DW$35, DW_AT_bit_size(0x02)
     366                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     367                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     368              
     369              $C$DW$36        .dwtag  DW_TAG_member
     370                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     371                      .dwattr $C$DW$36, DW_AT_name("CMP8ACT")
     372                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_CMP8ACT")
     373                      .dwattr $C$DW$36, DW_AT_bit_offset(0x0c)
     374                      .dwattr $C$DW$36, DW_AT_bit_size(0x02)
     375                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     376                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     377              
     378              $C$DW$37        .dwtag  DW_TAG_member
     379                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     380                      .dwattr $C$DW$37, DW_AT_name("CMP9ACT")
     381                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_CMP9ACT")
     382                      .dwattr $C$DW$37, DW_AT_bit_offset(0x0a)
     383                      .dwattr $C$DW$37, DW_AT_bit_size(0x02)
     384                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     385                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/DSP281x_GlobalVariableDefs.asm PAGE    8

     386              
     387              $C$DW$38        .dwtag  DW_TAG_member
     388                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     389                      .dwattr $C$DW$38, DW_AT_name("CMP10ACT")
     390                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_CMP10ACT")
     391                      .dwattr $C$DW$38, DW_AT_bit_offset(0x08)
     392                      .dwattr $C$DW$38, DW_AT_bit_size(0x02)
     393                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     394                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     395              
     396              $C$DW$39        .dwtag  DW_TAG_member
     397                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     398                      .dwattr $C$DW$39, DW_AT_name("CMP11ACT")
     399                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_CMP11ACT")
     400                      .dwattr $C$DW$39, DW_AT_bit_offset(0x06)
     401                      .dwattr $C$DW$39, DW_AT_bit_size(0x02)
     402                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     403                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     404              
     405              $C$DW$40        .dwtag  DW_TAG_member
     406                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     407                      .dwattr $C$DW$40, DW_AT_name("CMP12ACT")
     408                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_CMP12ACT")
     409                      .dwattr $C$DW$40, DW_AT_bit_offset(0x04)
     410                      .dwattr $C$DW$40, DW_AT_bit_size(0x02)
     411                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     412                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     413              
     414              $C$DW$41        .dwtag  DW_TAG_member
     415                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     416                      .dwattr $C$DW$41, DW_AT_name("D")
     417                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_D")
     418                      .dwattr $C$DW$41, DW_AT_bit_offset(0x01)
     419                      .dwattr $C$DW$41, DW_AT_bit_size(0x03)
     420                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     421                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     422              
     423              $C$DW$42        .dwtag  DW_TAG_member
     424                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     425                      .dwattr $C$DW$42, DW_AT_name("SVRDIR")
     426                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_SVRDIR")
     427                      .dwattr $C$DW$42, DW_AT_bit_offset(0x00)
     428                      .dwattr $C$DW$42, DW_AT_bit_size(0x01)
     429                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     430                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     431              
     432                      .dwendtag $C$DW$T$22
     433              
     434              
     435              $C$DW$T$23      .dwtag  DW_TAG_union_type
     436                      .dwattr $C$DW$T$23, DW_AT_name("ACTRB_REG")
     437                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     438              $C$DW$43        .dwtag  DW_TAG_member
     439                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     440                      .dwattr $C$DW$43, DW_AT_name("all")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/DSP281x_GlobalVariableDefs.asm PAGE    9

     441                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_all")
     442                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     443                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     444              
     445              $C$DW$44        .dwtag  DW_TAG_member
     446                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$22)
     447                      .dwattr $C$DW$44, DW_AT_name("bit")
     448                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_bit")
     449                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     450                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     451              
     452                      .dwendtag $C$DW$T$23
     453              
     454              
     455              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     456                      .dwattr $C$DW$T$24, DW_AT_name("ADCASEQSR_BITS")
     457                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     458              $C$DW$45        .dwtag  DW_TAG_member
     459                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     460                      .dwattr $C$DW$45, DW_AT_name("SEQ1_STATE")
     461                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_SEQ1_STATE")
     462                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0c)
     463                      .dwattr $C$DW$45, DW_AT_bit_size(0x04)
     464                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     465                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     466              
     467              $C$DW$46        .dwtag  DW_TAG_member
     468                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     469                      .dwattr $C$DW$46, DW_AT_name("SEQ2_STATE")
     470                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_SEQ2_STATE")
     471                      .dwattr $C$DW$46, DW_AT_bit_offset(0x09)
     472                      .dwattr $C$DW$46, DW_AT_bit_size(0x03)
     473                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     474                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     475              
     476              $C$DW$47        .dwtag  DW_TAG_member
     477                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     478                      .dwattr $C$DW$47, DW_AT_name("rsvd1")
     479                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_rsvd1")
     480                      .dwattr $C$DW$47, DW_AT_bit_offset(0x08)
     481                      .dwattr $C$DW$47, DW_AT_bit_size(0x01)
     482                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     483                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     484              
     485              $C$DW$48        .dwtag  DW_TAG_member
     486                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     487                      .dwattr $C$DW$48, DW_AT_name("SEQ_CNTR")
     488                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_SEQ_CNTR")
     489                      .dwattr $C$DW$48, DW_AT_bit_offset(0x04)
     490                      .dwattr $C$DW$48, DW_AT_bit_size(0x04)
     491                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     492                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     493              
     494              $C$DW$49        .dwtag  DW_TAG_member
     495                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/DSP281x_GlobalVariableDefs.asm PAGE   10

     496                      .dwattr $C$DW$49, DW_AT_name("rsvd2")
     497                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_rsvd2")
     498                      .dwattr $C$DW$49, DW_AT_bit_offset(0x00)
     499                      .dwattr $C$DW$49, DW_AT_bit_size(0x04)
     500                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     501                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     502              
     503                      .dwendtag $C$DW$T$24
     504              
     505              
     506              $C$DW$T$25      .dwtag  DW_TAG_union_type
     507                      .dwattr $C$DW$T$25, DW_AT_name("ADCASEQSR_REG")
     508                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     509              $C$DW$50        .dwtag  DW_TAG_member
     510                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     511                      .dwattr $C$DW$50, DW_AT_name("all")
     512                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_all")
     513                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     514                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     515              
     516              $C$DW$51        .dwtag  DW_TAG_member
     517                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$24)
     518                      .dwattr $C$DW$51, DW_AT_name("bit")
     519                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_bit")
     520                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     521                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     522              
     523                      .dwendtag $C$DW$T$25
     524              
     525              
     526              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     527                      .dwattr $C$DW$T$26, DW_AT_name("ADCCHSELSEQ1_BITS")
     528                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     529              $C$DW$52        .dwtag  DW_TAG_member
     530                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     531                      .dwattr $C$DW$52, DW_AT_name("CONV00")
     532                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_CONV00")
     533                      .dwattr $C$DW$52, DW_AT_bit_offset(0x0c)
     534                      .dwattr $C$DW$52, DW_AT_bit_size(0x04)
     535                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     536                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     537              
     538              $C$DW$53        .dwtag  DW_TAG_member
     539                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     540                      .dwattr $C$DW$53, DW_AT_name("CONV01")
     541                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_CONV01")
     542                      .dwattr $C$DW$53, DW_AT_bit_offset(0x08)
     543                      .dwattr $C$DW$53, DW_AT_bit_size(0x04)
     544                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     545                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     546              
     547              $C$DW$54        .dwtag  DW_TAG_member
     548                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     549                      .dwattr $C$DW$54, DW_AT_name("CONV02")
     550                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_CONV02")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/DSP281x_GlobalVariableDefs.asm PAGE   11

     551                      .dwattr $C$DW$54, DW_AT_bit_offset(0x04)
     552                      .dwattr $C$DW$54, DW_AT_bit_size(0x04)
     553                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     554                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     555              
     556              $C$DW$55        .dwtag  DW_TAG_member
     557                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     558                      .dwattr $C$DW$55, DW_AT_name("CONV03")
     559                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_CONV03")
     560                      .dwattr $C$DW$55, DW_AT_bit_offset(0x00)
     561                      .dwattr $C$DW$55, DW_AT_bit_size(0x04)
     562                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     563                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     564              
     565                      .dwendtag $C$DW$T$26
     566              
     567              
     568              $C$DW$T$27      .dwtag  DW_TAG_union_type
     569                      .dwattr $C$DW$T$27, DW_AT_name("ADCCHSELSEQ1_REG")
     570                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     571              $C$DW$56        .dwtag  DW_TAG_member
     572                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     573                      .dwattr $C$DW$56, DW_AT_name("all")
     574                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_all")
     575                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     576                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     577              
     578              $C$DW$57        .dwtag  DW_TAG_member
     579                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$26)
     580                      .dwattr $C$DW$57, DW_AT_name("bit")
     581                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_bit")
     582                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     583                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     584              
     585                      .dwendtag $C$DW$T$27
     586              
     587              
     588              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     589                      .dwattr $C$DW$T$28, DW_AT_name("ADCCHSELSEQ2_BITS")
     590                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     591              $C$DW$58        .dwtag  DW_TAG_member
     592                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     593                      .dwattr $C$DW$58, DW_AT_name("CONV04")
     594                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_CONV04")
     595                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0c)
     596                      .dwattr $C$DW$58, DW_AT_bit_size(0x04)
     597                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     598                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     599              
     600              $C$DW$59        .dwtag  DW_TAG_member
     601                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     602                      .dwattr $C$DW$59, DW_AT_name("CONV05")
     603                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_CONV05")
     604                      .dwattr $C$DW$59, DW_AT_bit_offset(0x08)
     605                      .dwattr $C$DW$59, DW_AT_bit_size(0x04)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/DSP281x_GlobalVariableDefs.asm PAGE   12

     606                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     607                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     608              
     609              $C$DW$60        .dwtag  DW_TAG_member
     610                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     611                      .dwattr $C$DW$60, DW_AT_name("CONV06")
     612                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_CONV06")
     613                      .dwattr $C$DW$60, DW_AT_bit_offset(0x04)
     614                      .dwattr $C$DW$60, DW_AT_bit_size(0x04)
     615                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     616                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     617              
     618              $C$DW$61        .dwtag  DW_TAG_member
     619                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     620                      .dwattr $C$DW$61, DW_AT_name("CONV07")
     621                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_CONV07")
     622                      .dwattr $C$DW$61, DW_AT_bit_offset(0x00)
     623                      .dwattr $C$DW$61, DW_AT_bit_size(0x04)
     624                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     625                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     626              
     627                      .dwendtag $C$DW$T$28
     628              
     629              
     630              $C$DW$T$29      .dwtag  DW_TAG_union_type
     631                      .dwattr $C$DW$T$29, DW_AT_name("ADCCHSELSEQ2_REG")
     632                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     633              $C$DW$62        .dwtag  DW_TAG_member
     634                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     635                      .dwattr $C$DW$62, DW_AT_name("all")
     636                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_all")
     637                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     638                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     639              
     640              $C$DW$63        .dwtag  DW_TAG_member
     641                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$28)
     642                      .dwattr $C$DW$63, DW_AT_name("bit")
     643                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_bit")
     644                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     645                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     646              
     647                      .dwendtag $C$DW$T$29
     648              
     649              
     650              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     651                      .dwattr $C$DW$T$30, DW_AT_name("ADCCHSELSEQ3_BITS")
     652                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     653              $C$DW$64        .dwtag  DW_TAG_member
     654                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     655                      .dwattr $C$DW$64, DW_AT_name("CONV08")
     656                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_CONV08")
     657                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0c)
     658                      .dwattr $C$DW$64, DW_AT_bit_size(0x04)
     659                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     660                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/DSP281x_GlobalVariableDefs.asm PAGE   13

     661              
     662              $C$DW$65        .dwtag  DW_TAG_member
     663                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     664                      .dwattr $C$DW$65, DW_AT_name("CONV09")
     665                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_CONV09")
     666                      .dwattr $C$DW$65, DW_AT_bit_offset(0x08)
     667                      .dwattr $C$DW$65, DW_AT_bit_size(0x04)
     668                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     669                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     670              
     671              $C$DW$66        .dwtag  DW_TAG_member
     672                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     673                      .dwattr $C$DW$66, DW_AT_name("CONV10")
     674                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_CONV10")
     675                      .dwattr $C$DW$66, DW_AT_bit_offset(0x04)
     676                      .dwattr $C$DW$66, DW_AT_bit_size(0x04)
     677                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     678                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     679              
     680              $C$DW$67        .dwtag  DW_TAG_member
     681                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     682                      .dwattr $C$DW$67, DW_AT_name("CONV11")
     683                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_CONV11")
     684                      .dwattr $C$DW$67, DW_AT_bit_offset(0x00)
     685                      .dwattr $C$DW$67, DW_AT_bit_size(0x04)
     686                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     687                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     688              
     689                      .dwendtag $C$DW$T$30
     690              
     691              
     692              $C$DW$T$31      .dwtag  DW_TAG_union_type
     693                      .dwattr $C$DW$T$31, DW_AT_name("ADCCHSELSEQ3_REG")
     694                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     695              $C$DW$68        .dwtag  DW_TAG_member
     696                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     697                      .dwattr $C$DW$68, DW_AT_name("all")
     698                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_all")
     699                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     700                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     701              
     702              $C$DW$69        .dwtag  DW_TAG_member
     703                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$30)
     704                      .dwattr $C$DW$69, DW_AT_name("bit")
     705                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_bit")
     706                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     707                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     708              
     709                      .dwendtag $C$DW$T$31
     710              
     711              
     712              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     713                      .dwattr $C$DW$T$32, DW_AT_name("ADCCHSELSEQ4_BITS")
     714                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
     715              $C$DW$70        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/DSP281x_GlobalVariableDefs.asm PAGE   14

     716                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     717                      .dwattr $C$DW$70, DW_AT_name("CONV12")
     718                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_CONV12")
     719                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0c)
     720                      .dwattr $C$DW$70, DW_AT_bit_size(0x04)
     721                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     722                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     723              
     724              $C$DW$71        .dwtag  DW_TAG_member
     725                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     726                      .dwattr $C$DW$71, DW_AT_name("CONV13")
     727                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_CONV13")
     728                      .dwattr $C$DW$71, DW_AT_bit_offset(0x08)
     729                      .dwattr $C$DW$71, DW_AT_bit_size(0x04)
     730                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     731                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     732              
     733              $C$DW$72        .dwtag  DW_TAG_member
     734                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     735                      .dwattr $C$DW$72, DW_AT_name("CONV14")
     736                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_CONV14")
     737                      .dwattr $C$DW$72, DW_AT_bit_offset(0x04)
     738                      .dwattr $C$DW$72, DW_AT_bit_size(0x04)
     739                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     740                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     741              
     742              $C$DW$73        .dwtag  DW_TAG_member
     743                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     744                      .dwattr $C$DW$73, DW_AT_name("CONV15")
     745                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_CONV15")
     746                      .dwattr $C$DW$73, DW_AT_bit_offset(0x00)
     747                      .dwattr $C$DW$73, DW_AT_bit_size(0x04)
     748                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     749                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     750              
     751                      .dwendtag $C$DW$T$32
     752              
     753              
     754              $C$DW$T$33      .dwtag  DW_TAG_union_type
     755                      .dwattr $C$DW$T$33, DW_AT_name("ADCCHSELSEQ4_REG")
     756                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     757              $C$DW$74        .dwtag  DW_TAG_member
     758                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     759                      .dwattr $C$DW$74, DW_AT_name("all")
     760                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_all")
     761                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     762                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     763              
     764              $C$DW$75        .dwtag  DW_TAG_member
     765                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$32)
     766                      .dwattr $C$DW$75, DW_AT_name("bit")
     767                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_bit")
     768                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     769                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     770              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/DSP281x_GlobalVariableDefs.asm PAGE   15

     771                      .dwendtag $C$DW$T$33
     772              
     773              
     774              $C$DW$T$34      .dwtag  DW_TAG_structure_type
     775                      .dwattr $C$DW$T$34, DW_AT_name("ADCMAXCONV_BITS")
     776                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
     777              $C$DW$76        .dwtag  DW_TAG_member
     778                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     779                      .dwattr $C$DW$76, DW_AT_name("MAX_CONV1")
     780                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_MAX_CONV1")
     781                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0c)
     782                      .dwattr $C$DW$76, DW_AT_bit_size(0x04)
     783                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     784                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     785              
     786              $C$DW$77        .dwtag  DW_TAG_member
     787                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     788                      .dwattr $C$DW$77, DW_AT_name("MAX_CONV2")
     789                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_MAX_CONV2")
     790                      .dwattr $C$DW$77, DW_AT_bit_offset(0x09)
     791                      .dwattr $C$DW$77, DW_AT_bit_size(0x03)
     792                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     793                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     794              
     795              $C$DW$78        .dwtag  DW_TAG_member
     796                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     797                      .dwattr $C$DW$78, DW_AT_name("rsvd1")
     798                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_rsvd1")
     799                      .dwattr $C$DW$78, DW_AT_bit_offset(0x00)
     800                      .dwattr $C$DW$78, DW_AT_bit_size(0x09)
     801                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     802                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     803              
     804                      .dwendtag $C$DW$T$34
     805              
     806              
     807              $C$DW$T$35      .dwtag  DW_TAG_union_type
     808                      .dwattr $C$DW$T$35, DW_AT_name("ADCMAXCONV_REG")
     809                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
     810              $C$DW$79        .dwtag  DW_TAG_member
     811                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     812                      .dwattr $C$DW$79, DW_AT_name("all")
     813                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_all")
     814                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     815                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     816              
     817              $C$DW$80        .dwtag  DW_TAG_member
     818                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$34)
     819                      .dwattr $C$DW$80, DW_AT_name("bit")
     820                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_bit")
     821                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     822                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     823              
     824                      .dwendtag $C$DW$T$35
     825              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/DSP281x_GlobalVariableDefs.asm PAGE   16

     826              
     827              $C$DW$T$36      .dwtag  DW_TAG_structure_type
     828                      .dwattr $C$DW$T$36, DW_AT_name("ADCST_BITS")
     829                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
     830              $C$DW$81        .dwtag  DW_TAG_member
     831                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     832                      .dwattr $C$DW$81, DW_AT_name("INT_SEQ1")
     833                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_INT_SEQ1")
     834                      .dwattr $C$DW$81, DW_AT_bit_offset(0x0f)
     835                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
     836                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     837                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     838              
     839              $C$DW$82        .dwtag  DW_TAG_member
     840                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     841                      .dwattr $C$DW$82, DW_AT_name("INT_SEQ2")
     842                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_INT_SEQ2")
     843                      .dwattr $C$DW$82, DW_AT_bit_offset(0x0e)
     844                      .dwattr $C$DW$82, DW_AT_bit_size(0x01)
     845                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     846                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     847              
     848              $C$DW$83        .dwtag  DW_TAG_member
     849                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     850                      .dwattr $C$DW$83, DW_AT_name("SEQ1_BSY")
     851                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_SEQ1_BSY")
     852                      .dwattr $C$DW$83, DW_AT_bit_offset(0x0d)
     853                      .dwattr $C$DW$83, DW_AT_bit_size(0x01)
     854                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     855                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     856              
     857              $C$DW$84        .dwtag  DW_TAG_member
     858                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     859                      .dwattr $C$DW$84, DW_AT_name("SEQ2_BSY")
     860                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_SEQ2_BSY")
     861                      .dwattr $C$DW$84, DW_AT_bit_offset(0x0c)
     862                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
     863                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     864                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     865              
     866              $C$DW$85        .dwtag  DW_TAG_member
     867                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     868                      .dwattr $C$DW$85, DW_AT_name("INT_SEQ1_CLR")
     869                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_INT_SEQ1_CLR")
     870                      .dwattr $C$DW$85, DW_AT_bit_offset(0x0b)
     871                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
     872                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     873                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     874              
     875              $C$DW$86        .dwtag  DW_TAG_member
     876                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     877                      .dwattr $C$DW$86, DW_AT_name("INT_SEQ2_CLR")
     878                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_INT_SEQ2_CLR")
     879                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0a)
     880                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/DSP281x_GlobalVariableDefs.asm PAGE   17

     881                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     882                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     883              
     884              $C$DW$87        .dwtag  DW_TAG_member
     885                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     886                      .dwattr $C$DW$87, DW_AT_name("EOS_BUF1")
     887                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_EOS_BUF1")
     888                      .dwattr $C$DW$87, DW_AT_bit_offset(0x09)
     889                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
     890                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     891                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     892              
     893              $C$DW$88        .dwtag  DW_TAG_member
     894                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     895                      .dwattr $C$DW$88, DW_AT_name("EOS_BUF2")
     896                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_EOS_BUF2")
     897                      .dwattr $C$DW$88, DW_AT_bit_offset(0x08)
     898                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
     899                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     900                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     901              
     902              $C$DW$89        .dwtag  DW_TAG_member
     903                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     904                      .dwattr $C$DW$89, DW_AT_name("rsvd1")
     905                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_rsvd1")
     906                      .dwattr $C$DW$89, DW_AT_bit_offset(0x00)
     907                      .dwattr $C$DW$89, DW_AT_bit_size(0x08)
     908                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     909                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     910              
     911                      .dwendtag $C$DW$T$36
     912              
     913              
     914              $C$DW$T$37      .dwtag  DW_TAG_union_type
     915                      .dwattr $C$DW$T$37, DW_AT_name("ADCST_REG")
     916                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
     917              $C$DW$90        .dwtag  DW_TAG_member
     918                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     919                      .dwattr $C$DW$90, DW_AT_name("all")
     920                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_all")
     921                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     922                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     923              
     924              $C$DW$91        .dwtag  DW_TAG_member
     925                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$36)
     926                      .dwattr $C$DW$91, DW_AT_name("bit")
     927                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_bit")
     928                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     929                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     930              
     931                      .dwendtag $C$DW$T$37
     932              
     933              
     934              $C$DW$T$38      .dwtag  DW_TAG_structure_type
     935                      .dwattr $C$DW$T$38, DW_AT_name("ADCTRL1_BITS")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/DSP281x_GlobalVariableDefs.asm PAGE   18

     936                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
     937              $C$DW$92        .dwtag  DW_TAG_member
     938                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     939                      .dwattr $C$DW$92, DW_AT_name("rsvd1")
     940                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_rsvd1")
     941                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0c)
     942                      .dwattr $C$DW$92, DW_AT_bit_size(0x04)
     943                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     944                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     945              
     946              $C$DW$93        .dwtag  DW_TAG_member
     947                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     948                      .dwattr $C$DW$93, DW_AT_name("SEQ_CASC")
     949                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_SEQ_CASC")
     950                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0b)
     951                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
     952                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     953                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     954              
     955              $C$DW$94        .dwtag  DW_TAG_member
     956                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     957                      .dwattr $C$DW$94, DW_AT_name("SEQ_OVRD")
     958                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_SEQ_OVRD")
     959                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0a)
     960                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
     961                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     962                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     963              
     964              $C$DW$95        .dwtag  DW_TAG_member
     965                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     966                      .dwattr $C$DW$95, DW_AT_name("CONT_RUN")
     967                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_CONT_RUN")
     968                      .dwattr $C$DW$95, DW_AT_bit_offset(0x09)
     969                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
     970                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     971                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     972              
     973              $C$DW$96        .dwtag  DW_TAG_member
     974                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
     975                      .dwattr $C$DW$96, DW_AT_name("CPS")
     976                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_CPS")
     977                      .dwattr $C$DW$96, DW_AT_bit_offset(0x08)
     978                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
     979                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     980                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     981              
     982              $C$DW$97        .dwtag  DW_TAG_member
     983                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
     984                      .dwattr $C$DW$97, DW_AT_name("ACQ_PS")
     985                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_ACQ_PS")
     986                      .dwattr $C$DW$97, DW_AT_bit_offset(0x04)
     987                      .dwattr $C$DW$97, DW_AT_bit_size(0x04)
     988                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     989                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     990              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/DSP281x_GlobalVariableDefs.asm PAGE   19

     991              $C$DW$98        .dwtag  DW_TAG_member
     992                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
     993                      .dwattr $C$DW$98, DW_AT_name("SUSMOD")
     994                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_SUSMOD")
     995                      .dwattr $C$DW$98, DW_AT_bit_offset(0x02)
     996                      .dwattr $C$DW$98, DW_AT_bit_size(0x02)
     997                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     998                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     999              
    1000              $C$DW$99        .dwtag  DW_TAG_member
    1001                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1002                      .dwattr $C$DW$99, DW_AT_name("RESET")
    1003                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_RESET")
    1004                      .dwattr $C$DW$99, DW_AT_bit_offset(0x01)
    1005                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1006                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1007                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1008              
    1009              $C$DW$100       .dwtag  DW_TAG_member
    1010                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1011                      .dwattr $C$DW$100, DW_AT_name("rsvd2")
    1012                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd2")
    1013                      .dwattr $C$DW$100, DW_AT_bit_offset(0x00)
    1014                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1015                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1016                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1017              
    1018                      .dwendtag $C$DW$T$38
    1019              
    1020              
    1021              $C$DW$T$39      .dwtag  DW_TAG_union_type
    1022                      .dwattr $C$DW$T$39, DW_AT_name("ADCTRL1_REG")
    1023                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1024              $C$DW$101       .dwtag  DW_TAG_member
    1025                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1026                      .dwattr $C$DW$101, DW_AT_name("all")
    1027                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_all")
    1028                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1029                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1030              
    1031              $C$DW$102       .dwtag  DW_TAG_member
    1032                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$38)
    1033                      .dwattr $C$DW$102, DW_AT_name("bit")
    1034                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_bit")
    1035                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1036                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1037              
    1038                      .dwendtag $C$DW$T$39
    1039              
    1040              
    1041              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1042                      .dwattr $C$DW$T$40, DW_AT_name("ADCTRL2_BITS")
    1043                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1044              $C$DW$103       .dwtag  DW_TAG_member
    1045                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/DSP281x_GlobalVariableDefs.asm PAGE   20

    1046                      .dwattr $C$DW$103, DW_AT_name("EVB_SOC_SEQ2")
    1047                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_EVB_SOC_SEQ2")
    1048                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0f)
    1049                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1050                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1051                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1052              
    1053              $C$DW$104       .dwtag  DW_TAG_member
    1054                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1055                      .dwattr $C$DW$104, DW_AT_name("rsvd1")
    1056                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_rsvd1")
    1057                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0e)
    1058                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1059                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1060                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1061              
    1062              $C$DW$105       .dwtag  DW_TAG_member
    1063                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1064                      .dwattr $C$DW$105, DW_AT_name("INT_MOD_SEQ2")
    1065                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_INT_MOD_SEQ2")
    1066                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0d)
    1067                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1068                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1069                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1070              
    1071              $C$DW$106       .dwtag  DW_TAG_member
    1072                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1073                      .dwattr $C$DW$106, DW_AT_name("INT_ENA_SEQ2")
    1074                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_INT_ENA_SEQ2")
    1075                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0c)
    1076                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1077                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1078                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1079              
    1080              $C$DW$107       .dwtag  DW_TAG_member
    1081                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1082                      .dwattr $C$DW$107, DW_AT_name("rsvd2")
    1083                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_rsvd2")
    1084                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0b)
    1085                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1086                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1087                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1088              
    1089              $C$DW$108       .dwtag  DW_TAG_member
    1090                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1091                      .dwattr $C$DW$108, DW_AT_name("SOC_SEQ2")
    1092                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_SOC_SEQ2")
    1093                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0a)
    1094                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1095                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1096                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1097              
    1098              $C$DW$109       .dwtag  DW_TAG_member
    1099                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1100                      .dwattr $C$DW$109, DW_AT_name("RST_SEQ2")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/DSP281x_GlobalVariableDefs.asm PAGE   21

    1101                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_RST_SEQ2")
    1102                      .dwattr $C$DW$109, DW_AT_bit_offset(0x09)
    1103                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1104                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1105                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1106              
    1107              $C$DW$110       .dwtag  DW_TAG_member
    1108                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1109                      .dwattr $C$DW$110, DW_AT_name("EXT_SOC_SEQ1")
    1110                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_EXT_SOC_SEQ1")
    1111                      .dwattr $C$DW$110, DW_AT_bit_offset(0x08)
    1112                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1113                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1114                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1115              
    1116              $C$DW$111       .dwtag  DW_TAG_member
    1117                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1118                      .dwattr $C$DW$111, DW_AT_name("EVA_SOC_SEQ1")
    1119                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_EVA_SOC_SEQ1")
    1120                      .dwattr $C$DW$111, DW_AT_bit_offset(0x07)
    1121                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1122                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1123                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1124              
    1125              $C$DW$112       .dwtag  DW_TAG_member
    1126                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1127                      .dwattr $C$DW$112, DW_AT_name("rsvd3")
    1128                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_rsvd3")
    1129                      .dwattr $C$DW$112, DW_AT_bit_offset(0x06)
    1130                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1131                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1132                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1133              
    1134              $C$DW$113       .dwtag  DW_TAG_member
    1135                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1136                      .dwattr $C$DW$113, DW_AT_name("INT_MOD_SEQ1")
    1137                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_INT_MOD_SEQ1")
    1138                      .dwattr $C$DW$113, DW_AT_bit_offset(0x05)
    1139                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1140                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1141                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1142              
    1143              $C$DW$114       .dwtag  DW_TAG_member
    1144                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1145                      .dwattr $C$DW$114, DW_AT_name("INT_ENA_SEQ1")
    1146                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_INT_ENA_SEQ1")
    1147                      .dwattr $C$DW$114, DW_AT_bit_offset(0x04)
    1148                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1149                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1150                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1151              
    1152              $C$DW$115       .dwtag  DW_TAG_member
    1153                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1154                      .dwattr $C$DW$115, DW_AT_name("rsvd4")
    1155                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_rsvd4")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/DSP281x_GlobalVariableDefs.asm PAGE   22

    1156                      .dwattr $C$DW$115, DW_AT_bit_offset(0x03)
    1157                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1158                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1159                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1160              
    1161              $C$DW$116       .dwtag  DW_TAG_member
    1162                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1163                      .dwattr $C$DW$116, DW_AT_name("SOC_SEQ1")
    1164                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_SOC_SEQ1")
    1165                      .dwattr $C$DW$116, DW_AT_bit_offset(0x02)
    1166                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1167                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1168                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1169              
    1170              $C$DW$117       .dwtag  DW_TAG_member
    1171                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1172                      .dwattr $C$DW$117, DW_AT_name("RST_SEQ1")
    1173                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_RST_SEQ1")
    1174                      .dwattr $C$DW$117, DW_AT_bit_offset(0x01)
    1175                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1176                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1177                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1178              
    1179              $C$DW$118       .dwtag  DW_TAG_member
    1180                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1181                      .dwattr $C$DW$118, DW_AT_name("EVB_SOC_SEQ")
    1182                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_EVB_SOC_SEQ")
    1183                      .dwattr $C$DW$118, DW_AT_bit_offset(0x00)
    1184                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1185                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1186                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1187              
    1188                      .dwendtag $C$DW$T$40
    1189              
    1190              
    1191              $C$DW$T$41      .dwtag  DW_TAG_union_type
    1192                      .dwattr $C$DW$T$41, DW_AT_name("ADCTRL2_REG")
    1193                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1194              $C$DW$119       .dwtag  DW_TAG_member
    1195                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1196                      .dwattr $C$DW$119, DW_AT_name("all")
    1197                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_all")
    1198                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1199                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1200              
    1201              $C$DW$120       .dwtag  DW_TAG_member
    1202                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$40)
    1203                      .dwattr $C$DW$120, DW_AT_name("bit")
    1204                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_bit")
    1205                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1206                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1207              
    1208                      .dwendtag $C$DW$T$41
    1209              
    1210              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/DSP281x_GlobalVariableDefs.asm PAGE   23

    1211              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1212                      .dwattr $C$DW$T$42, DW_AT_name("ADCTRL3_BITS")
    1213                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1214              $C$DW$121       .dwtag  DW_TAG_member
    1215                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1216                      .dwattr $C$DW$121, DW_AT_name("SMODE_SEL")
    1217                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_SMODE_SEL")
    1218                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0f)
    1219                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1220                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1221                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1222              
    1223              $C$DW$122       .dwtag  DW_TAG_member
    1224                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1225                      .dwattr $C$DW$122, DW_AT_name("ADCCLKPS")
    1226                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_ADCCLKPS")
    1227                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0b)
    1228                      .dwattr $C$DW$122, DW_AT_bit_size(0x04)
    1229                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1230                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1231              
    1232              $C$DW$123       .dwtag  DW_TAG_member
    1233                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1234                      .dwattr $C$DW$123, DW_AT_name("ADCPWDN")
    1235                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_ADCPWDN")
    1236                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0a)
    1237                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1238                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1239                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1240              
    1241              $C$DW$124       .dwtag  DW_TAG_member
    1242                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1243                      .dwattr $C$DW$124, DW_AT_name("ADCBGRFDN")
    1244                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_ADCBGRFDN")
    1245                      .dwattr $C$DW$124, DW_AT_bit_offset(0x08)
    1246                      .dwattr $C$DW$124, DW_AT_bit_size(0x02)
    1247                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1248                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1249              
    1250              $C$DW$125       .dwtag  DW_TAG_member
    1251                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1252                      .dwattr $C$DW$125, DW_AT_name("ADCEXTREF")
    1253                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_ADCEXTREF")
    1254                      .dwattr $C$DW$125, DW_AT_bit_offset(0x07)
    1255                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1256                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1257                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1258              
    1259              $C$DW$126       .dwtag  DW_TAG_member
    1260                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1261                      .dwattr $C$DW$126, DW_AT_name("rsvd1")
    1262                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd1")
    1263                      .dwattr $C$DW$126, DW_AT_bit_offset(0x00)
    1264                      .dwattr $C$DW$126, DW_AT_bit_size(0x07)
    1265                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/DSP281x_GlobalVariableDefs.asm PAGE   24

    1266                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1267              
    1268                      .dwendtag $C$DW$T$42
    1269              
    1270              
    1271              $C$DW$T$43      .dwtag  DW_TAG_union_type
    1272                      .dwattr $C$DW$T$43, DW_AT_name("ADCTRL3_REG")
    1273                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1274              $C$DW$127       .dwtag  DW_TAG_member
    1275                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1276                      .dwattr $C$DW$127, DW_AT_name("all")
    1277                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_all")
    1278                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1279                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1280              
    1281              $C$DW$128       .dwtag  DW_TAG_member
    1282                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$42)
    1283                      .dwattr $C$DW$128, DW_AT_name("bit")
    1284                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_bit")
    1285                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1286                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1287              
    1288                      .dwendtag $C$DW$T$43
    1289              
    1290              
    1291              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1292                      .dwattr $C$DW$T$44, DW_AT_name("ADC_REGS")
    1293                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x1a)
    1294              $C$DW$129       .dwtag  DW_TAG_member
    1295                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$39)
    1296                      .dwattr $C$DW$129, DW_AT_name("ADCTRL1")
    1297                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_ADCTRL1")
    1298                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1299                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1300              
    1301              $C$DW$130       .dwtag  DW_TAG_member
    1302                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$41)
    1303                      .dwattr $C$DW$130, DW_AT_name("ADCTRL2")
    1304                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_ADCTRL2")
    1305                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1306                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1307              
    1308              $C$DW$131       .dwtag  DW_TAG_member
    1309                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$35)
    1310                      .dwattr $C$DW$131, DW_AT_name("ADCMAXCONV")
    1311                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_ADCMAXCONV")
    1312                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1313                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1314              
    1315              $C$DW$132       .dwtag  DW_TAG_member
    1316                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$27)
    1317                      .dwattr $C$DW$132, DW_AT_name("ADCCHSELSEQ1")
    1318                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_ADCCHSELSEQ1")
    1319                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1320                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/DSP281x_GlobalVariableDefs.asm PAGE   25

    1321              
    1322              $C$DW$133       .dwtag  DW_TAG_member
    1323                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$29)
    1324                      .dwattr $C$DW$133, DW_AT_name("ADCCHSELSEQ2")
    1325                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_ADCCHSELSEQ2")
    1326                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1327                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1328              
    1329              $C$DW$134       .dwtag  DW_TAG_member
    1330                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$31)
    1331                      .dwattr $C$DW$134, DW_AT_name("ADCCHSELSEQ3")
    1332                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_ADCCHSELSEQ3")
    1333                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1334                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1335              
    1336              $C$DW$135       .dwtag  DW_TAG_member
    1337                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$33)
    1338                      .dwattr $C$DW$135, DW_AT_name("ADCCHSELSEQ4")
    1339                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_ADCCHSELSEQ4")
    1340                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1341                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1342              
    1343              $C$DW$136       .dwtag  DW_TAG_member
    1344                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$25)
    1345                      .dwattr $C$DW$136, DW_AT_name("ADCASEQSR")
    1346                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_ADCASEQSR")
    1347                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1348                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1349              
    1350              $C$DW$137       .dwtag  DW_TAG_member
    1351                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1352                      .dwattr $C$DW$137, DW_AT_name("ADCRESULT0")
    1353                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_ADCRESULT0")
    1354                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1355                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1356              
    1357              $C$DW$138       .dwtag  DW_TAG_member
    1358                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1359                      .dwattr $C$DW$138, DW_AT_name("ADCRESULT1")
    1360                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_ADCRESULT1")
    1361                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1362                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1363              
    1364              $C$DW$139       .dwtag  DW_TAG_member
    1365                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1366                      .dwattr $C$DW$139, DW_AT_name("ADCRESULT2")
    1367                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_ADCRESULT2")
    1368                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1369                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1370              
    1371              $C$DW$140       .dwtag  DW_TAG_member
    1372                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1373                      .dwattr $C$DW$140, DW_AT_name("ADCRESULT3")
    1374                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_ADCRESULT3")
    1375                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/DSP281x_GlobalVariableDefs.asm PAGE   26

    1376                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1377              
    1378              $C$DW$141       .dwtag  DW_TAG_member
    1379                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1380                      .dwattr $C$DW$141, DW_AT_name("ADCRESULT4")
    1381                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_ADCRESULT4")
    1382                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1383                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1384              
    1385              $C$DW$142       .dwtag  DW_TAG_member
    1386                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1387                      .dwattr $C$DW$142, DW_AT_name("ADCRESULT5")
    1388                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_ADCRESULT5")
    1389                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1390                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1391              
    1392              $C$DW$143       .dwtag  DW_TAG_member
    1393                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1394                      .dwattr $C$DW$143, DW_AT_name("ADCRESULT6")
    1395                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_ADCRESULT6")
    1396                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1397                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1398              
    1399              $C$DW$144       .dwtag  DW_TAG_member
    1400                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1401                      .dwattr $C$DW$144, DW_AT_name("ADCRESULT7")
    1402                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_ADCRESULT7")
    1403                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1404                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1405              
    1406              $C$DW$145       .dwtag  DW_TAG_member
    1407                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1408                      .dwattr $C$DW$145, DW_AT_name("ADCRESULT8")
    1409                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_ADCRESULT8")
    1410                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1411                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1412              
    1413              $C$DW$146       .dwtag  DW_TAG_member
    1414                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1415                      .dwattr $C$DW$146, DW_AT_name("ADCRESULT9")
    1416                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_ADCRESULT9")
    1417                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1418                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1419              
    1420              $C$DW$147       .dwtag  DW_TAG_member
    1421                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1422                      .dwattr $C$DW$147, DW_AT_name("ADCRESULT10")
    1423                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_ADCRESULT10")
    1424                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1425                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1426              
    1427              $C$DW$148       .dwtag  DW_TAG_member
    1428                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1429                      .dwattr $C$DW$148, DW_AT_name("ADCRESULT11")
    1430                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_ADCRESULT11")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/DSP281x_GlobalVariableDefs.asm PAGE   27

    1431                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1432                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1433              
    1434              $C$DW$149       .dwtag  DW_TAG_member
    1435                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1436                      .dwattr $C$DW$149, DW_AT_name("ADCRESULT12")
    1437                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_ADCRESULT12")
    1438                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1439                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1440              
    1441              $C$DW$150       .dwtag  DW_TAG_member
    1442                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1443                      .dwattr $C$DW$150, DW_AT_name("ADCRESULT13")
    1444                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_ADCRESULT13")
    1445                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1446                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1447              
    1448              $C$DW$151       .dwtag  DW_TAG_member
    1449                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1450                      .dwattr $C$DW$151, DW_AT_name("ADCRESULT14")
    1451                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_ADCRESULT14")
    1452                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1453                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1454              
    1455              $C$DW$152       .dwtag  DW_TAG_member
    1456                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1457                      .dwattr $C$DW$152, DW_AT_name("ADCRESULT15")
    1458                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_ADCRESULT15")
    1459                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1460                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1461              
    1462              $C$DW$153       .dwtag  DW_TAG_member
    1463                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$43)
    1464                      .dwattr $C$DW$153, DW_AT_name("ADCTRL3")
    1465                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_ADCTRL3")
    1466                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1467                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1468              
    1469              $C$DW$154       .dwtag  DW_TAG_member
    1470                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$37)
    1471                      .dwattr $C$DW$154, DW_AT_name("ADCST")
    1472                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_ADCST")
    1473                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1474                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1475              
    1476                      .dwendtag $C$DW$T$44
    1477              
    1478              $C$DW$155       .dwtag  DW_TAG_TI_far_type
    1479                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$44)
    1480              
    1481              $C$DW$T$442     .dwtag  DW_TAG_volatile_type
    1482                      .dwattr $C$DW$T$442, DW_AT_type(*$C$DW$155)
    1483              
    1484              
    1485              $C$DW$T$45      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/DSP281x_GlobalVariableDefs.asm PAGE   28

    1486                      .dwattr $C$DW$T$45, DW_AT_name("CANAA_BITS")
    1487                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    1488              $C$DW$156       .dwtag  DW_TAG_member
    1489                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1490                      .dwattr $C$DW$156, DW_AT_name("AA0")
    1491                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_AA0")
    1492                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0f)
    1493                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    1494                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1495                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1496              
    1497              $C$DW$157       .dwtag  DW_TAG_member
    1498                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1499                      .dwattr $C$DW$157, DW_AT_name("AA1")
    1500                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_AA1")
    1501                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0e)
    1502                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    1503                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1504                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1505              
    1506              $C$DW$158       .dwtag  DW_TAG_member
    1507                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1508                      .dwattr $C$DW$158, DW_AT_name("AA2")
    1509                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_AA2")
    1510                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0d)
    1511                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    1512                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1513                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1514              
    1515              $C$DW$159       .dwtag  DW_TAG_member
    1516                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1517                      .dwattr $C$DW$159, DW_AT_name("AA3")
    1518                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_AA3")
    1519                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0c)
    1520                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    1521                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1522                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1523              
    1524              $C$DW$160       .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1526                      .dwattr $C$DW$160, DW_AT_name("AA4")
    1527                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_AA4")
    1528                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0b)
    1529                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    1530                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1531                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1532              
    1533              $C$DW$161       .dwtag  DW_TAG_member
    1534                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1535                      .dwattr $C$DW$161, DW_AT_name("AA5")
    1536                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_AA5")
    1537                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0a)
    1538                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    1539                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1540                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/DSP281x_GlobalVariableDefs.asm PAGE   29

    1541              
    1542              $C$DW$162       .dwtag  DW_TAG_member
    1543                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1544                      .dwattr $C$DW$162, DW_AT_name("AA6")
    1545                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_AA6")
    1546                      .dwattr $C$DW$162, DW_AT_bit_offset(0x09)
    1547                      .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    1548                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1549                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1550              
    1551              $C$DW$163       .dwtag  DW_TAG_member
    1552                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
