TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/eCanCtrl.asm     PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Tue Apr  8 10:05:53 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=softlib --hll_source=on --mem_model:code
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/repo/jabil2025/gpb/gpb_project_v3/eCanCtrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\repo\jabil2025\gpb\gpb_project_v3\projects\example_nonBIOS_ram\D
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("GpioMuxRegs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_GpioMuxRegs")

    1682 0000021c 0A43          INC       *-SP[3]               ; [CPU_ALU] |412| 
    1683 0000021d       $C$L16:    
    1684                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/eCanCtrl.c",line 411,column 9,is_stmt,isa 0
    1685 0000021d 0642          MOVL      ACC,*-SP[2]           ; [CPU_ALU] |411| 
    1686 0000021e FF40          SFR       ACC,1                 ; [CPU_ALU] |411| 
    1687 0000021f 1E42          MOVL      *-SP[2],ACC           ; [CPU_ALU] |411| 
    1688 00000220 40A9          TBIT      AL,#0                 ; [CPU_ALU] |411| 
    1689 00000221 6CFB          B         $C$L15,NTC            ; [CPU_ALU] |411| 
    1690                      ; branchcc occurs ; [] |411| 
    1691                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/eCanCtrl.c",line 413,column 3,is_stmt,isa 0
    1692              ;----------------------------------------------------------------------
    1693              ; 413 | return idx;                                                            
    1694              ;----------------------------------------------------------------------
    1695 00000222 9243          MOV       AL,*-SP[3]            ; [CPU_ALU] |413| 
    1696 00000223 6F08          B         $C$L19,UNC            ; [CPU_ALU] |413| 
    1697                      ; branch occurs ; [] |413| 
    1698 00000224       $C$L17:    
    1699                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/eCanCtrl.c",line 415,column 7,is_stmt,isa 0
    1700              ;----------------------------------------------------------------------
    1701              ; 415 | else if(n == 1)                                                        
    1702              ;----------------------------------------------------------------------
    1703 00000224 0201          MOVB      ACC,#1                ; [CPU_ALU] |415| 
    1704 00000225 0F42          CMPL      ACC,*-SP[2]           ; [CPU_ALU] |415| 
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/eCanCtrl.asm     PAGE   34

    1705 00000226 6003          B         $C$L18,NEQ            ; [CPU_ALU] |415| 
    1706                      ; branchcc occurs ; [] |415| 
    1707                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/eCanCtrl.c",line 416,column 3,is_stmt,isa 0
    1708              ;----------------------------------------------------------------------
    1709              ; 416 | return 0;                                                              
    1710              ; 417 | else                                                                   
    1711              ;----------------------------------------------------------------------
    1712 00000227 9A00          MOVB      AL,#0                 ; [CPU_ALU] |416| 
    1713 00000228 6F03          B         $C$L19,UNC            ; [CPU_ALU] |416| 
    1714                      ; branch occurs ; [] |416| 
    1715 00000229       $C$L18:    
    1716                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/eCanCtrl.c",line 418,column 3,is_stmt,isa 0
    1717              ;----------------------------------------------------------------------
    1718              ; 418 | return -1;                                                             
    1719              ;----------------------------------------------------------------------
    1720 00000229 28A9          MOV       AL,#-1                ; [CPU_ALU] |418| 
         0000022a FFFF 
    1721 0000022b       $C$L19:    
    1722                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/eCanCtrl.c",line 420,column 1,is_stmt,isa 0
    1723 0000022b FE84          SUBB      SP,#4                 ; [CPU_ARAU] 
    1724                      .dwcfi  cfa_offset, -2
    1725              $C$DW$42        .dwtag  DW_TAG_TI_branch
    1726                      .dwattr $C$DW$42, DW_AT_low_pc(0x00)
    1727                      .dwattr $C$DW$42, DW_AT_TI_return
    1728              
    1729 0000022c 0006          LRETR     ; [CPU_ALU] 
    1730                      ; return occurs ; [] 
    1731                      .dwattr $C$DW$38, DW_AT_TI_end_file("C:/repo/jabil2025/gpb/gpb_project_v3/eCanCtrl.c")
    1732                      .dwattr $C$DW$38, DW_AT_TI_end_line(0x1a4)
    1733                      .dwattr $C$DW$38, DW_AT_TI_end_column(0x01)
    1734                      .dwendentry
    1735                      .dwendtag $C$DW$38
    1736              
    1737              ;**************************************************************
    1738              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1739              ;**************************************************************
    1740                      .global _GpioMuxRegs
    1741                      .global _ECanaRegs
    1742                      .global _ECanaLAMRegs
    1743                      .global _ECanaMboxes
    1744              
    1745              ;***************************************************************
    1746              ;* TYPE INFORMATION                                            *
    1747              ;***************************************************************
    1748              
    1749              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1750                      .dwattr $C$DW$T$20, DW_AT_name("CANAA_BITS")
    1751                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    1752              $C$DW$43        .dwtag  DW_TAG_member
    1753                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
    1754                      .dwattr $C$DW$43, DW_AT_name("AA0")
    1755                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_AA0")
    1756                      .dwattr $C$DW$43, DW_AT_bit_offset(0x0f)
    1757                      .dwattr $C$DW$43, DW_AT_bit_size(0x01)
    1758                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/eCanCtrl.asm     PAGE   35

    1759                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
    1760              
    1761              $C$DW$44        .dwtag  DW_TAG_member
    1762                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
    1763                      .dwattr $C$DW$44, DW_AT_name("AA1")
    1764                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_AA1")
    1765                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0e)
    1766                      .dwattr $C$DW$44, DW_AT_bit_size(0x01)
    1767                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1768                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
    1769              
    1770              $C$DW$45        .dwtag  DW_TAG_member
    1771                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
    1772                      .dwattr $C$DW$45, DW_AT_name("AA2")
    1773                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_AA2")
    1774                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0d)
    1775                      .dwattr $C$DW$45, DW_AT_bit_size(0x01)
    1776                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1777                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
    1778              
    1779              $C$DW$46        .dwtag  DW_TAG_member
    1780                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
    1781                      .dwattr $C$DW$46, DW_AT_name("AA3")
    1782                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_AA3")
    1783                      .dwattr $C$DW$46, DW_AT_bit_offset(0x0c)
    1784                      .dwattr $C$DW$46, DW_AT_bit_size(0x01)
    1785                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1786                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1787              
    1788              $C$DW$47        .dwtag  DW_TAG_member
    1789                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
    1790                      .dwattr $C$DW$47, DW_AT_name("AA4")
    1791                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_AA4")
    1792                      .dwattr $C$DW$47, DW_AT_bit_offset(0x0b)
    1793                      .dwattr $C$DW$47, DW_AT_bit_size(0x01)
    1794                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1795                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
    1796              
    1797              $C$DW$48        .dwtag  DW_TAG_member
    1798                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
    1799                      .dwattr $C$DW$48, DW_AT_name("AA5")
    1800                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_AA5")
    1801                      .dwattr $C$DW$48, DW_AT_bit_offset(0x0a)
    1802                      .dwattr $C$DW$48, DW_AT_bit_size(0x01)
    1803                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1804                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1805              
    1806              $C$DW$49        .dwtag  DW_TAG_member
    1807                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
    1808                      .dwattr $C$DW$49, DW_AT_name("AA6")
    1809                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_AA6")
    1810                      .dwattr $C$DW$49, DW_AT_bit_offset(0x09)
    1811                      .dwattr $C$DW$49, DW_AT_bit_size(0x01)
    1812                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1813                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/eCanCtrl.asm     PAGE   36

    1814              
    1815              $C$DW$50        .dwtag  DW_TAG_member
    1816                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
    1817                      .dwattr $C$DW$50, DW_AT_name("AA7")
    1818                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_AA7")
    1819                      .dwattr $C$DW$50, DW_AT_bit_offset(0x08)
    1820                      .dwattr $C$DW$50, DW_AT_bit_size(0x01)
    1821                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1822                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1823              
    1824              $C$DW$51        .dwtag  DW_TAG_member
    1825                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
    1826                      .dwattr $C$DW$51, DW_AT_name("AA8")
    1827                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_AA8")
    1828                      .dwattr $C$DW$51, DW_AT_bit_offset(0x07)
    1829                      .dwattr $C$DW$51, DW_AT_bit_size(0x01)
    1830                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1831                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1832              
    1833              $C$DW$52        .dwtag  DW_TAG_member
    1834                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
    1835                      .dwattr $C$DW$52, DW_AT_name("AA9")
    1836                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_AA9")
    1837                      .dwattr $C$DW$52, DW_AT_bit_offset(0x06)
    1838                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
    1839                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1840                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1841              
    1842              $C$DW$53        .dwtag  DW_TAG_member
    1843                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
    1844                      .dwattr $C$DW$53, DW_AT_name("AA10")
    1845                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_AA10")
    1846                      .dwattr $C$DW$53, DW_AT_bit_offset(0x05)
    1847                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
    1848                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1849                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1850              
    1851              $C$DW$54        .dwtag  DW_TAG_member
    1852                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
    1853                      .dwattr $C$DW$54, DW_AT_name("AA11")
    1854                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_AA11")
    1855                      .dwattr $C$DW$54, DW_AT_bit_offset(0x04)
    1856                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
    1857                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1858                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1859              
    1860              $C$DW$55        .dwtag  DW_TAG_member
    1861                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
    1862                      .dwattr $C$DW$55, DW_AT_name("AA12")
    1863                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_AA12")
    1864                      .dwattr $C$DW$55, DW_AT_bit_offset(0x03)
    1865                      .dwattr $C$DW$55, DW_AT_bit_size(0x01)
    1866                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1867                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1868              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/eCanCtrl.asm     PAGE   37

    1869              $C$DW$56        .dwtag  DW_TAG_member
    1870                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
    1871                      .dwattr $C$DW$56, DW_AT_name("AA13")
    1872                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_AA13")
    1873                      .dwattr $C$DW$56, DW_AT_bit_offset(0x02)
    1874                      .dwattr $C$DW$56, DW_AT_bit_size(0x01)
    1875                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1876                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1877              
    1878              $C$DW$57        .dwtag  DW_TAG_member
    1879                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
    1880                      .dwattr $C$DW$57, DW_AT_name("AA14")
    1881                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_AA14")
    1882                      .dwattr $C$DW$57, DW_AT_bit_offset(0x01)
    1883                      .dwattr $C$DW$57, DW_AT_bit_size(0x01)
    1884                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1885                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1886              
    1887              $C$DW$58        .dwtag  DW_TAG_member
    1888                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
    1889                      .dwattr $C$DW$58, DW_AT_name("AA15")
    1890                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_AA15")
    1891                      .dwattr $C$DW$58, DW_AT_bit_offset(0x00)
    1892                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
    1893                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1894                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1895              
    1896              $C$DW$59        .dwtag  DW_TAG_member
    1897                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
    1898                      .dwattr $C$DW$59, DW_AT_name("AA16")
    1899                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_AA16")
    1900                      .dwattr $C$DW$59, DW_AT_bit_offset(0x0f)
    1901                      .dwattr $C$DW$59, DW_AT_bit_size(0x01)
    1902                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1903                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1904              
    1905              $C$DW$60        .dwtag  DW_TAG_member
    1906                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
    1907                      .dwattr $C$DW$60, DW_AT_name("AA17")
    1908                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_AA17")
    1909                      .dwattr $C$DW$60, DW_AT_bit_offset(0x0e)
    1910                      .dwattr $C$DW$60, DW_AT_bit_size(0x01)
    1911                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1912                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1913              
    1914              $C$DW$61        .dwtag  DW_TAG_member
    1915                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
    1916                      .dwattr $C$DW$61, DW_AT_name("AA18")
    1917                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_AA18")
    1918                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0d)
    1919                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
    1920                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1921                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1922              
    1923              $C$DW$62        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/eCanCtrl.asm     PAGE   38

    1924                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
    1925                      .dwattr $C$DW$62, DW_AT_name("AA19")
    1926                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_AA19")
    1927                      .dwattr $C$DW$62, DW_AT_bit_offset(0x0c)
    1928                      .dwattr $C$DW$62, DW_AT_bit_size(0x01)
    1929                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1930                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1931              
    1932              $C$DW$63        .dwtag  DW_TAG_member
    1933                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
    1934                      .dwattr $C$DW$63, DW_AT_name("AA20")
    1935                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_AA20")
    1936                      .dwattr $C$DW$63, DW_AT_bit_offset(0x0b)
    1937                      .dwattr $C$DW$63, DW_AT_bit_size(0x01)
    1938                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1939                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1940              
    1941              $C$DW$64        .dwtag  DW_TAG_member
    1942                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
    1943                      .dwattr $C$DW$64, DW_AT_name("AA21")
    1944                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_AA21")
    1945                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0a)
    1946                      .dwattr $C$DW$64, DW_AT_bit_size(0x01)
    1947                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1948                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1949              
    1950              $C$DW$65        .dwtag  DW_TAG_member
    1951                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
    1952                      .dwattr $C$DW$65, DW_AT_name("AA22")
    1953                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_AA22")
    1954                      .dwattr $C$DW$65, DW_AT_bit_offset(0x09)
    1955                      .dwattr $C$DW$65, DW_AT_bit_size(0x01)
    1956                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1957                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1958              
    1959              $C$DW$66        .dwtag  DW_TAG_member
    1960                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1961                      .dwattr $C$DW$66, DW_AT_name("AA23")
    1962                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_AA23")
    1963                      .dwattr $C$DW$66, DW_AT_bit_offset(0x08)
    1964                      .dwattr $C$DW$66, DW_AT_bit_size(0x01)
    1965                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1966                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1967              
    1968              $C$DW$67        .dwtag  DW_TAG_member
    1969                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1970                      .dwattr $C$DW$67, DW_AT_name("AA24")
    1971                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_AA24")
    1972                      .dwattr $C$DW$67, DW_AT_bit_offset(0x07)
    1973                      .dwattr $C$DW$67, DW_AT_bit_size(0x01)
    1974                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1975                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1976              
    1977              $C$DW$68        .dwtag  DW_TAG_member
    1978                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/eCanCtrl.asm     PAGE   39

    1979                      .dwattr $C$DW$68, DW_AT_name("AA25")
    1980                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_AA25")
    1981                      .dwattr $C$DW$68, DW_AT_bit_offset(0x06)
    1982                      .dwattr $C$DW$68, DW_AT_bit_size(0x01)
    1983                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1984                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1985              
    1986              $C$DW$69        .dwtag  DW_TAG_member
    1987                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1988                      .dwattr $C$DW$69, DW_AT_name("AA26")
    1989                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_AA26")
    1990                      .dwattr $C$DW$69, DW_AT_bit_offset(0x05)
    1991                      .dwattr $C$DW$69, DW_AT_bit_size(0x01)
    1992                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1993                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1994              
    1995              $C$DW$70        .dwtag  DW_TAG_member
    1996                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1997                      .dwattr $C$DW$70, DW_AT_name("AA27")
    1998                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_AA27")
    1999                      .dwattr $C$DW$70, DW_AT_bit_offset(0x04)
    2000                      .dwattr $C$DW$70, DW_AT_bit_size(0x01)
    2001                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2002                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    2003              
    2004              $C$DW$71        .dwtag  DW_TAG_member
    2005                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    2006                      .dwattr $C$DW$71, DW_AT_name("AA28")
    2007                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_AA28")
    2008                      .dwattr $C$DW$71, DW_AT_bit_offset(0x03)
    2009                      .dwattr $C$DW$71, DW_AT_bit_size(0x01)
    2010                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2011                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    2012              
    2013              $C$DW$72        .dwtag  DW_TAG_member
    2014                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    2015                      .dwattr $C$DW$72, DW_AT_name("AA29")
    2016                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_AA29")
    2017                      .dwattr $C$DW$72, DW_AT_bit_offset(0x02)
    2018                      .dwattr $C$DW$72, DW_AT_bit_size(0x01)
    2019                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2020                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    2021              
    2022              $C$DW$73        .dwtag  DW_TAG_member
    2023                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    2024                      .dwattr $C$DW$73, DW_AT_name("AA30")
    2025                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_AA30")
    2026                      .dwattr $C$DW$73, DW_AT_bit_offset(0x01)
    2027                      .dwattr $C$DW$73, DW_AT_bit_size(0x01)
    2028                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2029                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    2030              
    2031              $C$DW$74        .dwtag  DW_TAG_member
    2032                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    2033                      .dwattr $C$DW$74, DW_AT_name("AA31")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/eCanCtrl.asm     PAGE   40

    2034                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_AA31")
    2035                      .dwattr $C$DW$74, DW_AT_bit_offset(0x00)
    2036                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
    2037                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2038                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    2039              
    2040                      .dwendtag $C$DW$T$20
    2041              
    2042              
    2043              $C$DW$T$22      .dwtag  DW_TAG_union_type
    2044                      .dwattr $C$DW$T$22, DW_AT_name("CANAA_REG")
    2045                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    2046              $C$DW$75        .dwtag  DW_TAG_member
    2047                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$21)
    2048                      .dwattr $C$DW$75, DW_AT_name("all")
    2049                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_all")
    2050                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2051                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    2052              
    2053              $C$DW$76        .dwtag  DW_TAG_member
    2054                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$20)
    2055                      .dwattr $C$DW$76, DW_AT_name("bit")
    2056                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_bit")
    2057                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2058                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    2059              
    2060                      .dwendtag $C$DW$T$22
    2061              
    2062              
    2063              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2064                      .dwattr $C$DW$T$23, DW_AT_name("CANBTC_BITS")
    2065                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    2066              $C$DW$77        .dwtag  DW_TAG_member
    2067                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    2068                      .dwattr $C$DW$77, DW_AT_name("TSEG2REG")
    2069                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_TSEG2REG")
    2070                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0d)
    2071                      .dwattr $C$DW$77, DW_AT_bit_size(0x03)
    2072                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2073                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    2074              
    2075              $C$DW$78        .dwtag  DW_TAG_member
    2076                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    2077                      .dwattr $C$DW$78, DW_AT_name("TSEG1REG")
    2078                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_TSEG1REG")
    2079                      .dwattr $C$DW$78, DW_AT_bit_offset(0x09)
    2080                      .dwattr $C$DW$78, DW_AT_bit_size(0x04)
    2081                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2082                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    2083              
    2084              $C$DW$79        .dwtag  DW_TAG_member
    2085                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    2086                      .dwattr $C$DW$79, DW_AT_name("SAM")
    2087                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_SAM")
    2088                      .dwattr $C$DW$79, DW_AT_bit_offset(0x08)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/eCanCtrl.asm     PAGE   41

    2089                      .dwattr $C$DW$79, DW_AT_bit_size(0x01)
    2090                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2091                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    2092              
    2093              $C$DW$80        .dwtag  DW_TAG_member
    2094                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    2095                      .dwattr $C$DW$80, DW_AT_name("SJWREG")
    2096                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_SJWREG")
    2097                      .dwattr $C$DW$80, DW_AT_bit_offset(0x06)
    2098                      .dwattr $C$DW$80, DW_AT_bit_size(0x02)
    2099                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2100                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    2101              
    2102              $C$DW$81        .dwtag  DW_TAG_member
    2103                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    2104                      .dwattr $C$DW$81, DW_AT_name("rsvd1")
    2105                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_rsvd1")
    2106                      .dwattr $C$DW$81, DW_AT_bit_offset(0x00)
    2107                      .dwattr $C$DW$81, DW_AT_bit_size(0x06)
    2108                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2109                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    2110              
    2111              $C$DW$82        .dwtag  DW_TAG_member
    2112                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    2113                      .dwattr $C$DW$82, DW_AT_name("BRPREG")
    2114                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_BRPREG")
    2115                      .dwattr $C$DW$82, DW_AT_bit_offset(0x08)
    2116                      .dwattr $C$DW$82, DW_AT_bit_size(0x08)
    2117                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2118                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    2119              
    2120              $C$DW$83        .dwtag  DW_TAG_member
    2121                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    2122                      .dwattr $C$DW$83, DW_AT_name("rsvd2")
    2123                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_rsvd2")
    2124                      .dwattr $C$DW$83, DW_AT_bit_offset(0x00)
    2125                      .dwattr $C$DW$83, DW_AT_bit_size(0x08)
    2126                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2127                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    2128              
    2129                      .dwendtag $C$DW$T$23
    2130              
    2131              
    2132              $C$DW$T$24      .dwtag  DW_TAG_union_type
    2133                      .dwattr $C$DW$T$24, DW_AT_name("CANBTC_REG")
    2134                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    2135              $C$DW$84        .dwtag  DW_TAG_member
    2136                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$21)
    2137                      .dwattr $C$DW$84, DW_AT_name("all")
    2138                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_all")
    2139                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2140                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    2141              
    2142              $C$DW$85        .dwtag  DW_TAG_member
    2143                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/eCanCtrl.asm     PAGE   42

    2144                      .dwattr $C$DW$85, DW_AT_name("bit")
    2145                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_bit")
    2146                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2147                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    2148              
    2149                      .dwendtag $C$DW$T$24
    2150              
    2151              
    2152              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2153                      .dwattr $C$DW$T$25, DW_AT_name("CANES_BITS")
    2154                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    2155              $C$DW$86        .dwtag  DW_TAG_member
    2156                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    2157                      .dwattr $C$DW$86, DW_AT_name("TM")
    2158                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_TM")
    2159                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0f)
    2160                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
    2161                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2162                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    2163              
    2164              $C$DW$87        .dwtag  DW_TAG_member
    2165                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    2166                      .dwattr $C$DW$87, DW_AT_name("RM")
    2167                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_RM")
    2168                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0e)
    2169                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
    2170                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2171                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    2172              
    2173              $C$DW$88        .dwtag  DW_TAG_member
    2174                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    2175                      .dwattr $C$DW$88, DW_AT_name("rsvd1")
    2176                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_rsvd1")
    2177                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0d)
    2178                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    2179                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2180                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    2181              
    2182              $C$DW$89        .dwtag  DW_TAG_member
    2183                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    2184                      .dwattr $C$DW$89, DW_AT_name("PDA")
    2185                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_PDA")
    2186                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0c)
    2187                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    2188                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2189                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    2190              
    2191              $C$DW$90        .dwtag  DW_TAG_member
    2192                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    2193                      .dwattr $C$DW$90, DW_AT_name("CCE")
    2194                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_CCE")
    2195                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0b)
    2196                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    2197                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2198                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/eCanCtrl.asm     PAGE   43

    2199              
    2200              $C$DW$91        .dwtag  DW_TAG_member
    2201                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    2202                      .dwattr $C$DW$91, DW_AT_name("SMA")
    2203                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_SMA")
    2204                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0a)
    2205                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    2206                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2207                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    2208              
    2209              $C$DW$92        .dwtag  DW_TAG_member
    2210                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    2211                      .dwattr $C$DW$92, DW_AT_name("rsvd2")
    2212                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_rsvd2")
    2213                      .dwattr $C$DW$92, DW_AT_bit_offset(0x00)
    2214                      .dwattr $C$DW$92, DW_AT_bit_size(0x0a)
    2215                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2216                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    2217              
    2218              $C$DW$93        .dwtag  DW_TAG_member
    2219                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    2220                      .dwattr $C$DW$93, DW_AT_name("EW")
    2221                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_EW")
    2222                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0f)
    2223                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    2224                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2225                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    2226              
    2227              $C$DW$94        .dwtag  DW_TAG_member
    2228                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    2229                      .dwattr $C$DW$94, DW_AT_name("EP")
    2230                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_EP")
    2231                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0e)
    2232                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    2233                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2234                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    2235              
    2236              $C$DW$95        .dwtag  DW_TAG_member
    2237                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    2238                      .dwattr $C$DW$95, DW_AT_name("BO")
    2239                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_BO")
    2240                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0d)
    2241                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    2242                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2243                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    2244              
    2245              $C$DW$96        .dwtag  DW_TAG_member
    2246                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    2247                      .dwattr $C$DW$96, DW_AT_name("ACKE")
    2248                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_ACKE")
    2249                      .dwattr $C$DW$96, DW_AT_bit_offset(0x0c)
    2250                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    2251                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2252                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    2253              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/eCanCtrl.asm     PAGE   44

    2254              $C$DW$97        .dwtag  DW_TAG_member
    2255                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    2256                      .dwattr $C$DW$97, DW_AT_name("SE")
    2257                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_SE")
    2258                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0b)
    2259                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    2260                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2261                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    2262              
    2263              $C$DW$98        .dwtag  DW_TAG_member
    2264                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    2265                      .dwattr $C$DW$98, DW_AT_name("CRCE")
    2266                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_CRCE")
    2267                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0a)
    2268                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    2269                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2270                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    2271              
    2272              $C$DW$99        .dwtag  DW_TAG_member
    2273                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    2274                      .dwattr $C$DW$99, DW_AT_name("SA1")
    2275                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_SA1")
    2276                      .dwattr $C$DW$99, DW_AT_bit_offset(0x09)
    2277                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    2278                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2279                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2280              
    2281              $C$DW$100       .dwtag  DW_TAG_member
    2282                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    2283                      .dwattr $C$DW$100, DW_AT_name("BE")
    2284                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_BE")
    2285                      .dwattr $C$DW$100, DW_AT_bit_offset(0x08)
    2286                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    2287                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2288                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2289              
    2290              $C$DW$101       .dwtag  DW_TAG_member
    2291                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    2292                      .dwattr $C$DW$101, DW_AT_name("FE")
    2293                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_FE")
    2294                      .dwattr $C$DW$101, DW_AT_bit_offset(0x07)
    2295                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    2296                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2297                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2298              
    2299              $C$DW$102       .dwtag  DW_TAG_member
    2300                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    2301                      .dwattr $C$DW$102, DW_AT_name("rsvd3")
    2302                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_rsvd3")
    2303                      .dwattr $C$DW$102, DW_AT_bit_offset(0x00)
    2304                      .dwattr $C$DW$102, DW_AT_bit_size(0x07)
    2305                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2306                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2307              
    2308                      .dwendtag $C$DW$T$25
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/eCanCtrl.asm     PAGE   45

    2309              
    2310              
    2311              $C$DW$T$26      .dwtag  DW_TAG_union_type
    2312                      .dwattr $C$DW$T$26, DW_AT_name("CANES_REG")
    2313                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    2314              $C$DW$103       .dwtag  DW_TAG_member
    2315                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$21)
    2316                      .dwattr $C$DW$103, DW_AT_name("all")
    2317                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_all")
    2318                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2319                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2320              
    2321              $C$DW$104       .dwtag  DW_TAG_member
    2322                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$25)
    2323                      .dwattr $C$DW$104, DW_AT_name("bit")
    2324                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_bit")
    2325                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2326                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2327              
    2328                      .dwendtag $C$DW$T$26
    2329              
    2330              
    2331              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2332                      .dwattr $C$DW$T$27, DW_AT_name("CANGAM_BITS")
    2333                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    2334              $C$DW$105       .dwtag  DW_TAG_member
    2335                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    2336                      .dwattr $C$DW$105, DW_AT_name("GAM150")
    2337                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_GAM150")
    2338                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00)
    2339                      .dwattr $C$DW$105, DW_AT_bit_size(0x10)
    2340                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2341                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2342              
    2343              $C$DW$106       .dwtag  DW_TAG_member
    2344                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    2345                      .dwattr $C$DW$106, DW_AT_name("GAM2816")
    2346                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_GAM2816")
    2347                      .dwattr $C$DW$106, DW_AT_bit_offset(0x03)
    2348                      .dwattr $C$DW$106, DW_AT_bit_size(0x0d)
    2349                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2350                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2351              
    2352              $C$DW$107       .dwtag  DW_TAG_member
    2353                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    2354                      .dwattr $C$DW$107, DW_AT_name("rsvd")
    2355                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_rsvd")
    2356                      .dwattr $C$DW$107, DW_AT_bit_offset(0x01)
    2357                      .dwattr $C$DW$107, DW_AT_bit_size(0x02)
    2358                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2359                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2360              
    2361              $C$DW$108       .dwtag  DW_TAG_member
    2362                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    2363                      .dwattr $C$DW$108, DW_AT_name("AMI")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/eCanCtrl.asm     PAGE   46

    2364                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_AMI")
    2365                      .dwattr $C$DW$108, DW_AT_bit_offset(0x00)
    2366                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    2367                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2368                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2369              
    2370                      .dwendtag $C$DW$T$27
    2371              
    2372              
    2373              $C$DW$T$28      .dwtag  DW_TAG_union_type
    2374                      .dwattr $C$DW$T$28, DW_AT_name("CANGAM_REG")
    2375                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    2376              $C$DW$109       .dwtag  DW_TAG_member
    2377                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$21)
    2378                      .dwattr $C$DW$109, DW_AT_name("all")
    2379                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_all")
    2380                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2381                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2382              
    2383              $C$DW$110       .dwtag  DW_TAG_member
    2384                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$27)
    2385                      .dwattr $C$DW$110, DW_AT_name("bit")
    2386                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_bit")
    2387                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2388                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2389              
    2390                      .dwendtag $C$DW$T$28
    2391              
    2392              
    2393              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2394                      .dwattr $C$DW$T$29, DW_AT_name("CANGIF0_BITS")
    2395                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    2396              $C$DW$111       .dwtag  DW_TAG_member
    2397                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    2398                      .dwattr $C$DW$111, DW_AT_name("MIV0")
    2399                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_MIV0")
    2400                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0b)
    2401                      .dwattr $C$DW$111, DW_AT_bit_size(0x05)
    2402                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2403                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2404              
    2405              $C$DW$112       .dwtag  DW_TAG_member
    2406                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    2407                      .dwattr $C$DW$112, DW_AT_name("rsvd1")
    2408                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_rsvd1")
    2409                      .dwattr $C$DW$112, DW_AT_bit_offset(0x08)
    2410                      .dwattr $C$DW$112, DW_AT_bit_size(0x03)
    2411                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2412                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2413              
    2414              $C$DW$113       .dwtag  DW_TAG_member
    2415                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    2416                      .dwattr $C$DW$113, DW_AT_name("WLIF0")
    2417                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_WLIF0")
    2418                      .dwattr $C$DW$113, DW_AT_bit_offset(0x07)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/eCanCtrl.asm     PAGE   47

    2419                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    2420                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2421                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2422              
    2423              $C$DW$114       .dwtag  DW_TAG_member
    2424                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    2425                      .dwattr $C$DW$114, DW_AT_name("EPIF0")
    2426                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_EPIF0")
    2427                      .dwattr $C$DW$114, DW_AT_bit_offset(0x06)
    2428                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    2429                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2430                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2431              
    2432              $C$DW$115       .dwtag  DW_TAG_member
    2433                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    2434                      .dwattr $C$DW$115, DW_AT_name("BOIF0")
    2435                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_BOIF0")
    2436                      .dwattr $C$DW$115, DW_AT_bit_offset(0x05)
    2437                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    2438                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2439                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2440              
    2441              $C$DW$116       .dwtag  DW_TAG_member
    2442                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    2443                      .dwattr $C$DW$116, DW_AT_name("RMLIF0")
    2444                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_RMLIF0")
    2445                      .dwattr $C$DW$116, DW_AT_bit_offset(0x04)
    2446                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    2447                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2448                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2449              
    2450              $C$DW$117       .dwtag  DW_TAG_member
    2451                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    2452                      .dwattr $C$DW$117, DW_AT_name("WUIF0")
    2453                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_WUIF0")
    2454                      .dwattr $C$DW$117, DW_AT_bit_offset(0x03)
    2455                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    2456                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2457                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2458              
    2459              $C$DW$118       .dwtag  DW_TAG_member
    2460                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    2461                      .dwattr $C$DW$118, DW_AT_name("WDIF0")
    2462                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_WDIF0")
    2463                      .dwattr $C$DW$118, DW_AT_bit_offset(0x02)
    2464                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    2465                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2466                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2467              
    2468              $C$DW$119       .dwtag  DW_TAG_member
    2469                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    2470                      .dwattr $C$DW$119, DW_AT_name("AAIF0")
    2471                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_AAIF0")
    2472                      .dwattr $C$DW$119, DW_AT_bit_offset(0x01)
    2473                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/eCanCtrl.asm     PAGE   48

    2474                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2475                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2476              
    2477              $C$DW$120       .dwtag  DW_TAG_member
    2478                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    2479                      .dwattr $C$DW$120, DW_AT_name("GMIF0")
    2480                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GMIF0")
    2481                      .dwattr $C$DW$120, DW_AT_bit_offset(0x00)
    2482                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    2483                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2484                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2485              
    2486              $C$DW$121       .dwtag  DW_TAG_member
    2487                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    2488                      .dwattr $C$DW$121, DW_AT_name("TCOF0")
    2489                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_TCOF0")
    2490                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0f)
    2491                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    2492                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2493                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2494              
    2495              $C$DW$122       .dwtag  DW_TAG_member
    2496                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    2497                      .dwattr $C$DW$122, DW_AT_name("MTOF0")
    2498                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_MTOF0")
    2499                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0e)
    2500                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    2501                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2502                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2503              
    2504              $C$DW$123       .dwtag  DW_TAG_member
    2505                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    2506                      .dwattr $C$DW$123, DW_AT_name("rsvd2")
    2507                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_rsvd2")
    2508                      .dwattr $C$DW$123, DW_AT_bit_offset(0x00)
    2509                      .dwattr $C$DW$123, DW_AT_bit_size(0x0e)
    2510                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2511                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2512              
    2513                      .dwendtag $C$DW$T$29
    2514              
    2515              
    2516              $C$DW$T$30      .dwtag  DW_TAG_union_type
    2517                      .dwattr $C$DW$T$30, DW_AT_name("CANGIF0_REG")
    2518                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    2519              $C$DW$124       .dwtag  DW_TAG_member
    2520                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$21)
    2521                      .dwattr $C$DW$124, DW_AT_name("all")
    2522                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_all")
    2523                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2524                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2525              
    2526              $C$DW$125       .dwtag  DW_TAG_member
    2527                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$29)
    2528                      .dwattr $C$DW$125, DW_AT_name("bit")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/eCanCtrl.asm     PAGE   49

    2529                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_bit")
    2530                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2531                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2532              
    2533                      .dwendtag $C$DW$T$30
    2534              
    2535              
    2536              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2537                      .dwattr $C$DW$T$31, DW_AT_name("CANGIF1_BITS")
    2538                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    2539              $C$DW$126       .dwtag  DW_TAG_member
    2540                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    2541                      .dwattr $C$DW$126, DW_AT_name("MIV1")
    2542                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_MIV1")
    2543                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0b)
    2544                      .dwattr $C$DW$126, DW_AT_bit_size(0x05)
    2545                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2546                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2547              
    2548              $C$DW$127       .dwtag  DW_TAG_member
    2549                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    2550                      .dwattr $C$DW$127, DW_AT_name("rsvd1")
    2551                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_rsvd1")
    2552                      .dwattr $C$DW$127, DW_AT_bit_offset(0x08)
    2553                      .dwattr $C$DW$127, DW_AT_bit_size(0x03)
    2554                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2555                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2556              
    2557              $C$DW$128       .dwtag  DW_TAG_member
    2558                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    2559                      .dwattr $C$DW$128, DW_AT_name("WLIF1")
    2560                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_WLIF1")
    2561                      .dwattr $C$DW$128, DW_AT_bit_offset(0x07)
    2562                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    2563                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2564                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2565              
    2566              $C$DW$129       .dwtag  DW_TAG_member
    2567                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    2568                      .dwattr $C$DW$129, DW_AT_name("EPIF1")
    2569                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_EPIF1")
    2570                      .dwattr $C$DW$129, DW_AT_bit_offset(0x06)
    2571                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    2572                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2573                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2574              
    2575              $C$DW$130       .dwtag  DW_TAG_member
    2576                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2577                      .dwattr $C$DW$130, DW_AT_name("BOIF1")
    2578                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_BOIF1")
    2579                      .dwattr $C$DW$130, DW_AT_bit_offset(0x05)
    2580                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    2581                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2582                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2583              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/eCanCtrl.asm     PAGE   50

    2584              $C$DW$131       .dwtag  DW_TAG_member
    2585                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    2586                      .dwattr $C$DW$131, DW_AT_name("RMLIF1")
    2587                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_RMLIF1")
    2588                      .dwattr $C$DW$131, DW_AT_bit_offset(0x04)
    2589                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    2590                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2591                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2592              
    2593              $C$DW$132       .dwtag  DW_TAG_member
    2594                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    2595                      .dwattr $C$DW$132, DW_AT_name("WUIF1")
    2596                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_WUIF1")
    2597                      .dwattr $C$DW$132, DW_AT_bit_offset(0x03)
    2598                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    2599                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2600                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2601              
    2602              $C$DW$133       .dwtag  DW_TAG_member
    2603                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2604                      .dwattr $C$DW$133, DW_AT_name("WDIF1")
    2605                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_WDIF1")
    2606                      .dwattr $C$DW$133, DW_AT_bit_offset(0x02)
    2607                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    2608                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2609                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2610              
    2611              $C$DW$134       .dwtag  DW_TAG_member
    2612                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    2613                      .dwattr $C$DW$134, DW_AT_name("AAIF1")
    2614                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_AAIF1")
    2615                      .dwattr $C$DW$134, DW_AT_bit_offset(0x01)
    2616                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    2617                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2618                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2619              
    2620              $C$DW$135       .dwtag  DW_TAG_member
    2621                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2622                      .dwattr $C$DW$135, DW_AT_name("GMIF1")
    2623                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GMIF1")
    2624                      .dwattr $C$DW$135, DW_AT_bit_offset(0x00)
    2625                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    2626                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2627                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2628              
    2629              $C$DW$136       .dwtag  DW_TAG_member
    2630                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2631                      .dwattr $C$DW$136, DW_AT_name("TCOF1")
    2632                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_TCOF1")
    2633                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0f)
    2634                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    2635                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2636                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2637              
    2638              $C$DW$137       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/eCanCtrl.asm     PAGE   51

    2639                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2640                      .dwattr $C$DW$137, DW_AT_name("MTOF1")
    2641                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_MTOF1")
    2642                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0e)
    2643                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    2644                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2645                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2646              
    2647              $C$DW$138       .dwtag  DW_TAG_member
    2648                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2649                      .dwattr $C$DW$138, DW_AT_name("rsvd2")
    2650                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_rsvd2")
    2651                      .dwattr $C$DW$138, DW_AT_bit_offset(0x00)
    2652                      .dwattr $C$DW$138, DW_AT_bit_size(0x0e)
    2653                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2654                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2655              
    2656                      .dwendtag $C$DW$T$31
    2657              
    2658              
    2659              $C$DW$T$32      .dwtag  DW_TAG_union_type
    2660                      .dwattr $C$DW$T$32, DW_AT_name("CANGIF1_REG")
    2661                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    2662              $C$DW$139       .dwtag  DW_TAG_member
    2663                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$21)
    2664                      .dwattr $C$DW$139, DW_AT_name("all")
    2665                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_all")
    2666                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2667                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2668              
    2669              $C$DW$140       .dwtag  DW_TAG_member
    2670                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$31)
    2671                      .dwattr $C$DW$140, DW_AT_name("bit")
    2672                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_bit")
    2673                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2674                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2675              
    2676                      .dwendtag $C$DW$T$32
    2677              
    2678              
    2679              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2680                      .dwattr $C$DW$T$33, DW_AT_name("CANGIM_BITS")
    2681                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2682              $C$DW$141       .dwtag  DW_TAG_member
    2683                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    2684                      .dwattr $C$DW$141, DW_AT_name("I0EN")
    2685                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_I0EN")
    2686                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0f)
    2687                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    2688                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2689                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2690              
    2691              $C$DW$142       .dwtag  DW_TAG_member
    2692                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2693                      .dwattr $C$DW$142, DW_AT_name("I1EN")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/eCanCtrl.asm     PAGE   52

    2694                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_I1EN")
    2695                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0e)
    2696                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    2697                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2698                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2699              
    2700              $C$DW$143       .dwtag  DW_TAG_member
    2701                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2702                      .dwattr $C$DW$143, DW_AT_name("GIL")
    2703                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GIL")
    2704                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0d)
    2705                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    2706                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2707                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2708              
    2709              $C$DW$144       .dwtag  DW_TAG_member
    2710                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2711                      .dwattr $C$DW$144, DW_AT_name("rsvd1")
    2712                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_rsvd1")
    2713                      .dwattr $C$DW$144, DW_AT_bit_offset(0x08)
    2714                      .dwattr $C$DW$144, DW_AT_bit_size(0x05)
    2715                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2716                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2717              
    2718              $C$DW$145       .dwtag  DW_TAG_member
    2719                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2720                      .dwattr $C$DW$145, DW_AT_name("WLIM")
    2721                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_WLIM")
    2722                      .dwattr $C$DW$145, DW_AT_bit_offset(0x07)
    2723                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    2724                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2725                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2726              
    2727              $C$DW$146       .dwtag  DW_TAG_member
    2728                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2729                      .dwattr $C$DW$146, DW_AT_name("EPIM")
    2730                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_EPIM")
    2731                      .dwattr $C$DW$146, DW_AT_bit_offset(0x06)
    2732                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    2733                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2734                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2735              
    2736              $C$DW$147       .dwtag  DW_TAG_member
    2737                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    2738                      .dwattr $C$DW$147, DW_AT_name("BOIM")
    2739                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_BOIM")
    2740                      .dwattr $C$DW$147, DW_AT_bit_offset(0x05)
    2741                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    2742                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2743                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2744              
    2745              $C$DW$148       .dwtag  DW_TAG_member
    2746                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    2747                      .dwattr $C$DW$148, DW_AT_name("RMLIM")
    2748                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_RMLIM")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/eCanCtrl.asm     PAGE   53

    2749                      .dwattr $C$DW$148, DW_AT_bit_offset(0x04)
    2750                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    2751                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2752                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2753              
    2754              $C$DW$149       .dwtag  DW_TAG_member
    2755                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2756                      .dwattr $C$DW$149, DW_AT_name("WUIM")
    2757                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_WUIM")
    2758                      .dwattr $C$DW$149, DW_AT_bit_offset(0x03)
    2759                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    2760                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2761                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2762              
    2763              $C$DW$150       .dwtag  DW_TAG_member
    2764                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2765                      .dwattr $C$DW$150, DW_AT_name("WDIM")
    2766                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_WDIM")
    2767                      .dwattr $C$DW$150, DW_AT_bit_offset(0x02)
    2768                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    2769                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2770                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2771              
    2772              $C$DW$151       .dwtag  DW_TAG_member
    2773                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2774                      .dwattr $C$DW$151, DW_AT_name("AAIM")
    2775                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_AAIM")
    2776                      .dwattr $C$DW$151, DW_AT_bit_offset(0x01)
    2777                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    2778                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2779                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2780              
    2781              $C$DW$152       .dwtag  DW_TAG_member
    2782                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2783                      .dwattr $C$DW$152, DW_AT_name("rsvd2")
    2784                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_rsvd2")
    2785                      .dwattr $C$DW$152, DW_AT_bit_offset(0x00)
    2786                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    2787                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2788                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2789              
    2790              $C$DW$153       .dwtag  DW_TAG_member
    2791                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2792                      .dwattr $C$DW$153, DW_AT_name("TCOM")
    2793                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_TCOM")
    2794                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0f)
    2795                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    2796                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2797                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2798              
    2799              $C$DW$154       .dwtag  DW_TAG_member
    2800                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2801                      .dwattr $C$DW$154, DW_AT_name("MTOM")
    2802                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_MTOM")
    2803                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0e)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/eCanCtrl.asm     PAGE   54

    2804                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    2805                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2806                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2807              
    2808              $C$DW$155       .dwtag  DW_TAG_member
    2809                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2810                      .dwattr $C$DW$155, DW_AT_name("rsvd3")
    2811                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_rsvd3")
    2812                      .dwattr $C$DW$155, DW_AT_bit_offset(0x00)
    2813                      .dwattr $C$DW$155, DW_AT_bit_size(0x0e)
    2814                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2815                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2816              
    2817                      .dwendtag $C$DW$T$33
    2818              
    2819              
    2820              $C$DW$T$34      .dwtag  DW_TAG_union_type
    2821                      .dwattr $C$DW$T$34, DW_AT_name("CANGIM_REG")
    2822                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2823              $C$DW$156       .dwtag  DW_TAG_member
    2824                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$21)
    2825                      .dwattr $C$DW$156, DW_AT_name("all")
    2826                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_all")
    2827                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2828                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2829              
    2830              $C$DW$157       .dwtag  DW_TAG_member
    2831                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$33)
    2832                      .dwattr $C$DW$157, DW_AT_name("bit")
    2833                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_bit")
    2834                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2835                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2836              
    2837                      .dwendtag $C$DW$T$34
    2838              
    2839              
    2840              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2841                      .dwattr $C$DW$T$35, DW_AT_name("CANLAM_BITS")
    2842                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2843              $C$DW$158       .dwtag  DW_TAG_member
    2844                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2845                      .dwattr $C$DW$158, DW_AT_name("LAM_L")
    2846                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_LAM_L")
    2847                      .dwattr $C$DW$158, DW_AT_bit_offset(0x00)
    2848                      .dwattr $C$DW$158, DW_AT_bit_size(0x10)
    2849                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2850                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2851              
    2852              $C$DW$159       .dwtag  DW_TAG_member
    2853                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2854                      .dwattr $C$DW$159, DW_AT_name("LAM_H")
    2855                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_LAM_H")
    2856                      .dwattr $C$DW$159, DW_AT_bit_offset(0x03)
    2857                      .dwattr $C$DW$159, DW_AT_bit_size(0x0d)
    2858                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/eCanCtrl.asm     PAGE   55

    2859                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2860              
    2861              $C$DW$160       .dwtag  DW_TAG_member
    2862                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2863                      .dwattr $C$DW$160, DW_AT_name("rsvd1")
    2864                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd1")
    2865                      .dwattr $C$DW$160, DW_AT_bit_offset(0x01)
    2866                      .dwattr $C$DW$160, DW_AT_bit_size(0x02)
    2867                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2868                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2869              
    2870              $C$DW$161       .dwtag  DW_TAG_member
    2871                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2872                      .dwattr $C$DW$161, DW_AT_name("LAMI")
    2873                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_LAMI")
    2874                      .dwattr $C$DW$161, DW_AT_bit_offset(0x00)
    2875                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2876                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2877                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2878              
    2879                      .dwendtag $C$DW$T$35
    2880              
    2881              
    2882              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2883                      .dwattr $C$DW$T$36, DW_AT_name("CANLAM_REG")
    2884                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2885              $C$DW$162       .dwtag  DW_TAG_member
    2886                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$21)
    2887                      .dwattr $C$DW$162, DW_AT_name("all")
    2888                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_all")
    2889                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2890                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2891              
    2892              $C$DW$163       .dwtag  DW_TAG_member
    2893                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$35)
    2894                      .dwattr $C$DW$163, DW_AT_name("bit")
    2895                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_bit")
    2896                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2897                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2898              
    2899                      .dwendtag $C$DW$T$36
    2900              
    2901              
    2902              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2903                      .dwattr $C$DW$T$37, DW_AT_name("CANMC_BITS")
    2904                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2905              $C$DW$164       .dwtag  DW_TAG_member
    2906                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2907                      .dwattr $C$DW$164, DW_AT_name("MBNR")
    2908                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_MBNR")
    2909                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0b)
    2910                      .dwattr $C$DW$164, DW_AT_bit_size(0x05)
    2911                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2912                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2913              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/eCanCtrl.asm     PAGE   56

    2914              $C$DW$165       .dwtag  DW_TAG_member
    2915                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2916                      .dwattr $C$DW$165, DW_AT_name("SRES")
    2917                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_SRES")
    2918                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0a)
    2919                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    2920                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2921                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2922              
    2923              $C$DW$166       .dwtag  DW_TAG_member
    2924                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2925                      .dwattr $C$DW$166, DW_AT_name("STM")
    2926                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_STM")
    2927                      .dwattr $C$DW$166, DW_AT_bit_offset(0x09)
    2928                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    2929                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2930                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2931              
    2932              $C$DW$167       .dwtag  DW_TAG_member
    2933                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2934                      .dwattr $C$DW$167, DW_AT_name("ABO")
    2935                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_ABO")
    2936                      .dwattr $C$DW$167, DW_AT_bit_offset(0x08)
    2937                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    2938                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2939                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2940              
    2941              $C$DW$168       .dwtag  DW_TAG_member
    2942                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2943                      .dwattr $C$DW$168, DW_AT_name("CDR")
    2944                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_CDR")
    2945                      .dwattr $C$DW$168, DW_AT_bit_offset(0x07)
    2946                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    2947                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2948                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2949              
    2950              $C$DW$169       .dwtag  DW_TAG_member
    2951                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2952                      .dwattr $C$DW$169, DW_AT_name("WUBA")
    2953                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_WUBA")
    2954                      .dwattr $C$DW$169, DW_AT_bit_offset(0x06)
    2955                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    2956                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2957                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2958              
    2959              $C$DW$170       .dwtag  DW_TAG_member
    2960                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2961                      .dwattr $C$DW$170, DW_AT_name("DBO")
    2962                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_DBO")
    2963                      .dwattr $C$DW$170, DW_AT_bit_offset(0x05)
    2964                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    2965                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2966                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2967              
    2968              $C$DW$171       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/eCanCtrl.asm     PAGE   57

    2969                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2970                      .dwattr $C$DW$171, DW_AT_name("PDR")
    2971                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_PDR")
    2972                      .dwattr $C$DW$171, DW_AT_bit_offset(0x04)
    2973                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    2974                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2975                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2976              
    2977              $C$DW$172       .dwtag  DW_TAG_member
    2978                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2979                      .dwattr $C$DW$172, DW_AT_name("CCR")
    2980                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_CCR")
    2981                      .dwattr $C$DW$172, DW_AT_bit_offset(0x03)
    2982                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    2983                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2984                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2985              
    2986              $C$DW$173       .dwtag  DW_TAG_member
    2987                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2988                      .dwattr $C$DW$173, DW_AT_name("SCB")
    2989                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_SCB")
    2990                      .dwattr $C$DW$173, DW_AT_bit_offset(0x02)
    2991                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    2992                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2993                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2994              
    2995              $C$DW$174       .dwtag  DW_TAG_member
    2996                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2997                      .dwattr $C$DW$174, DW_AT_name("TCC")
    2998                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_TCC")
    2999                      .dwattr $C$DW$174, DW_AT_bit_offset(0x01)
    3000                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    3001                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3002                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3003              
    3004              $C$DW$175       .dwtag  DW_TAG_member
    3005                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    3006                      .dwattr $C$DW$175, DW_AT_name("MBCC")
    3007                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_MBCC")
    3008                      .dwattr $C$DW$175, DW_AT_bit_offset(0x00)
    3009                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    3010                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3011                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3012              
    3013              $C$DW$176       .dwtag  DW_TAG_member
    3014                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    3015                      .dwattr $C$DW$176, DW_AT_name("SUSP")
    3016                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_SUSP")
    3017                      .dwattr $C$DW$176, DW_AT_bit_offset(0x0f)
    3018                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    3019                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3020                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3021              
    3022              $C$DW$177       .dwtag  DW_TAG_member
    3023                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/eCanCtrl.asm     PAGE   58

    3024                      .dwattr $C$DW$177, DW_AT_name("rsvd")
    3025                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_rsvd")
    3026                      .dwattr $C$DW$177, DW_AT_bit_offset(0x00)
    3027                      .dwattr $C$DW$177, DW_AT_bit_size(0x0f)
    3028                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3029                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3030              
    3031                      .dwendtag $C$DW$T$37
    3032              
    3033              
    3034              $C$DW$T$38      .dwtag  DW_TAG_union_type
    3035                      .dwattr $C$DW$T$38, DW_AT_name("CANMC_REG")
    3036                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    3037              $C$DW$178       .dwtag  DW_TAG_member
    3038                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$21)
    3039                      .dwattr $C$DW$178, DW_AT_name("all")
    3040                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_all")
    3041                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
