TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Eeprom.asm       PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Tue Apr  8 10:05:52 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=softlib --hll_source=on --mem_model:code
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/repo/jabil2025/gpb/gpb_project_v3/Eeprom.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\repo\jabil2025\gpb\gpb_project_v3\projects\example_nonBIOS_ram\D
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    2631 0000020f 0742          ADDL      ACC,*-SP[2]           ; [CPU_ALU] |354| 
    2632 00000210 8AA9          MOVL      XAR4,ACC              ; [CPU_ALU] |354| 
    2633 00000211 0644          MOVL      ACC,*-SP[4]           ; [CPU_ALU] |354| 
    2634 00000212 B7C4          XOR       ACC,*+XAR4[0]         ; [CPU_ALU] |354| 
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Eeprom.asm       PAGE   56

    2635 00000213 9B00          MOVB      AH,#0                 ; [CPU_ALU] |354| 
    2636 00000214 90FF          ANDB      AL,#0xff              ; [CPU_ALU] |354| 
    2637 00000215 FF30          LSL       ACC,1                 ; [CPU_ALU] |354| 
    2638 00000216 8F00-         MOVL      XAR4,#_crctable       ; [CPU_ARAU] |354| 
         00000217 0000 
    2639 00000218 5601          ADDL      XAR4,ACC              ; [CPU_ALU] |354| 
         00000219 00A4 
    2640 0000021a 2901          CLRC      SXM                   ; [CPU_ALU] 
    2641 0000021b 0644          MOVL      ACC,*-SP[4]           ; [CPU_ALU] |354| 
    2642 0000021c FF47          SFR       ACC,8                 ; [CPU_ALU] |354| 
    2643 0000021d 70C4          XOR       AL,*+XAR4[0]          ; [CPU_ALU] |354| 
    2644 0000021e 71CC          XOR       AH,*+XAR4[1]          ; [CPU_ALU] |354| 
    2645 0000021f 1E44          MOVL      *-SP[4],ACC           ; [CPU_ALU] |354| 
    2646                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Eeprom.c",line 349,column 30,is_stmt,isa 0
    2647 00000220 0847          ADD       *-SP[7],#4            ; [CPU_ALU] |349| 
         00000221 0004 
    2648                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Eeprom.c",line 349,column 19,is_stmt,isa 0
    2649 00000222 9246          MOV       AL,*-SP[6]            ; [CPU_ALU] |349| 
    2650 00000223 5447          CMP       AL,*-SP[7]            ; [CPU_ALU] |349| 
    2651 00000224 66AA          B         $C$L53,HI             ; [CPU_ALU] |349| 
    2652                      ; branchcc occurs ; [] |349| 
    2653 00000225       $C$L54:    
    2654                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Eeprom.c",line 357,column 2,is_stmt,isa 0
    2655              ;----------------------------------------------------------------------
    2656              ; 357 | crc ^= CRC32_XOROT;                                                    
    2657              ;----------------------------------------------------------------------
    2658 00000225 1C44          XOR       *-SP[4],#65535        ; [CPU_ALU] |357| 
         00000226 FFFF 
    2659 00000227 1C43          XOR       *-SP[3],#65535        ; [CPU_ALU] |357| 
         00000228 FFFF 
    2660                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Eeprom.c",line 359,column 2,is_stmt,isa 0
    2661              ;----------------------------------------------------------------------
    2662              ; 359 | return crc;                                                            
    2663              ;----------------------------------------------------------------------
    2664 00000229 0644          MOVL      ACC,*-SP[4]           ; [CPU_ALU] |359| 
    2665                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Eeprom.c",line 361,column 1,is_stmt,isa 0
    2666 0000022a FE88          SUBB      SP,#8                 ; [CPU_ARAU] 
    2667                      .dwcfi  cfa_offset, -2
    2668              $C$DW$133       .dwtag  DW_TAG_TI_branch
    2669                      .dwattr $C$DW$133, DW_AT_low_pc(0x00)
    2670                      .dwattr $C$DW$133, DW_AT_TI_return
    2671              
    2672 0000022b 0006          LRETR     ; [CPU_ALU] 
    2673                      ; return occurs ; [] 
    2674                      .dwattr $C$DW$124, DW_AT_TI_end_file("C:/repo/jabil2025/gpb/gpb_project_v3/Eeprom.c")
    2675                      .dwattr $C$DW$124, DW_AT_TI_end_line(0x169)
    2676                      .dwattr $C$DW$124, DW_AT_TI_end_column(0x01)
    2677                      .dwendentry
    2678                      .dwendtag $C$DW$124
    2679              
    2680              ;**************************************************************
    2681              ;* UNDEFINED EXTERNAL REFERENCES                              *
    2682              ;**************************************************************
    2683                      .global _SpiTxNotReady
    2684                      .global _ConfigSpi
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Eeprom.asm       PAGE   57

    2685                      .global _TxSpi
    2686                      .global _SpiRxNotReady
    2687                      .global _RxSpi
    2688                      .global _FormatSpiTxWord
    2689                      .global _GpioDataRegs
    2690              
    2691              ;***************************************************************
    2692              ;* TYPE INFORMATION                                            *
    2693              ;***************************************************************
    2694              
    2695              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    2696                      .dwattr $C$DW$T$20, DW_AT_name("GPACLEAR_BITS")
    2697                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    2698              $C$DW$134       .dwtag  DW_TAG_member
    2699                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    2700                      .dwattr $C$DW$134, DW_AT_name("GPIOA0")
    2701                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIOA0")
    2702                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0f)
    2703                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    2704                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2705                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2706              
    2707              $C$DW$135       .dwtag  DW_TAG_member
    2708                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2709                      .dwattr $C$DW$135, DW_AT_name("GPIOA1")
    2710                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIOA1")
    2711                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0e)
    2712                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    2713                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2714                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2715              
    2716              $C$DW$136       .dwtag  DW_TAG_member
    2717                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2718                      .dwattr $C$DW$136, DW_AT_name("GPIOA2")
    2719                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIOA2")
    2720                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0d)
    2721                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    2722                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2723                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2724              
    2725              $C$DW$137       .dwtag  DW_TAG_member
    2726                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2727                      .dwattr $C$DW$137, DW_AT_name("GPIOA3")
    2728                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIOA3")
    2729                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0c)
    2730                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    2731                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2732                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2733              
    2734              $C$DW$138       .dwtag  DW_TAG_member
    2735                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2736                      .dwattr $C$DW$138, DW_AT_name("GPIOA4")
    2737                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIOA4")
    2738                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0b)
    2739                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Eeprom.asm       PAGE   58

    2740                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2741                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2742              
    2743              $C$DW$139       .dwtag  DW_TAG_member
    2744                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2745                      .dwattr $C$DW$139, DW_AT_name("GPIOA5")
    2746                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIOA5")
    2747                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0a)
    2748                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    2749                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2750                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2751              
    2752              $C$DW$140       .dwtag  DW_TAG_member
    2753                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    2754                      .dwattr $C$DW$140, DW_AT_name("GPIOA6")
    2755                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPIOA6")
    2756                      .dwattr $C$DW$140, DW_AT_bit_offset(0x09)
    2757                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    2758                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2759                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2760              
    2761              $C$DW$141       .dwtag  DW_TAG_member
    2762                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    2763                      .dwattr $C$DW$141, DW_AT_name("GPIOA7")
    2764                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPIOA7")
    2765                      .dwattr $C$DW$141, DW_AT_bit_offset(0x08)
    2766                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    2767                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2768                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2769              
    2770              $C$DW$142       .dwtag  DW_TAG_member
    2771                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2772                      .dwattr $C$DW$142, DW_AT_name("GPIOA8")
    2773                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPIOA8")
    2774                      .dwattr $C$DW$142, DW_AT_bit_offset(0x07)
    2775                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    2776                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2777                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2778              
    2779              $C$DW$143       .dwtag  DW_TAG_member
    2780                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2781                      .dwattr $C$DW$143, DW_AT_name("GPIOA9")
    2782                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPIOA9")
    2783                      .dwattr $C$DW$143, DW_AT_bit_offset(0x06)
    2784                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    2785                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2786                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2787              
    2788              $C$DW$144       .dwtag  DW_TAG_member
    2789                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2790                      .dwattr $C$DW$144, DW_AT_name("GPIOA10")
    2791                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIOA10")
    2792                      .dwattr $C$DW$144, DW_AT_bit_offset(0x05)
    2793                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    2794                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Eeprom.asm       PAGE   59

    2795                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2796              
    2797              $C$DW$145       .dwtag  DW_TAG_member
    2798                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2799                      .dwattr $C$DW$145, DW_AT_name("GPIOA11")
    2800                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIOA11")
    2801                      .dwattr $C$DW$145, DW_AT_bit_offset(0x04)
    2802                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    2803                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2804                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2805              
    2806              $C$DW$146       .dwtag  DW_TAG_member
    2807                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2808                      .dwattr $C$DW$146, DW_AT_name("GPIOA12")
    2809                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_GPIOA12")
    2810                      .dwattr $C$DW$146, DW_AT_bit_offset(0x03)
    2811                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    2812                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2813                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2814              
    2815              $C$DW$147       .dwtag  DW_TAG_member
    2816                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    2817                      .dwattr $C$DW$147, DW_AT_name("GPIOA13")
    2818                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_GPIOA13")
    2819                      .dwattr $C$DW$147, DW_AT_bit_offset(0x02)
    2820                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    2821                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2822                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2823              
    2824              $C$DW$148       .dwtag  DW_TAG_member
    2825                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    2826                      .dwattr $C$DW$148, DW_AT_name("GPIOA14")
    2827                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPIOA14")
    2828                      .dwattr $C$DW$148, DW_AT_bit_offset(0x01)
    2829                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    2830                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2831                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2832              
    2833              $C$DW$149       .dwtag  DW_TAG_member
    2834                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2835                      .dwattr $C$DW$149, DW_AT_name("GPIOA15")
    2836                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_GPIOA15")
    2837                      .dwattr $C$DW$149, DW_AT_bit_offset(0x00)
    2838                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    2839                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2840                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2841              
    2842                      .dwendtag $C$DW$T$20
    2843              
    2844              
    2845              $C$DW$T$21      .dwtag  DW_TAG_union_type
    2846                      .dwattr $C$DW$T$21, DW_AT_name("GPACLEAR_REG")
    2847                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    2848              $C$DW$150       .dwtag  DW_TAG_member
    2849                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Eeprom.asm       PAGE   60

    2850                      .dwattr $C$DW$150, DW_AT_name("all")
    2851                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_all")
    2852                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2853                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2854              
    2855              $C$DW$151       .dwtag  DW_TAG_member
    2856                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$20)
    2857                      .dwattr $C$DW$151, DW_AT_name("bit")
    2858                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_bit")
    2859                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2860                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2861              
    2862                      .dwendtag $C$DW$T$21
    2863              
    2864              
    2865              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2866                      .dwattr $C$DW$T$22, DW_AT_name("GPADAT_BITS")
    2867                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    2868              $C$DW$152       .dwtag  DW_TAG_member
    2869                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2870                      .dwattr $C$DW$152, DW_AT_name("GPIOA0")
    2871                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_GPIOA0")
    2872                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0f)
    2873                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    2874                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2875                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2876              
    2877              $C$DW$153       .dwtag  DW_TAG_member
    2878                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2879                      .dwattr $C$DW$153, DW_AT_name("GPIOA1")
    2880                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_GPIOA1")
    2881                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0e)
    2882                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    2883                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2884                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2885              
    2886              $C$DW$154       .dwtag  DW_TAG_member
    2887                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2888                      .dwattr $C$DW$154, DW_AT_name("GPIOA2")
    2889                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_GPIOA2")
    2890                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0d)
    2891                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    2892                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2893                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2894              
    2895              $C$DW$155       .dwtag  DW_TAG_member
    2896                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2897                      .dwattr $C$DW$155, DW_AT_name("GPIOA3")
    2898                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_GPIOA3")
    2899                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0c)
    2900                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    2901                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2902                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2903              
    2904              $C$DW$156       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Eeprom.asm       PAGE   61

    2905                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2906                      .dwattr $C$DW$156, DW_AT_name("GPIOA4")
    2907                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_GPIOA4")
    2908                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0b)
    2909                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    2910                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2911                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2912              
    2913              $C$DW$157       .dwtag  DW_TAG_member
    2914                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2915                      .dwattr $C$DW$157, DW_AT_name("GPIOA5")
    2916                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_GPIOA5")
    2917                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0a)
    2918                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    2919                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2920                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2921              
    2922              $C$DW$158       .dwtag  DW_TAG_member
    2923                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2924                      .dwattr $C$DW$158, DW_AT_name("GPIOA6")
    2925                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_GPIOA6")
    2926                      .dwattr $C$DW$158, DW_AT_bit_offset(0x09)
    2927                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    2928                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2929                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2930              
    2931              $C$DW$159       .dwtag  DW_TAG_member
    2932                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2933                      .dwattr $C$DW$159, DW_AT_name("GPIOA7")
    2934                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_GPIOA7")
    2935                      .dwattr $C$DW$159, DW_AT_bit_offset(0x08)
    2936                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    2937                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2938                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2939              
    2940              $C$DW$160       .dwtag  DW_TAG_member
    2941                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2942                      .dwattr $C$DW$160, DW_AT_name("GPIOA8")
    2943                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_GPIOA8")
    2944                      .dwattr $C$DW$160, DW_AT_bit_offset(0x07)
    2945                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    2946                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2947                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2948              
    2949              $C$DW$161       .dwtag  DW_TAG_member
    2950                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2951                      .dwattr $C$DW$161, DW_AT_name("GPIOA9")
    2952                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_GPIOA9")
    2953                      .dwattr $C$DW$161, DW_AT_bit_offset(0x06)
    2954                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2955                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2956                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2957              
    2958              $C$DW$162       .dwtag  DW_TAG_member
    2959                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Eeprom.asm       PAGE   62

    2960                      .dwattr $C$DW$162, DW_AT_name("GPIOA10")
    2961                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_GPIOA10")
    2962                      .dwattr $C$DW$162, DW_AT_bit_offset(0x05)
    2963                      .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    2964                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2965                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2966              
    2967              $C$DW$163       .dwtag  DW_TAG_member
    2968                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2969                      .dwattr $C$DW$163, DW_AT_name("GPIOA11")
    2970                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_GPIOA11")
    2971                      .dwattr $C$DW$163, DW_AT_bit_offset(0x04)
    2972                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    2973                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2974                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2975              
    2976              $C$DW$164       .dwtag  DW_TAG_member
    2977                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2978                      .dwattr $C$DW$164, DW_AT_name("GPIOA12")
    2979                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_GPIOA12")
    2980                      .dwattr $C$DW$164, DW_AT_bit_offset(0x03)
    2981                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    2982                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2983                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2984              
    2985              $C$DW$165       .dwtag  DW_TAG_member
    2986                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2987                      .dwattr $C$DW$165, DW_AT_name("GPIOA13")
    2988                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_GPIOA13")
    2989                      .dwattr $C$DW$165, DW_AT_bit_offset(0x02)
    2990                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    2991                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2992                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2993              
    2994              $C$DW$166       .dwtag  DW_TAG_member
    2995                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2996                      .dwattr $C$DW$166, DW_AT_name("GPIOA14")
    2997                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_GPIOA14")
    2998                      .dwattr $C$DW$166, DW_AT_bit_offset(0x01)
    2999                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    3000                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3001                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    3002              
    3003              $C$DW$167       .dwtag  DW_TAG_member
    3004                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    3005                      .dwattr $C$DW$167, DW_AT_name("GPIOA15")
    3006                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_GPIOA15")
    3007                      .dwattr $C$DW$167, DW_AT_bit_offset(0x00)
    3008                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    3009                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3010                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    3011              
    3012                      .dwendtag $C$DW$T$22
    3013              
    3014              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Eeprom.asm       PAGE   63

    3015              $C$DW$T$23      .dwtag  DW_TAG_union_type
    3016                      .dwattr $C$DW$T$23, DW_AT_name("GPADAT_REG")
    3017                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    3018              $C$DW$168       .dwtag  DW_TAG_member
    3019                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    3020                      .dwattr $C$DW$168, DW_AT_name("all")
    3021                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_all")
    3022                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3023                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    3024              
    3025              $C$DW$169       .dwtag  DW_TAG_member
    3026                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$22)
    3027                      .dwattr $C$DW$169, DW_AT_name("bit")
    3028                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_bit")
    3029                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3030                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3031              
    3032                      .dwendtag $C$DW$T$23
    3033              
    3034              
    3035              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    3036                      .dwattr $C$DW$T$24, DW_AT_name("GPASET_BITS")
    3037                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    3038              $C$DW$170       .dwtag  DW_TAG_member
    3039                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    3040                      .dwattr $C$DW$170, DW_AT_name("GPIOA0")
    3041                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_GPIOA0")
    3042                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0f)
    3043                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    3044                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3045                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3046              
    3047              $C$DW$171       .dwtag  DW_TAG_member
    3048                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    3049                      .dwattr $C$DW$171, DW_AT_name("GPIOA1")
    3050                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_GPIOA1")
    3051                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0e)
    3052                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    3053                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3054                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3055              
    3056              $C$DW$172       .dwtag  DW_TAG_member
    3057                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    3058                      .dwattr $C$DW$172, DW_AT_name("GPIOA2")
    3059                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_GPIOA2")
    3060                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0d)
    3061                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    3062                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3063                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3064              
    3065              $C$DW$173       .dwtag  DW_TAG_member
    3066                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    3067                      .dwattr $C$DW$173, DW_AT_name("GPIOA3")
    3068                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_GPIOA3")
    3069                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0c)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Eeprom.asm       PAGE   64

    3070                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    3071                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3072                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3073              
    3074              $C$DW$174       .dwtag  DW_TAG_member
    3075                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    3076                      .dwattr $C$DW$174, DW_AT_name("GPIOA4")
    3077                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_GPIOA4")
    3078                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0b)
    3079                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    3080                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3081                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3082              
    3083              $C$DW$175       .dwtag  DW_TAG_member
    3084                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    3085                      .dwattr $C$DW$175, DW_AT_name("GPIOA5")
    3086                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_GPIOA5")
    3087                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0a)
    3088                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    3089                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3090                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3091              
    3092              $C$DW$176       .dwtag  DW_TAG_member
    3093                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    3094                      .dwattr $C$DW$176, DW_AT_name("GPIOA6")
    3095                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_GPIOA6")
    3096                      .dwattr $C$DW$176, DW_AT_bit_offset(0x09)
    3097                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    3098                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3099                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3100              
    3101              $C$DW$177       .dwtag  DW_TAG_member
    3102                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    3103                      .dwattr $C$DW$177, DW_AT_name("GPIOA7")
    3104                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_GPIOA7")
    3105                      .dwattr $C$DW$177, DW_AT_bit_offset(0x08)
    3106                      .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    3107                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3108                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3109              
    3110              $C$DW$178       .dwtag  DW_TAG_member
    3111                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    3112                      .dwattr $C$DW$178, DW_AT_name("GPIOA8")
    3113                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_GPIOA8")
    3114                      .dwattr $C$DW$178, DW_AT_bit_offset(0x07)
    3115                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    3116                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3117                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3118              
    3119              $C$DW$179       .dwtag  DW_TAG_member
    3120                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    3121                      .dwattr $C$DW$179, DW_AT_name("GPIOA9")
    3122                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_GPIOA9")
    3123                      .dwattr $C$DW$179, DW_AT_bit_offset(0x06)
    3124                      .dwattr $C$DW$179, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Eeprom.asm       PAGE   65

    3125                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3126                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3127              
    3128              $C$DW$180       .dwtag  DW_TAG_member
    3129                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    3130                      .dwattr $C$DW$180, DW_AT_name("GPIOA10")
    3131                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_GPIOA10")
    3132                      .dwattr $C$DW$180, DW_AT_bit_offset(0x05)
    3133                      .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    3134                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3135                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3136              
    3137              $C$DW$181       .dwtag  DW_TAG_member
    3138                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    3139                      .dwattr $C$DW$181, DW_AT_name("GPIOA11")
    3140                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_GPIOA11")
    3141                      .dwattr $C$DW$181, DW_AT_bit_offset(0x04)
    3142                      .dwattr $C$DW$181, DW_AT_bit_size(0x01)
    3143                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3144                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3145              
    3146              $C$DW$182       .dwtag  DW_TAG_member
    3147                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    3148                      .dwattr $C$DW$182, DW_AT_name("GPIOA12")
    3149                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_GPIOA12")
    3150                      .dwattr $C$DW$182, DW_AT_bit_offset(0x03)
    3151                      .dwattr $C$DW$182, DW_AT_bit_size(0x01)
    3152                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3153                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3154              
    3155              $C$DW$183       .dwtag  DW_TAG_member
    3156                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    3157                      .dwattr $C$DW$183, DW_AT_name("GPIOA13")
    3158                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_GPIOA13")
    3159                      .dwattr $C$DW$183, DW_AT_bit_offset(0x02)
    3160                      .dwattr $C$DW$183, DW_AT_bit_size(0x01)
    3161                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3162                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3163              
    3164              $C$DW$184       .dwtag  DW_TAG_member
    3165                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    3166                      .dwattr $C$DW$184, DW_AT_name("GPIOA14")
    3167                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_GPIOA14")
    3168                      .dwattr $C$DW$184, DW_AT_bit_offset(0x01)
    3169                      .dwattr $C$DW$184, DW_AT_bit_size(0x01)
    3170                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3171                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3172              
    3173              $C$DW$185       .dwtag  DW_TAG_member
    3174                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    3175                      .dwattr $C$DW$185, DW_AT_name("GPIOA15")
    3176                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_GPIOA15")
    3177                      .dwattr $C$DW$185, DW_AT_bit_offset(0x00)
    3178                      .dwattr $C$DW$185, DW_AT_bit_size(0x01)
    3179                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Eeprom.asm       PAGE   66

    3180                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3181              
    3182                      .dwendtag $C$DW$T$24
    3183              
    3184              
    3185              $C$DW$T$25      .dwtag  DW_TAG_union_type
    3186                      .dwattr $C$DW$T$25, DW_AT_name("GPASET_REG")
    3187                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    3188              $C$DW$186       .dwtag  DW_TAG_member
    3189                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    3190                      .dwattr $C$DW$186, DW_AT_name("all")
    3191                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_all")
    3192                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3193                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3194              
    3195              $C$DW$187       .dwtag  DW_TAG_member
    3196                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$24)
    3197                      .dwattr $C$DW$187, DW_AT_name("bit")
    3198                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_bit")
    3199                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3200                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3201              
    3202                      .dwendtag $C$DW$T$25
    3203              
    3204              
    3205              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3206                      .dwattr $C$DW$T$26, DW_AT_name("GPATOGGLE_BITS")
    3207                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    3208              $C$DW$188       .dwtag  DW_TAG_member
    3209                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    3210                      .dwattr $C$DW$188, DW_AT_name("GPIOA0")
    3211                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_GPIOA0")
    3212                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0f)
    3213                      .dwattr $C$DW$188, DW_AT_bit_size(0x01)
    3214                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3215                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3216              
    3217              $C$DW$189       .dwtag  DW_TAG_member
    3218                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    3219                      .dwattr $C$DW$189, DW_AT_name("GPIOA1")
    3220                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_GPIOA1")
    3221                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0e)
    3222                      .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    3223                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3224                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3225              
    3226              $C$DW$190       .dwtag  DW_TAG_member
    3227                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    3228                      .dwattr $C$DW$190, DW_AT_name("GPIOA2")
    3229                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_GPIOA2")
    3230                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0d)
    3231                      .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    3232                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3233                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3234              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Eeprom.asm       PAGE   67

    3235              $C$DW$191       .dwtag  DW_TAG_member
    3236                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    3237                      .dwattr $C$DW$191, DW_AT_name("GPIOA3")
    3238                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_GPIOA3")
    3239                      .dwattr $C$DW$191, DW_AT_bit_offset(0x0c)
    3240                      .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    3241                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3242                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3243              
    3244              $C$DW$192       .dwtag  DW_TAG_member
    3245                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    3246                      .dwattr $C$DW$192, DW_AT_name("GPIOA4")
    3247                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_GPIOA4")
    3248                      .dwattr $C$DW$192, DW_AT_bit_offset(0x0b)
    3249                      .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    3250                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3251                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3252              
    3253              $C$DW$193       .dwtag  DW_TAG_member
    3254                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    3255                      .dwattr $C$DW$193, DW_AT_name("GPIOA5")
    3256                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_GPIOA5")
    3257                      .dwattr $C$DW$193, DW_AT_bit_offset(0x0a)
    3258                      .dwattr $C$DW$193, DW_AT_bit_size(0x01)
    3259                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3260                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3261              
    3262              $C$DW$194       .dwtag  DW_TAG_member
    3263                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    3264                      .dwattr $C$DW$194, DW_AT_name("GPIOA6")
    3265                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_GPIOA6")
    3266                      .dwattr $C$DW$194, DW_AT_bit_offset(0x09)
    3267                      .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    3268                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3269                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3270              
    3271              $C$DW$195       .dwtag  DW_TAG_member
    3272                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    3273                      .dwattr $C$DW$195, DW_AT_name("GPIOA7")
    3274                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_GPIOA7")
    3275                      .dwattr $C$DW$195, DW_AT_bit_offset(0x08)
    3276                      .dwattr $C$DW$195, DW_AT_bit_size(0x01)
    3277                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3278                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3279              
    3280              $C$DW$196       .dwtag  DW_TAG_member
    3281                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    3282                      .dwattr $C$DW$196, DW_AT_name("GPIOA8")
    3283                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_GPIOA8")
    3284                      .dwattr $C$DW$196, DW_AT_bit_offset(0x07)
    3285                      .dwattr $C$DW$196, DW_AT_bit_size(0x01)
    3286                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3287                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3288              
    3289              $C$DW$197       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Eeprom.asm       PAGE   68

    3290                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    3291                      .dwattr $C$DW$197, DW_AT_name("GPIOA9")
    3292                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_GPIOA9")
    3293                      .dwattr $C$DW$197, DW_AT_bit_offset(0x06)
    3294                      .dwattr $C$DW$197, DW_AT_bit_size(0x01)
    3295                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3296                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3297              
    3298              $C$DW$198       .dwtag  DW_TAG_member
    3299                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    3300                      .dwattr $C$DW$198, DW_AT_name("GPIOA10")
    3301                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_GPIOA10")
    3302                      .dwattr $C$DW$198, DW_AT_bit_offset(0x05)
    3303                      .dwattr $C$DW$198, DW_AT_bit_size(0x01)
    3304                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3305                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3306              
    3307              $C$DW$199       .dwtag  DW_TAG_member
    3308                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    3309                      .dwattr $C$DW$199, DW_AT_name("GPIOA11")
    3310                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_GPIOA11")
    3311                      .dwattr $C$DW$199, DW_AT_bit_offset(0x04)
    3312                      .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    3313                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3314                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3315              
    3316              $C$DW$200       .dwtag  DW_TAG_member
    3317                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    3318                      .dwattr $C$DW$200, DW_AT_name("GPIOA12")
    3319                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_GPIOA12")
    3320                      .dwattr $C$DW$200, DW_AT_bit_offset(0x03)
    3321                      .dwattr $C$DW$200, DW_AT_bit_size(0x01)
    3322                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3323                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3324              
    3325              $C$DW$201       .dwtag  DW_TAG_member
    3326                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    3327                      .dwattr $C$DW$201, DW_AT_name("GPIOA13")
    3328                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_GPIOA13")
    3329                      .dwattr $C$DW$201, DW_AT_bit_offset(0x02)
    3330                      .dwattr $C$DW$201, DW_AT_bit_size(0x01)
    3331                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3332                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3333              
    3334              $C$DW$202       .dwtag  DW_TAG_member
    3335                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    3336                      .dwattr $C$DW$202, DW_AT_name("GPIOA14")
    3337                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_GPIOA14")
    3338                      .dwattr $C$DW$202, DW_AT_bit_offset(0x01)
    3339                      .dwattr $C$DW$202, DW_AT_bit_size(0x01)
    3340                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3341                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3342              
    3343              $C$DW$203       .dwtag  DW_TAG_member
    3344                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Eeprom.asm       PAGE   69

    3345                      .dwattr $C$DW$203, DW_AT_name("GPIOA15")
    3346                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_GPIOA15")
    3347                      .dwattr $C$DW$203, DW_AT_bit_offset(0x00)
    3348                      .dwattr $C$DW$203, DW_AT_bit_size(0x01)
    3349                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3350                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3351              
    3352                      .dwendtag $C$DW$T$26
    3353              
    3354              
    3355              $C$DW$T$27      .dwtag  DW_TAG_union_type
    3356                      .dwattr $C$DW$T$27, DW_AT_name("GPATOGGLE_REG")
    3357                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    3358              $C$DW$204       .dwtag  DW_TAG_member
    3359                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    3360                      .dwattr $C$DW$204, DW_AT_name("all")
    3361                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_all")
    3362                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3363                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3364              
    3365              $C$DW$205       .dwtag  DW_TAG_member
    3366                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$26)
    3367                      .dwattr $C$DW$205, DW_AT_name("bit")
    3368                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_bit")
    3369                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3370                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3371              
    3372                      .dwendtag $C$DW$T$27
    3373              
    3374              
    3375              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    3376                      .dwattr $C$DW$T$28, DW_AT_name("GPBCLEAR_BITS")
    3377                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    3378              $C$DW$206       .dwtag  DW_TAG_member
    3379                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    3380                      .dwattr $C$DW$206, DW_AT_name("GPIOB0")
    3381                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_GPIOB0")
    3382                      .dwattr $C$DW$206, DW_AT_bit_offset(0x0f)
    3383                      .dwattr $C$DW$206, DW_AT_bit_size(0x01)
    3384                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3385                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3386              
    3387              $C$DW$207       .dwtag  DW_TAG_member
    3388                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    3389                      .dwattr $C$DW$207, DW_AT_name("GPIOB1")
    3390                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_GPIOB1")
    3391                      .dwattr $C$DW$207, DW_AT_bit_offset(0x0e)
    3392                      .dwattr $C$DW$207, DW_AT_bit_size(0x01)
    3393                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3394                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3395              
    3396              $C$DW$208       .dwtag  DW_TAG_member
    3397                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    3398                      .dwattr $C$DW$208, DW_AT_name("GPIOB2")
    3399                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_GPIOB2")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Eeprom.asm       PAGE   70

    3400                      .dwattr $C$DW$208, DW_AT_bit_offset(0x0d)
    3401                      .dwattr $C$DW$208, DW_AT_bit_size(0x01)
    3402                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3403                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3404              
    3405              $C$DW$209       .dwtag  DW_TAG_member
    3406                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    3407                      .dwattr $C$DW$209, DW_AT_name("GPIOB3")
    3408                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_GPIOB3")
    3409                      .dwattr $C$DW$209, DW_AT_bit_offset(0x0c)
    3410                      .dwattr $C$DW$209, DW_AT_bit_size(0x01)
    3411                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3412                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3413              
    3414              $C$DW$210       .dwtag  DW_TAG_member
    3415                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    3416                      .dwattr $C$DW$210, DW_AT_name("GPIOB4")
    3417                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_GPIOB4")
    3418                      .dwattr $C$DW$210, DW_AT_bit_offset(0x0b)
    3419                      .dwattr $C$DW$210, DW_AT_bit_size(0x01)
    3420                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3421                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3422              
    3423              $C$DW$211       .dwtag  DW_TAG_member
    3424                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    3425                      .dwattr $C$DW$211, DW_AT_name("GPIOB5")
    3426                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_GPIOB5")
    3427                      .dwattr $C$DW$211, DW_AT_bit_offset(0x0a)
    3428                      .dwattr $C$DW$211, DW_AT_bit_size(0x01)
    3429                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3430                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3431              
    3432              $C$DW$212       .dwtag  DW_TAG_member
    3433                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    3434                      .dwattr $C$DW$212, DW_AT_name("GPIOB6")
    3435                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_GPIOB6")
    3436                      .dwattr $C$DW$212, DW_AT_bit_offset(0x09)
    3437                      .dwattr $C$DW$212, DW_AT_bit_size(0x01)
    3438                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3439                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3440              
    3441              $C$DW$213       .dwtag  DW_TAG_member
    3442                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    3443                      .dwattr $C$DW$213, DW_AT_name("GPIOB7")
    3444                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_GPIOB7")
    3445                      .dwattr $C$DW$213, DW_AT_bit_offset(0x08)
    3446                      .dwattr $C$DW$213, DW_AT_bit_size(0x01)
    3447                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3448                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3449              
    3450              $C$DW$214       .dwtag  DW_TAG_member
    3451                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    3452                      .dwattr $C$DW$214, DW_AT_name("GPIOB8")
    3453                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_GPIOB8")
    3454                      .dwattr $C$DW$214, DW_AT_bit_offset(0x07)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Eeprom.asm       PAGE   71

    3455                      .dwattr $C$DW$214, DW_AT_bit_size(0x01)
    3456                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3457                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3458              
    3459              $C$DW$215       .dwtag  DW_TAG_member
    3460                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    3461                      .dwattr $C$DW$215, DW_AT_name("GPIOB9")
    3462                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_GPIOB9")
    3463                      .dwattr $C$DW$215, DW_AT_bit_offset(0x06)
    3464                      .dwattr $C$DW$215, DW_AT_bit_size(0x01)
    3465                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3466                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3467              
    3468              $C$DW$216       .dwtag  DW_TAG_member
    3469                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    3470                      .dwattr $C$DW$216, DW_AT_name("GPIOB10")
    3471                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_GPIOB10")
    3472                      .dwattr $C$DW$216, DW_AT_bit_offset(0x05)
    3473                      .dwattr $C$DW$216, DW_AT_bit_size(0x01)
    3474                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3475                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3476              
    3477              $C$DW$217       .dwtag  DW_TAG_member
    3478                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    3479                      .dwattr $C$DW$217, DW_AT_name("GPIOB11")
    3480                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_GPIOB11")
    3481                      .dwattr $C$DW$217, DW_AT_bit_offset(0x04)
    3482                      .dwattr $C$DW$217, DW_AT_bit_size(0x01)
    3483                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3484                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3485              
    3486              $C$DW$218       .dwtag  DW_TAG_member
    3487                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    3488                      .dwattr $C$DW$218, DW_AT_name("GPIOB12")
    3489                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_GPIOB12")
    3490                      .dwattr $C$DW$218, DW_AT_bit_offset(0x03)
    3491                      .dwattr $C$DW$218, DW_AT_bit_size(0x01)
    3492                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3493                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3494              
    3495              $C$DW$219       .dwtag  DW_TAG_member
    3496                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    3497                      .dwattr $C$DW$219, DW_AT_name("GPIOB13")
    3498                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_GPIOB13")
    3499                      .dwattr $C$DW$219, DW_AT_bit_offset(0x02)
    3500                      .dwattr $C$DW$219, DW_AT_bit_size(0x01)
    3501                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3502                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3503              
    3504              $C$DW$220       .dwtag  DW_TAG_member
    3505                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    3506                      .dwattr $C$DW$220, DW_AT_name("GPIOB14")
    3507                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_GPIOB14")
    3508                      .dwattr $C$DW$220, DW_AT_bit_offset(0x01)
    3509                      .dwattr $C$DW$220, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Eeprom.asm       PAGE   72

    3510                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3511                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3512              
    3513              $C$DW$221       .dwtag  DW_TAG_member
    3514                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    3515                      .dwattr $C$DW$221, DW_AT_name("GPIOB15")
    3516                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_GPIOB15")
    3517                      .dwattr $C$DW$221, DW_AT_bit_offset(0x00)
    3518                      .dwattr $C$DW$221, DW_AT_bit_size(0x01)
    3519                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3520                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3521              
    3522                      .dwendtag $C$DW$T$28
    3523              
    3524              
    3525              $C$DW$T$29      .dwtag  DW_TAG_union_type
    3526                      .dwattr $C$DW$T$29, DW_AT_name("GPBCLEAR_REG")
    3527                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    3528              $C$DW$222       .dwtag  DW_TAG_member
    3529                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    3530                      .dwattr $C$DW$222, DW_AT_name("all")
    3531                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_all")
    3532                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3533                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3534              
    3535              $C$DW$223       .dwtag  DW_TAG_member
    3536                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$28)
    3537                      .dwattr $C$DW$223, DW_AT_name("bit")
    3538                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_bit")
    3539                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3540                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3541              
    3542                      .dwendtag $C$DW$T$29
    3543              
    3544              
    3545              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3546                      .dwattr $C$DW$T$30, DW_AT_name("GPBDAT_BITS")
    3547                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    3548              $C$DW$224       .dwtag  DW_TAG_member
    3549                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    3550                      .dwattr $C$DW$224, DW_AT_name("GPIOB0")
    3551                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_GPIOB0")
    3552                      .dwattr $C$DW$224, DW_AT_bit_offset(0x0f)
    3553                      .dwattr $C$DW$224, DW_AT_bit_size(0x01)
    3554                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3555                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3556              
    3557              $C$DW$225       .dwtag  DW_TAG_member
    3558                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    3559                      .dwattr $C$DW$225, DW_AT_name("GPIOB1")
    3560                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_GPIOB1")
    3561                      .dwattr $C$DW$225, DW_AT_bit_offset(0x0e)
    3562                      .dwattr $C$DW$225, DW_AT_bit_size(0x01)
    3563                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3564                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Eeprom.asm       PAGE   73

    3565              
    3566              $C$DW$226       .dwtag  DW_TAG_member
    3567                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    3568                      .dwattr $C$DW$226, DW_AT_name("GPIOB2")
    3569                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_GPIOB2")
    3570                      .dwattr $C$DW$226, DW_AT_bit_offset(0x0d)
    3571                      .dwattr $C$DW$226, DW_AT_bit_size(0x01)
    3572                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3573                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3574              
    3575              $C$DW$227       .dwtag  DW_TAG_member
    3576                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
    3577                      .dwattr $C$DW$227, DW_AT_name("GPIOB3")
    3578                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_GPIOB3")
    3579                      .dwattr $C$DW$227, DW_AT_bit_offset(0x0c)
    3580                      .dwattr $C$DW$227, DW_AT_bit_size(0x01)
    3581                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3582                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3583              
    3584              $C$DW$228       .dwtag  DW_TAG_member
    3585                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    3586                      .dwattr $C$DW$228, DW_AT_name("GPIOB4")
    3587                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_GPIOB4")
    3588                      .dwattr $C$DW$228, DW_AT_bit_offset(0x0b)
    3589                      .dwattr $C$DW$228, DW_AT_bit_size(0x01)
    3590                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3591                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3592              
    3593              $C$DW$229       .dwtag  DW_TAG_member
    3594                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    3595                      .dwattr $C$DW$229, DW_AT_name("GPIOB5")
    3596                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_GPIOB5")
    3597                      .dwattr $C$DW$229, DW_AT_bit_offset(0x0a)
    3598                      .dwattr $C$DW$229, DW_AT_bit_size(0x01)
    3599                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3600                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3601              
    3602              $C$DW$230       .dwtag  DW_TAG_member
    3603                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    3604                      .dwattr $C$DW$230, DW_AT_name("GPIOB6")
    3605                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_GPIOB6")
    3606                      .dwattr $C$DW$230, DW_AT_bit_offset(0x09)
    3607                      .dwattr $C$DW$230, DW_AT_bit_size(0x01)
    3608                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3609                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3610              
    3611              $C$DW$231       .dwtag  DW_TAG_member
    3612                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    3613                      .dwattr $C$DW$231, DW_AT_name("GPIOB7")
    3614                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_GPIOB7")
    3615                      .dwattr $C$DW$231, DW_AT_bit_offset(0x08)
    3616                      .dwattr $C$DW$231, DW_AT_bit_size(0x01)
    3617                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3618                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3619              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Eeprom.asm       PAGE   74

    3620              $C$DW$232       .dwtag  DW_TAG_member
    3621                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    3622                      .dwattr $C$DW$232, DW_AT_name("GPIOB8")
    3623                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_GPIOB8")
    3624                      .dwattr $C$DW$232, DW_AT_bit_offset(0x07)
    3625                      .dwattr $C$DW$232, DW_AT_bit_size(0x01)
    3626                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3627                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3628              
    3629              $C$DW$233       .dwtag  DW_TAG_member
    3630                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
    3631                      .dwattr $C$DW$233, DW_AT_name("GPIOB9")
    3632                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_GPIOB9")
    3633                      .dwattr $C$DW$233, DW_AT_bit_offset(0x06)
    3634                      .dwattr $C$DW$233, DW_AT_bit_size(0x01)
    3635                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3636                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3637              
    3638              $C$DW$234       .dwtag  DW_TAG_member
    3639                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
    3640                      .dwattr $C$DW$234, DW_AT_name("GPIOB10")
    3641                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_GPIOB10")
    3642                      .dwattr $C$DW$234, DW_AT_bit_offset(0x05)
    3643                      .dwattr $C$DW$234, DW_AT_bit_size(0x01)
    3644                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3645                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3646              
    3647              $C$DW$235       .dwtag  DW_TAG_member
    3648                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
    3649                      .dwattr $C$DW$235, DW_AT_name("GPIOB11")
    3650                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_GPIOB11")
    3651                      .dwattr $C$DW$235, DW_AT_bit_offset(0x04)
    3652                      .dwattr $C$DW$235, DW_AT_bit_size(0x01)
    3653                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3654                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3655              
    3656              $C$DW$236       .dwtag  DW_TAG_member
    3657                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    3658                      .dwattr $C$DW$236, DW_AT_name("GPIOB12")
    3659                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_GPIOB12")
    3660                      .dwattr $C$DW$236, DW_AT_bit_offset(0x03)
    3661                      .dwattr $C$DW$236, DW_AT_bit_size(0x01)
    3662                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3663                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3664              
    3665              $C$DW$237       .dwtag  DW_TAG_member
    3666                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    3667                      .dwattr $C$DW$237, DW_AT_name("GPIOB13")
    3668                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_GPIOB13")
    3669                      .dwattr $C$DW$237, DW_AT_bit_offset(0x02)
    3670                      .dwattr $C$DW$237, DW_AT_bit_size(0x01)
    3671                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3672                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3673              
    3674              $C$DW$238       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Eeprom.asm       PAGE   75

    3675                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    3676                      .dwattr $C$DW$238, DW_AT_name("GPIOB14")
    3677                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_GPIOB14")
    3678                      .dwattr $C$DW$238, DW_AT_bit_offset(0x01)
    3679                      .dwattr $C$DW$238, DW_AT_bit_size(0x01)
    3680                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3681                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3682              
    3683              $C$DW$239       .dwtag  DW_TAG_member
    3684                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    3685                      .dwattr $C$DW$239, DW_AT_name("GPIOB15")
    3686                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_GPIOB15")
    3687                      .dwattr $C$DW$239, DW_AT_bit_offset(0x00)
    3688                      .dwattr $C$DW$239, DW_AT_bit_size(0x01)
    3689                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3690                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3691              
    3692                      .dwendtag $C$DW$T$30
    3693              
    3694              
    3695              $C$DW$T$31      .dwtag  DW_TAG_union_type
    3696                      .dwattr $C$DW$T$31, DW_AT_name("GPBDAT_REG")
    3697                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    3698              $C$DW$240       .dwtag  DW_TAG_member
    3699                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$19)
    3700                      .dwattr $C$DW$240, DW_AT_name("all")
    3701                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_all")
    3702                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3703                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3704              
    3705              $C$DW$241       .dwtag  DW_TAG_member
    3706                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$30)
    3707                      .dwattr $C$DW$241, DW_AT_name("bit")
    3708                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_bit")
    3709                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3710                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3711              
    3712                      .dwendtag $C$DW$T$31
    3713              
    3714              
    3715              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3716                      .dwattr $C$DW$T$32, DW_AT_name("GPBSET_BITS")
    3717                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    3718              $C$DW$242       .dwtag  DW_TAG_member
    3719                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    3720                      .dwattr $C$DW$242, DW_AT_name("GPIOB0")
    3721                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_GPIOB0")
    3722                      .dwattr $C$DW$242, DW_AT_bit_offset(0x0f)
    3723                      .dwattr $C$DW$242, DW_AT_bit_size(0x01)
    3724                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3725                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3726              
    3727              $C$DW$243       .dwtag  DW_TAG_member
    3728                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    3729                      .dwattr $C$DW$243, DW_AT_name("GPIOB1")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Eeprom.asm       PAGE   76

    3730                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_GPIOB1")
    3731                      .dwattr $C$DW$243, DW_AT_bit_offset(0x0e)
    3732                      .dwattr $C$DW$243, DW_AT_bit_size(0x01)
    3733                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3734                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3735              
    3736              $C$DW$244       .dwtag  DW_TAG_member
    3737                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    3738                      .dwattr $C$DW$244, DW_AT_name("GPIOB2")
    3739                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_GPIOB2")
    3740                      .dwattr $C$DW$244, DW_AT_bit_offset(0x0d)
    3741                      .dwattr $C$DW$244, DW_AT_bit_size(0x01)
    3742                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3743                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3744              
    3745              $C$DW$245       .dwtag  DW_TAG_member
    3746                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    3747                      .dwattr $C$DW$245, DW_AT_name("GPIOB3")
    3748                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_GPIOB3")
    3749                      .dwattr $C$DW$245, DW_AT_bit_offset(0x0c)
    3750                      .dwattr $C$DW$245, DW_AT_bit_size(0x01)
    3751                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3752                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3753              
    3754              $C$DW$246       .dwtag  DW_TAG_member
    3755                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    3756                      .dwattr $C$DW$246, DW_AT_name("GPIOB4")
    3757                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_GPIOB4")
    3758                      .dwattr $C$DW$246, DW_AT_bit_offset(0x0b)
    3759                      .dwattr $C$DW$246, DW_AT_bit_size(0x01)
    3760                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3761                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3762              
    3763              $C$DW$247       .dwtag  DW_TAG_member
    3764                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$19)
    3765                      .dwattr $C$DW$247, DW_AT_name("GPIOB5")
    3766                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_GPIOB5")
    3767                      .dwattr $C$DW$247, DW_AT_bit_offset(0x0a)
    3768                      .dwattr $C$DW$247, DW_AT_bit_size(0x01)
    3769                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3770                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3771              
    3772              $C$DW$248       .dwtag  DW_TAG_member
    3773                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
    3774                      .dwattr $C$DW$248, DW_AT_name("GPIOB6")
    3775                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_GPIOB6")
    3776                      .dwattr $C$DW$248, DW_AT_bit_offset(0x09)
    3777                      .dwattr $C$DW$248, DW_AT_bit_size(0x01)
    3778                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3779                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3780              
    3781              $C$DW$249       .dwtag  DW_TAG_member
    3782                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
    3783                      .dwattr $C$DW$249, DW_AT_name("GPIOB7")
    3784                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_GPIOB7")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Eeprom.asm       PAGE   77

    3785                      .dwattr $C$DW$249, DW_AT_bit_offset(0x08)
    3786                      .dwattr $C$DW$249, DW_AT_bit_size(0x01)
    3787                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3788                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3789              
    3790              $C$DW$250       .dwtag  DW_TAG_member
    3791                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
    3792                      .dwattr $C$DW$250, DW_AT_name("GPIOB8")
    3793                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_GPIOB8")
    3794                      .dwattr $C$DW$250, DW_AT_bit_offset(0x07)
    3795                      .dwattr $C$DW$250, DW_AT_bit_size(0x01)
    3796                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3797                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3798              
    3799              $C$DW$251       .dwtag  DW_TAG_member
    3800                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
    3801                      .dwattr $C$DW$251, DW_AT_name("GPIOB9")
    3802                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_GPIOB9")
    3803                      .dwattr $C$DW$251, DW_AT_bit_offset(0x06)
    3804                      .dwattr $C$DW$251, DW_AT_bit_size(0x01)
    3805                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3806                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3807              
    3808              $C$DW$252       .dwtag  DW_TAG_member
    3809                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$19)
    3810                      .dwattr $C$DW$252, DW_AT_name("GPIOB10")
    3811                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_GPIOB10")
    3812                      .dwattr $C$DW$252, DW_AT_bit_offset(0x05)
    3813                      .dwattr $C$DW$252, DW_AT_bit_size(0x01)
    3814                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3815                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3816              
    3817              $C$DW$253       .dwtag  DW_TAG_member
    3818                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$19)
    3819                      .dwattr $C$DW$253, DW_AT_name("GPIOB11")
    3820                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_GPIOB11")
    3821                      .dwattr $C$DW$253, DW_AT_bit_offset(0x04)
    3822                      .dwattr $C$DW$253, DW_AT_bit_size(0x01)
    3823                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3824                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3825              
    3826              $C$DW$254       .dwtag  DW_TAG_member
    3827                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$19)
    3828                      .dwattr $C$DW$254, DW_AT_name("GPIOB12")
    3829                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_GPIOB12")
    3830                      .dwattr $C$DW$254, DW_AT_bit_offset(0x03)
    3831                      .dwattr $C$DW$254, DW_AT_bit_size(0x01)
    3832                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3833                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3834              
    3835              $C$DW$255       .dwtag  DW_TAG_member
    3836                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$19)
    3837                      .dwattr $C$DW$255, DW_AT_name("GPIOB13")
    3838                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_GPIOB13")
    3839                      .dwattr $C$DW$255, DW_AT_bit_offset(0x02)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Eeprom.asm       PAGE   78

    3840                      .dwattr $C$DW$255, DW_AT_bit_size(0x01)
    3841                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3842                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3843              
    3844              $C$DW$256       .dwtag  DW_TAG_member
    3845                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$19)
    3846                      .dwattr $C$DW$256, DW_AT_name("GPIOB14")
    3847                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_GPIOB14")
    3848                      .dwattr $C$DW$256, DW_AT_bit_offset(0x01)
    3849                      .dwattr $C$DW$256, DW_AT_bit_size(0x01)
    3850                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3851                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3852              
    3853              $C$DW$257       .dwtag  DW_TAG_member
    3854                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    3855                      .dwattr $C$DW$257, DW_AT_name("GPIOB15")
    3856                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_GPIOB15")
    3857                      .dwattr $C$DW$257, DW_AT_bit_offset(0x00)
    3858                      .dwattr $C$DW$257, DW_AT_bit_size(0x01)
    3859                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3860                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3861              
    3862                      .dwendtag $C$DW$T$32
    3863              
    3864              
    3865              $C$DW$T$33      .dwtag  DW_TAG_union_type
    3866                      .dwattr $C$DW$T$33, DW_AT_name("GPBSET_REG")
    3867                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    3868              $C$DW$258       .dwtag  DW_TAG_member
    3869                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
    3870                      .dwattr $C$DW$258, DW_AT_name("all")
    3871                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_all")
    3872                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3873                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3874              
    3875              $C$DW$259       .dwtag  DW_TAG_member
    3876                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$32)
    3877                      .dwattr $C$DW$259, DW_AT_name("bit")
    3878                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_bit")
    3879                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3880                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3881              
    3882                      .dwendtag $C$DW$T$33
    3883              
    3884              
    3885              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3886                      .dwattr $C$DW$T$34, DW_AT_name("GPBTOGGLE_BITS")
    3887                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    3888              $C$DW$260       .dwtag  DW_TAG_member
    3889                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$19)
    3890                      .dwattr $C$DW$260, DW_AT_name("GPIOB0")
    3891                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_GPIOB0")
    3892                      .dwattr $C$DW$260, DW_AT_bit_offset(0x0f)
    3893                      .dwattr $C$DW$260, DW_AT_bit_size(0x01)
    3894                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Eeprom.asm       PAGE   79

    3895                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3896              
    3897              $C$DW$261       .dwtag  DW_TAG_member
    3898                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
    3899                      .dwattr $C$DW$261, DW_AT_name("GPIOB1")
    3900                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_GPIOB1")
    3901                      .dwattr $C$DW$261, DW_AT_bit_offset(0x0e)
    3902                      .dwattr $C$DW$261, DW_AT_bit_size(0x01)
    3903                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3904                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3905              
    3906              $C$DW$262       .dwtag  DW_TAG_member
    3907                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$19)
    3908                      .dwattr $C$DW$262, DW_AT_name("GPIOB2")
    3909                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_GPIOB2")
    3910                      .dwattr $C$DW$262, DW_AT_bit_offset(0x0d)
    3911                      .dwattr $C$DW$262, DW_AT_bit_size(0x01)
    3912                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3913                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3914              
    3915              $C$DW$263       .dwtag  DW_TAG_member
    3916                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
    3917                      .dwattr $C$DW$263, DW_AT_name("GPIOB3")
    3918                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_GPIOB3")
    3919                      .dwattr $C$DW$263, DW_AT_bit_offset(0x0c)
    3920                      .dwattr $C$DW$263, DW_AT_bit_size(0x01)
    3921                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3922                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3923              
    3924              $C$DW$264       .dwtag  DW_TAG_member
    3925                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$19)
    3926                      .dwattr $C$DW$264, DW_AT_name("GPIOB4")
    3927                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_GPIOB4")
    3928                      .dwattr $C$DW$264, DW_AT_bit_offset(0x0b)
    3929                      .dwattr $C$DW$264, DW_AT_bit_size(0x01)
    3930                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3931                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3932              
    3933              $C$DW$265       .dwtag  DW_TAG_member
    3934                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    3935                      .dwattr $C$DW$265, DW_AT_name("GPIOB5")
    3936                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_GPIOB5")
    3937                      .dwattr $C$DW$265, DW_AT_bit_offset(0x0a)
    3938                      .dwattr $C$DW$265, DW_AT_bit_size(0x01)
    3939                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3940                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3941              
    3942              $C$DW$266       .dwtag  DW_TAG_member
    3943                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
    3944                      .dwattr $C$DW$266, DW_AT_name("GPIOB6")
    3945                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_GPIOB6")
    3946                      .dwattr $C$DW$266, DW_AT_bit_offset(0x09)
    3947                      .dwattr $C$DW$266, DW_AT_bit_size(0x01)
    3948                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3949                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Eeprom.asm       PAGE   80

    3950              
    3951              $C$DW$267       .dwtag  DW_TAG_member
    3952                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$19)
    3953                      .dwattr $C$DW$267, DW_AT_name("GPIOB7")
    3954                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_GPIOB7")
    3955                      .dwattr $C$DW$267, DW_AT_bit_offset(0x08)
    3956                      .dwattr $C$DW$267, DW_AT_bit_size(0x01)
    3957                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3958                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3959              
    3960              $C$DW$268       .dwtag  DW_TAG_member
    3961                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$19)
    3962                      .dwattr $C$DW$268, DW_AT_name("GPIOB8")
    3963                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_GPIOB8")
    3964                      .dwattr $C$DW$268, DW_AT_bit_offset(0x07)
    3965                      .dwattr $C$DW$268, DW_AT_bit_size(0x01)
    3966                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3967                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3968              
    3969              $C$DW$269       .dwtag  DW_TAG_member
    3970                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$19)
    3971                      .dwattr $C$DW$269, DW_AT_name("GPIOB9")
    3972                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_GPIOB9")
    3973                      .dwattr $C$DW$269, DW_AT_bit_offset(0x06)
