TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Ev.asm           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Tue Apr  8 10:05:52 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=softlib --hll_source=on --mem_model:code
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/repo/jabil2025/gpb/gpb_project_v3/Ev.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\repo\jabil2025\gpb\gpb_project_v3\projects\example_nonBIOS_ram\D
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("EvaRegs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_EvaRegs")

     196                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Ev.c",line 129,column 2,is_stmt,isa 0
     197              ;----------------------------------------------------------------------
     198              ; 129 | EvaRegs.ACTRA.all = 0x0002;                     // PWM1 set for active
     199              ;     | high                                                                   
     200              ;----------------------------------------------------------------------
     201 0000002f 56BF!         MOVB      @$BLOCKED(_EvaRegs)+19,#2,UNC ; [CPU_ALU] |129| 
         00000030 0213 
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Ev.asm           PAGE    5

     202                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Ev.c",line 141,column 2,is_stmt,isa 0
     203              ;----------------------------------------------------------------------
     204              ; 141 | EvaRegs.COMCONA.all = 0x8221;           // Init COMCONA                
     205              ;----------------------------------------------------------------------
     206 00000031 2811!         MOV       @$BLOCKED(_EvaRegs)+17,#33313 ; [CPU_ALU] |141| 
         00000032 8221 
     207                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Ev.c",line 158,column 2,is_stmt,isa 0
     208              ;----------------------------------------------------------------------
     209              ; 158 | EvaRegs.T1CON.all = 0xC840;                     // Init T1CON, enable t
     210              ;     | imer                                                                   
     211              ;----------------------------------------------------------------------
     212 00000033 2804!         MOV       @$BLOCKED(_EvaRegs)+4,#51264 ; [CPU_ALU] |158| 
         00000034 C840 
     213                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Ev.c",line 176,column 2,is_stmt,isa 0
     214              ;----------------------------------------------------------------------
     215              ; 176 | EvaRegs.CAPCONA.all = 0x0000;           // reset the capture units     
     216              ;----------------------------------------------------------------------
     217 00000035 2B20!         MOV       @$BLOCKED(_EvaRegs)+32,#0 ; [CPU_ALU] |176| 
     218                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Ev.c",line 181,column 2,is_stmt,isa 0
     219              ;----------------------------------------------------------------------
     220              ; 181 | EvaRegs.CAPCONA.all = 0xA2C0;           // Init CAPCONA register       
     221              ; 196 | //      EvaRegs.EVAIMRC.bit.CAP1INT = 1;        // Enable CAPINT1      
     222              ; 197 | //      PieCtrlRegs.PIEIER3.bit.INTx5 = 1;      // Enable CAPINT1 in PI
     223              ;     | E group 3                                                              
     224              ; 198 | //      IER |= 0x0004;                                          // Enab
     225              ;     | le INT3 in IER to enable PIE group 3                                   
     226              ;----------------------------------------------------------------------
     227 00000036 2820!         MOV       @$BLOCKED(_EvaRegs)+32,#41664 ; [CPU_ALU] |181| 
         00000037 A2C0 
     228                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Ev.c",line 200,column 1,is_stmt,isa 0
     229              ;----------------------------------------------------------------------
     230              ; 200 | } // end InitEv()                                                      
     231              ;----------------------------------------------------------------------
     232              $C$DW$4 .dwtag  DW_TAG_TI_branch
     233                      .dwattr $C$DW$4, DW_AT_low_pc(0x00)
     234                      .dwattr $C$DW$4, DW_AT_TI_return
     235              
     236 00000038 0006          LRETR     ; [CPU_ALU] 
     237                      ; return occurs ; [] 
     238                      .dwattr $C$DW$3, DW_AT_TI_end_file("C:/repo/jabil2025/gpb/gpb_project_v3/Ev.c")
     239                      .dwattr $C$DW$3, DW_AT_TI_end_line(0xc8)
     240                      .dwattr $C$DW$3, DW_AT_TI_end_column(0x01)
     241                      .dwendentry
     242                      .dwendtag $C$DW$3
     243              
     244              ;**************************************************************
     245              ;* UNDEFINED EXTERNAL REFERENCES                              *
     246              ;**************************************************************
     247                      .global _EvaRegs
     248                      .global _EvbRegs
     249              
     250              ;***************************************************************
     251              ;* TYPE INFORMATION                                            *
     252              ;***************************************************************
     253              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Ev.asm           PAGE    6

     254              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     255                      .dwattr $C$DW$T$20, DW_AT_name("ACTRA_BITS")
     256                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     257              $C$DW$5 .dwtag  DW_TAG_member
     258                      .dwattr $C$DW$5, DW_AT_type(*$C$DW$T$19)
     259                      .dwattr $C$DW$5, DW_AT_name("CMP1ACT")
     260                      .dwattr $C$DW$5, DW_AT_TI_symbol_name("_CMP1ACT")
     261                      .dwattr $C$DW$5, DW_AT_bit_offset(0x0e)
     262                      .dwattr $C$DW$5, DW_AT_bit_size(0x02)
     263                      .dwattr $C$DW$5, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     264                      .dwattr $C$DW$5, DW_AT_accessibility(DW_ACCESS_public)
     265              
     266              $C$DW$6 .dwtag  DW_TAG_member
     267                      .dwattr $C$DW$6, DW_AT_type(*$C$DW$T$19)
     268                      .dwattr $C$DW$6, DW_AT_name("CMP2ACT")
     269                      .dwattr $C$DW$6, DW_AT_TI_symbol_name("_CMP2ACT")
     270                      .dwattr $C$DW$6, DW_AT_bit_offset(0x0c)
     271                      .dwattr $C$DW$6, DW_AT_bit_size(0x02)
     272                      .dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     273                      .dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)
     274              
     275              $C$DW$7 .dwtag  DW_TAG_member
     276                      .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$19)
     277                      .dwattr $C$DW$7, DW_AT_name("CMP3ACT")
     278                      .dwattr $C$DW$7, DW_AT_TI_symbol_name("_CMP3ACT")
     279                      .dwattr $C$DW$7, DW_AT_bit_offset(0x0a)
     280                      .dwattr $C$DW$7, DW_AT_bit_size(0x02)
     281                      .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     282                      .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     283              
     284              $C$DW$8 .dwtag  DW_TAG_member
     285                      .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$19)
     286                      .dwattr $C$DW$8, DW_AT_name("CMP4ACT")
     287                      .dwattr $C$DW$8, DW_AT_TI_symbol_name("_CMP4ACT")
     288                      .dwattr $C$DW$8, DW_AT_bit_offset(0x08)
     289                      .dwattr $C$DW$8, DW_AT_bit_size(0x02)
     290                      .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     291                      .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     292              
     293              $C$DW$9 .dwtag  DW_TAG_member
     294                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$19)
     295                      .dwattr $C$DW$9, DW_AT_name("CMP5ACT")
     296                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_CMP5ACT")
     297                      .dwattr $C$DW$9, DW_AT_bit_offset(0x06)
     298                      .dwattr $C$DW$9, DW_AT_bit_size(0x02)
     299                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     300                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     301              
     302              $C$DW$10        .dwtag  DW_TAG_member
     303                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
     304                      .dwattr $C$DW$10, DW_AT_name("CMP6ACT")
     305                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_CMP6ACT")
     306                      .dwattr $C$DW$10, DW_AT_bit_offset(0x04)
     307                      .dwattr $C$DW$10, DW_AT_bit_size(0x02)
     308                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Ev.asm           PAGE    7

     309                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     310              
     311              $C$DW$11        .dwtag  DW_TAG_member
     312                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$19)
     313                      .dwattr $C$DW$11, DW_AT_name("D")
     314                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_D")
     315                      .dwattr $C$DW$11, DW_AT_bit_offset(0x01)
     316                      .dwattr $C$DW$11, DW_AT_bit_size(0x03)
     317                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     318                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     319              
     320              $C$DW$12        .dwtag  DW_TAG_member
     321                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     322                      .dwattr $C$DW$12, DW_AT_name("SVRDIR")
     323                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_SVRDIR")
     324                      .dwattr $C$DW$12, DW_AT_bit_offset(0x00)
     325                      .dwattr $C$DW$12, DW_AT_bit_size(0x01)
     326                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     327                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     328              
     329                      .dwendtag $C$DW$T$20
     330              
     331              
     332              $C$DW$T$21      .dwtag  DW_TAG_union_type
     333                      .dwattr $C$DW$T$21, DW_AT_name("ACTRA_REG")
     334                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     335              $C$DW$13        .dwtag  DW_TAG_member
     336                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     337                      .dwattr $C$DW$13, DW_AT_name("all")
     338                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_all")
     339                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     340                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     341              
     342              $C$DW$14        .dwtag  DW_TAG_member
     343                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$20)
     344                      .dwattr $C$DW$14, DW_AT_name("bit")
     345                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_bit")
     346                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     347                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     348              
     349                      .dwendtag $C$DW$T$21
     350              
     351              
     352              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     353                      .dwattr $C$DW$T$22, DW_AT_name("ACTRB_BITS")
     354                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     355              $C$DW$15        .dwtag  DW_TAG_member
     356                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     357                      .dwattr $C$DW$15, DW_AT_name("CMP7ACT")
     358                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_CMP7ACT")
     359                      .dwattr $C$DW$15, DW_AT_bit_offset(0x0e)
     360                      .dwattr $C$DW$15, DW_AT_bit_size(0x02)
     361                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     362                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     363              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Ev.asm           PAGE    8

     364              $C$DW$16        .dwtag  DW_TAG_member
     365                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     366                      .dwattr $C$DW$16, DW_AT_name("CMP8ACT")
     367                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_CMP8ACT")
     368                      .dwattr $C$DW$16, DW_AT_bit_offset(0x0c)
     369                      .dwattr $C$DW$16, DW_AT_bit_size(0x02)
     370                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     371                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     372              
     373              $C$DW$17        .dwtag  DW_TAG_member
     374                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     375                      .dwattr $C$DW$17, DW_AT_name("CMP9ACT")
     376                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_CMP9ACT")
     377                      .dwattr $C$DW$17, DW_AT_bit_offset(0x0a)
     378                      .dwattr $C$DW$17, DW_AT_bit_size(0x02)
     379                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     380                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     381              
     382              $C$DW$18        .dwtag  DW_TAG_member
     383                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     384                      .dwattr $C$DW$18, DW_AT_name("CMP10ACT")
     385                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_CMP10ACT")
     386                      .dwattr $C$DW$18, DW_AT_bit_offset(0x08)
     387                      .dwattr $C$DW$18, DW_AT_bit_size(0x02)
     388                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     389                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     390              
     391              $C$DW$19        .dwtag  DW_TAG_member
     392                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     393                      .dwattr $C$DW$19, DW_AT_name("CMP11ACT")
     394                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_CMP11ACT")
     395                      .dwattr $C$DW$19, DW_AT_bit_offset(0x06)
     396                      .dwattr $C$DW$19, DW_AT_bit_size(0x02)
     397                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     398                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     399              
     400              $C$DW$20        .dwtag  DW_TAG_member
     401                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     402                      .dwattr $C$DW$20, DW_AT_name("CMP12ACT")
     403                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_CMP12ACT")
     404                      .dwattr $C$DW$20, DW_AT_bit_offset(0x04)
     405                      .dwattr $C$DW$20, DW_AT_bit_size(0x02)
     406                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     407                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     408              
     409              $C$DW$21        .dwtag  DW_TAG_member
     410                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     411                      .dwattr $C$DW$21, DW_AT_name("D")
     412                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_D")
     413                      .dwattr $C$DW$21, DW_AT_bit_offset(0x01)
     414                      .dwattr $C$DW$21, DW_AT_bit_size(0x03)
     415                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     416                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     417              
     418              $C$DW$22        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Ev.asm           PAGE    9

     419                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     420                      .dwattr $C$DW$22, DW_AT_name("SVRDIR")
     421                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_SVRDIR")
     422                      .dwattr $C$DW$22, DW_AT_bit_offset(0x00)
     423                      .dwattr $C$DW$22, DW_AT_bit_size(0x01)
     424                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     425                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     426              
     427                      .dwendtag $C$DW$T$22
     428              
     429              
     430              $C$DW$T$23      .dwtag  DW_TAG_union_type
     431                      .dwattr $C$DW$T$23, DW_AT_name("ACTRB_REG")
     432                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     433              $C$DW$23        .dwtag  DW_TAG_member
     434                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     435                      .dwattr $C$DW$23, DW_AT_name("all")
     436                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_all")
     437                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     438                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     439              
     440              $C$DW$24        .dwtag  DW_TAG_member
     441                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$22)
     442                      .dwattr $C$DW$24, DW_AT_name("bit")
     443                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_bit")
     444                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     445                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     446              
     447                      .dwendtag $C$DW$T$23
     448              
     449              
     450              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     451                      .dwattr $C$DW$T$24, DW_AT_name("CAPCONA_BITS")
     452                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     453              $C$DW$25        .dwtag  DW_TAG_member
     454                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     455                      .dwattr $C$DW$25, DW_AT_name("rsvd1")
     456                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_rsvd1")
     457                      .dwattr $C$DW$25, DW_AT_bit_offset(0x0e)
     458                      .dwattr $C$DW$25, DW_AT_bit_size(0x02)
     459                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     460                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     461              
     462              $C$DW$26        .dwtag  DW_TAG_member
     463                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     464                      .dwattr $C$DW$26, DW_AT_name("CAP3EDGE")
     465                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_CAP3EDGE")
     466                      .dwattr $C$DW$26, DW_AT_bit_offset(0x0c)
     467                      .dwattr $C$DW$26, DW_AT_bit_size(0x02)
     468                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     469                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     470              
     471              $C$DW$27        .dwtag  DW_TAG_member
     472                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     473                      .dwattr $C$DW$27, DW_AT_name("CAP2EDGE")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Ev.asm           PAGE   10

     474                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_CAP2EDGE")
     475                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0a)
     476                      .dwattr $C$DW$27, DW_AT_bit_size(0x02)
     477                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     478                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     479              
     480              $C$DW$28        .dwtag  DW_TAG_member
     481                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     482                      .dwattr $C$DW$28, DW_AT_name("CAP1EDGE")
     483                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_CAP1EDGE")
     484                      .dwattr $C$DW$28, DW_AT_bit_offset(0x08)
     485                      .dwattr $C$DW$28, DW_AT_bit_size(0x02)
     486                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     487                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     488              
     489              $C$DW$29        .dwtag  DW_TAG_member
     490                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     491                      .dwattr $C$DW$29, DW_AT_name("CAP3TOADC")
     492                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_CAP3TOADC")
     493                      .dwattr $C$DW$29, DW_AT_bit_offset(0x07)
     494                      .dwattr $C$DW$29, DW_AT_bit_size(0x01)
     495                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     496                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     497              
     498              $C$DW$30        .dwtag  DW_TAG_member
     499                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     500                      .dwattr $C$DW$30, DW_AT_name("CAP12TSEL")
     501                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_CAP12TSEL")
     502                      .dwattr $C$DW$30, DW_AT_bit_offset(0x06)
     503                      .dwattr $C$DW$30, DW_AT_bit_size(0x01)
     504                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     505                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     506              
     507              $C$DW$31        .dwtag  DW_TAG_member
     508                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     509                      .dwattr $C$DW$31, DW_AT_name("CAP3TSEL")
     510                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_CAP3TSEL")
     511                      .dwattr $C$DW$31, DW_AT_bit_offset(0x05)
     512                      .dwattr $C$DW$31, DW_AT_bit_size(0x01)
     513                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     514                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     515              
     516              $C$DW$32        .dwtag  DW_TAG_member
     517                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     518                      .dwattr $C$DW$32, DW_AT_name("rsvd2")
     519                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_rsvd2")
     520                      .dwattr $C$DW$32, DW_AT_bit_offset(0x04)
     521                      .dwattr $C$DW$32, DW_AT_bit_size(0x01)
     522                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     523                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     524              
     525              $C$DW$33        .dwtag  DW_TAG_member
     526                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     527                      .dwattr $C$DW$33, DW_AT_name("CAP3EN")
     528                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_CAP3EN")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Ev.asm           PAGE   11

     529                      .dwattr $C$DW$33, DW_AT_bit_offset(0x03)
     530                      .dwattr $C$DW$33, DW_AT_bit_size(0x01)
     531                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     532                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     533              
     534              $C$DW$34        .dwtag  DW_TAG_member
     535                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     536                      .dwattr $C$DW$34, DW_AT_name("CAP12EN")
     537                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_CAP12EN")
     538                      .dwattr $C$DW$34, DW_AT_bit_offset(0x01)
     539                      .dwattr $C$DW$34, DW_AT_bit_size(0x02)
     540                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     541                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     542              
     543              $C$DW$35        .dwtag  DW_TAG_member
     544                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     545                      .dwattr $C$DW$35, DW_AT_name("CAPRES")
     546                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_CAPRES")
     547                      .dwattr $C$DW$35, DW_AT_bit_offset(0x00)
     548                      .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     549                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     550                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     551              
     552                      .dwendtag $C$DW$T$24
     553              
     554              
     555              $C$DW$T$25      .dwtag  DW_TAG_union_type
     556                      .dwattr $C$DW$T$25, DW_AT_name("CAPCONA_REG")
     557                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     558              $C$DW$36        .dwtag  DW_TAG_member
     559                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     560                      .dwattr $C$DW$36, DW_AT_name("all")
     561                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_all")
     562                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     563                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     564              
     565              $C$DW$37        .dwtag  DW_TAG_member
     566                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$24)
     567                      .dwattr $C$DW$37, DW_AT_name("bit")
     568                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_bit")
     569                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     570                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     571              
     572                      .dwendtag $C$DW$T$25
     573              
     574              
     575              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     576                      .dwattr $C$DW$T$26, DW_AT_name("CAPCONB_BITS")
     577                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     578              $C$DW$38        .dwtag  DW_TAG_member
     579                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     580                      .dwattr $C$DW$38, DW_AT_name("rsvd1")
     581                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_rsvd1")
     582                      .dwattr $C$DW$38, DW_AT_bit_offset(0x0e)
     583                      .dwattr $C$DW$38, DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Ev.asm           PAGE   12

     584                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     585                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     586              
     587              $C$DW$39        .dwtag  DW_TAG_member
     588                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     589                      .dwattr $C$DW$39, DW_AT_name("CAP6EDGE")
     590                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_CAP6EDGE")
     591                      .dwattr $C$DW$39, DW_AT_bit_offset(0x0c)
     592                      .dwattr $C$DW$39, DW_AT_bit_size(0x02)
     593                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     594                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     595              
     596              $C$DW$40        .dwtag  DW_TAG_member
     597                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     598                      .dwattr $C$DW$40, DW_AT_name("CAP5EDGE")
     599                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_CAP5EDGE")
     600                      .dwattr $C$DW$40, DW_AT_bit_offset(0x0a)
     601                      .dwattr $C$DW$40, DW_AT_bit_size(0x02)
     602                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     603                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     604              
     605              $C$DW$41        .dwtag  DW_TAG_member
     606                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     607                      .dwattr $C$DW$41, DW_AT_name("CAP4EDGE")
     608                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_CAP4EDGE")
     609                      .dwattr $C$DW$41, DW_AT_bit_offset(0x08)
     610                      .dwattr $C$DW$41, DW_AT_bit_size(0x02)
     611                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     612                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     613              
     614              $C$DW$42        .dwtag  DW_TAG_member
     615                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     616                      .dwattr $C$DW$42, DW_AT_name("CAP6TOADC")
     617                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_CAP6TOADC")
     618                      .dwattr $C$DW$42, DW_AT_bit_offset(0x07)
     619                      .dwattr $C$DW$42, DW_AT_bit_size(0x01)
     620                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     621                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     622              
     623              $C$DW$43        .dwtag  DW_TAG_member
     624                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     625                      .dwattr $C$DW$43, DW_AT_name("CAP45TSEL")
     626                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_CAP45TSEL")
     627                      .dwattr $C$DW$43, DW_AT_bit_offset(0x06)
     628                      .dwattr $C$DW$43, DW_AT_bit_size(0x01)
     629                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     630                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     631              
     632              $C$DW$44        .dwtag  DW_TAG_member
     633                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     634                      .dwattr $C$DW$44, DW_AT_name("CAP6TSEL")
     635                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_CAP6TSEL")
     636                      .dwattr $C$DW$44, DW_AT_bit_offset(0x05)
     637                      .dwattr $C$DW$44, DW_AT_bit_size(0x01)
     638                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Ev.asm           PAGE   13

     639                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     640              
     641              $C$DW$45        .dwtag  DW_TAG_member
     642                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     643                      .dwattr $C$DW$45, DW_AT_name("rsvd2")
     644                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_rsvd2")
     645                      .dwattr $C$DW$45, DW_AT_bit_offset(0x04)
     646                      .dwattr $C$DW$45, DW_AT_bit_size(0x01)
     647                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     648                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     649              
     650              $C$DW$46        .dwtag  DW_TAG_member
     651                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     652                      .dwattr $C$DW$46, DW_AT_name("CAP6EN")
     653                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_CAP6EN")
     654                      .dwattr $C$DW$46, DW_AT_bit_offset(0x03)
     655                      .dwattr $C$DW$46, DW_AT_bit_size(0x01)
     656                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     657                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     658              
     659              $C$DW$47        .dwtag  DW_TAG_member
     660                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     661                      .dwattr $C$DW$47, DW_AT_name("CAP45EN")
     662                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_CAP45EN")
     663                      .dwattr $C$DW$47, DW_AT_bit_offset(0x01)
     664                      .dwattr $C$DW$47, DW_AT_bit_size(0x02)
     665                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     666                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     667              
     668              $C$DW$48        .dwtag  DW_TAG_member
     669                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     670                      .dwattr $C$DW$48, DW_AT_name("CAPRES")
     671                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_CAPRES")
     672                      .dwattr $C$DW$48, DW_AT_bit_offset(0x00)
     673                      .dwattr $C$DW$48, DW_AT_bit_size(0x01)
     674                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     675                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     676              
     677                      .dwendtag $C$DW$T$26
     678              
     679              
     680              $C$DW$T$27      .dwtag  DW_TAG_union_type
     681                      .dwattr $C$DW$T$27, DW_AT_name("CAPCONB_REG")
     682                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     683              $C$DW$49        .dwtag  DW_TAG_member
     684                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     685                      .dwattr $C$DW$49, DW_AT_name("all")
     686                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_all")
     687                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     688                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     689              
     690              $C$DW$50        .dwtag  DW_TAG_member
     691                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$26)
     692                      .dwattr $C$DW$50, DW_AT_name("bit")
     693                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Ev.asm           PAGE   14

     694                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     695                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     696              
     697                      .dwendtag $C$DW$T$27
     698              
     699              
     700              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     701                      .dwattr $C$DW$T$28, DW_AT_name("CAPFIFOA_BITS")
     702                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     703              $C$DW$51        .dwtag  DW_TAG_member
     704                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     705                      .dwattr $C$DW$51, DW_AT_name("rsvd1")
     706                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_rsvd1")
     707                      .dwattr $C$DW$51, DW_AT_bit_offset(0x08)
     708                      .dwattr $C$DW$51, DW_AT_bit_size(0x08)
     709                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     710                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     711              
     712              $C$DW$52        .dwtag  DW_TAG_member
     713                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     714                      .dwattr $C$DW$52, DW_AT_name("CAP1FIFO")
     715                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_CAP1FIFO")
     716                      .dwattr $C$DW$52, DW_AT_bit_offset(0x06)
     717                      .dwattr $C$DW$52, DW_AT_bit_size(0x02)
     718                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     719                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     720              
     721              $C$DW$53        .dwtag  DW_TAG_member
     722                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     723                      .dwattr $C$DW$53, DW_AT_name("CAP2FIFO")
     724                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_CAP2FIFO")
     725                      .dwattr $C$DW$53, DW_AT_bit_offset(0x04)
     726                      .dwattr $C$DW$53, DW_AT_bit_size(0x02)
     727                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     728                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     729              
     730              $C$DW$54        .dwtag  DW_TAG_member
     731                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     732                      .dwattr $C$DW$54, DW_AT_name("CAP3FIFO")
     733                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_CAP3FIFO")
     734                      .dwattr $C$DW$54, DW_AT_bit_offset(0x02)
     735                      .dwattr $C$DW$54, DW_AT_bit_size(0x02)
     736                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     737                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     738              
     739              $C$DW$55        .dwtag  DW_TAG_member
     740                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     741                      .dwattr $C$DW$55, DW_AT_name("rsvd2")
     742                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_rsvd2")
     743                      .dwattr $C$DW$55, DW_AT_bit_offset(0x00)
     744                      .dwattr $C$DW$55, DW_AT_bit_size(0x02)
     745                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     746                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     747              
     748                      .dwendtag $C$DW$T$28
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Ev.asm           PAGE   15

     749              
     750              
     751              $C$DW$T$29      .dwtag  DW_TAG_union_type
     752                      .dwattr $C$DW$T$29, DW_AT_name("CAPFIFOA_REG")
     753                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     754              $C$DW$56        .dwtag  DW_TAG_member
     755                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     756                      .dwattr $C$DW$56, DW_AT_name("all")
     757                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_all")
     758                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     759                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     760              
     761              $C$DW$57        .dwtag  DW_TAG_member
     762                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$28)
     763                      .dwattr $C$DW$57, DW_AT_name("bit")
     764                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_bit")
     765                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     766                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     767              
     768                      .dwendtag $C$DW$T$29
     769              
     770              
     771              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     772                      .dwattr $C$DW$T$30, DW_AT_name("CAPFIFOB_BITS")
     773                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     774              $C$DW$58        .dwtag  DW_TAG_member
     775                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     776                      .dwattr $C$DW$58, DW_AT_name("rsvd1")
     777                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_rsvd1")
     778                      .dwattr $C$DW$58, DW_AT_bit_offset(0x08)
     779                      .dwattr $C$DW$58, DW_AT_bit_size(0x08)
     780                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     781                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     782              
     783              $C$DW$59        .dwtag  DW_TAG_member
     784                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     785                      .dwattr $C$DW$59, DW_AT_name("CAP4FIFO")
     786                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_CAP4FIFO")
     787                      .dwattr $C$DW$59, DW_AT_bit_offset(0x06)
     788                      .dwattr $C$DW$59, DW_AT_bit_size(0x02)
     789                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     790                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     791              
     792              $C$DW$60        .dwtag  DW_TAG_member
     793                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     794                      .dwattr $C$DW$60, DW_AT_name("CAP5FIFO")
     795                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_CAP5FIFO")
     796                      .dwattr $C$DW$60, DW_AT_bit_offset(0x04)
     797                      .dwattr $C$DW$60, DW_AT_bit_size(0x02)
     798                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     799                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     800              
     801              $C$DW$61        .dwtag  DW_TAG_member
     802                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     803                      .dwattr $C$DW$61, DW_AT_name("CAP6FIFO")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Ev.asm           PAGE   16

     804                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_CAP6FIFO")
     805                      .dwattr $C$DW$61, DW_AT_bit_offset(0x02)
     806                      .dwattr $C$DW$61, DW_AT_bit_size(0x02)
     807                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     808                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     809              
     810              $C$DW$62        .dwtag  DW_TAG_member
     811                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     812                      .dwattr $C$DW$62, DW_AT_name("rsvd2")
     813                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_rsvd2")
     814                      .dwattr $C$DW$62, DW_AT_bit_offset(0x00)
     815                      .dwattr $C$DW$62, DW_AT_bit_size(0x02)
     816                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     817                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     818              
     819                      .dwendtag $C$DW$T$30
     820              
     821              
     822              $C$DW$T$31      .dwtag  DW_TAG_union_type
     823                      .dwattr $C$DW$T$31, DW_AT_name("CAPFIFOB_REG")
     824                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     825              $C$DW$63        .dwtag  DW_TAG_member
     826                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     827                      .dwattr $C$DW$63, DW_AT_name("all")
     828                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_all")
     829                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     830                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     831              
     832              $C$DW$64        .dwtag  DW_TAG_member
     833                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$30)
     834                      .dwattr $C$DW$64, DW_AT_name("bit")
     835                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_bit")
     836                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     837                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     838              
     839                      .dwendtag $C$DW$T$31
     840              
     841              
     842              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     843                      .dwattr $C$DW$T$32, DW_AT_name("COMCONA_BITS")
     844                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
     845              $C$DW$65        .dwtag  DW_TAG_member
     846                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     847                      .dwattr $C$DW$65, DW_AT_name("C1TRIPE")
     848                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_C1TRIPE")
     849                      .dwattr $C$DW$65, DW_AT_bit_offset(0x0f)
     850                      .dwattr $C$DW$65, DW_AT_bit_size(0x01)
     851                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     852                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     853              
     854              $C$DW$66        .dwtag  DW_TAG_member
     855                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     856                      .dwattr $C$DW$66, DW_AT_name("C2TRIPE")
     857                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_C2TRIPE")
     858                      .dwattr $C$DW$66, DW_AT_bit_offset(0x0e)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Ev.asm           PAGE   17

     859                      .dwattr $C$DW$66, DW_AT_bit_size(0x01)
     860                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     861                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     862              
     863              $C$DW$67        .dwtag  DW_TAG_member
     864                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     865                      .dwattr $C$DW$67, DW_AT_name("C3TRIPE")
     866                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_C3TRIPE")
     867                      .dwattr $C$DW$67, DW_AT_bit_offset(0x0d)
     868                      .dwattr $C$DW$67, DW_AT_bit_size(0x01)
     869                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     870                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     871              
     872              $C$DW$68        .dwtag  DW_TAG_member
     873                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     874                      .dwattr $C$DW$68, DW_AT_name("rsvd")
     875                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_rsvd")
     876                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0b)
     877                      .dwattr $C$DW$68, DW_AT_bit_size(0x02)
     878                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     879                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     880              
     881              $C$DW$69        .dwtag  DW_TAG_member
     882                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     883                      .dwattr $C$DW$69, DW_AT_name("FCMP1OE")
     884                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_FCMP1OE")
     885                      .dwattr $C$DW$69, DW_AT_bit_offset(0x0a)
     886                      .dwattr $C$DW$69, DW_AT_bit_size(0x01)
     887                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     888                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     889              
     890              $C$DW$70        .dwtag  DW_TAG_member
     891                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     892                      .dwattr $C$DW$70, DW_AT_name("FCMP2OE")
     893                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_FCMP2OE")
     894                      .dwattr $C$DW$70, DW_AT_bit_offset(0x09)
     895                      .dwattr $C$DW$70, DW_AT_bit_size(0x01)
     896                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     897                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     898              
     899              $C$DW$71        .dwtag  DW_TAG_member
     900                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     901                      .dwattr $C$DW$71, DW_AT_name("FCMP3OE")
     902                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_FCMP3OE")
     903                      .dwattr $C$DW$71, DW_AT_bit_offset(0x08)
     904                      .dwattr $C$DW$71, DW_AT_bit_size(0x01)
     905                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     906                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     907              
     908              $C$DW$72        .dwtag  DW_TAG_member
     909                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     910                      .dwattr $C$DW$72, DW_AT_name("PDPINTASTATUS")
     911                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_PDPINTASTATUS")
     912                      .dwattr $C$DW$72, DW_AT_bit_offset(0x07)
     913                      .dwattr $C$DW$72, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Ev.asm           PAGE   18

     914                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     915                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     916              
     917              $C$DW$73        .dwtag  DW_TAG_member
     918                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     919                      .dwattr $C$DW$73, DW_AT_name("FCOMPOE")
     920                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_FCOMPOE")
     921                      .dwattr $C$DW$73, DW_AT_bit_offset(0x06)
     922                      .dwattr $C$DW$73, DW_AT_bit_size(0x01)
     923                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     924                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     925              
     926              $C$DW$74        .dwtag  DW_TAG_member
     927                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     928                      .dwattr $C$DW$74, DW_AT_name("ACTRLD")
     929                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_ACTRLD")
     930                      .dwattr $C$DW$74, DW_AT_bit_offset(0x04)
     931                      .dwattr $C$DW$74, DW_AT_bit_size(0x02)
     932                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     933                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     934              
     935              $C$DW$75        .dwtag  DW_TAG_member
     936                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     937                      .dwattr $C$DW$75, DW_AT_name("SVENABLE")
     938                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_SVENABLE")
     939                      .dwattr $C$DW$75, DW_AT_bit_offset(0x03)
     940                      .dwattr $C$DW$75, DW_AT_bit_size(0x01)
     941                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     942                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     943              
     944              $C$DW$76        .dwtag  DW_TAG_member
     945                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     946                      .dwattr $C$DW$76, DW_AT_name("CLD")
     947                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_CLD")
     948                      .dwattr $C$DW$76, DW_AT_bit_offset(0x01)
     949                      .dwattr $C$DW$76, DW_AT_bit_size(0x02)
     950                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     951                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     952              
     953              $C$DW$77        .dwtag  DW_TAG_member
     954                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     955                      .dwattr $C$DW$77, DW_AT_name("CENABLE")
     956                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_CENABLE")
     957                      .dwattr $C$DW$77, DW_AT_bit_offset(0x00)
     958                      .dwattr $C$DW$77, DW_AT_bit_size(0x01)
     959                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     960                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     961              
     962                      .dwendtag $C$DW$T$32
     963              
     964              
     965              $C$DW$T$33      .dwtag  DW_TAG_union_type
     966                      .dwattr $C$DW$T$33, DW_AT_name("COMCONA_REG")
     967                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     968              $C$DW$78        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Ev.asm           PAGE   19

     969                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     970                      .dwattr $C$DW$78, DW_AT_name("all")
     971                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_all")
     972                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     973                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     974              
     975              $C$DW$79        .dwtag  DW_TAG_member
     976                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$32)
     977                      .dwattr $C$DW$79, DW_AT_name("bit")
     978                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_bit")
     979                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     980                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     981              
     982                      .dwendtag $C$DW$T$33
     983              
     984              
     985              $C$DW$T$34      .dwtag  DW_TAG_structure_type
     986                      .dwattr $C$DW$T$34, DW_AT_name("COMCONB_BITS")
     987                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
     988              $C$DW$80        .dwtag  DW_TAG_member
     989                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     990                      .dwattr $C$DW$80, DW_AT_name("C4TRIPE")
     991                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_C4TRIPE")
     992                      .dwattr $C$DW$80, DW_AT_bit_offset(0x0f)
     993                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
     994                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     995                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     996              
     997              $C$DW$81        .dwtag  DW_TAG_member
     998                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     999                      .dwattr $C$DW$81, DW_AT_name("C5TRIPE")
    1000                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_C5TRIPE")
    1001                      .dwattr $C$DW$81, DW_AT_bit_offset(0x0e)
    1002                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1003                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1004                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1005              
    1006              $C$DW$82        .dwtag  DW_TAG_member
    1007                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1008                      .dwattr $C$DW$82, DW_AT_name("C6TRIPE")
    1009                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_C6TRIPE")
    1010                      .dwattr $C$DW$82, DW_AT_bit_offset(0x0d)
    1011                      .dwattr $C$DW$82, DW_AT_bit_size(0x01)
    1012                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1013                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1014              
    1015              $C$DW$83        .dwtag  DW_TAG_member
    1016                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1017                      .dwattr $C$DW$83, DW_AT_name("rsvd")
    1018                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_rsvd")
    1019                      .dwattr $C$DW$83, DW_AT_bit_offset(0x0b)
    1020                      .dwattr $C$DW$83, DW_AT_bit_size(0x02)
    1021                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1022                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1023              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Ev.asm           PAGE   20

    1024              $C$DW$84        .dwtag  DW_TAG_member
    1025                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1026                      .dwattr $C$DW$84, DW_AT_name("FCMP4OE")
    1027                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_FCMP4OE")
    1028                      .dwattr $C$DW$84, DW_AT_bit_offset(0x0a)
    1029                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
    1030                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1031                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1032              
    1033              $C$DW$85        .dwtag  DW_TAG_member
    1034                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1035                      .dwattr $C$DW$85, DW_AT_name("FCMP5OE")
    1036                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_FCMP5OE")
    1037                      .dwattr $C$DW$85, DW_AT_bit_offset(0x09)
    1038                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
    1039                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1040                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1041              
    1042              $C$DW$86        .dwtag  DW_TAG_member
    1043                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1044                      .dwattr $C$DW$86, DW_AT_name("FCMP6OE")
    1045                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_FCMP6OE")
    1046                      .dwattr $C$DW$86, DW_AT_bit_offset(0x08)
    1047                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
    1048                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1049                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1050              
    1051              $C$DW$87        .dwtag  DW_TAG_member
    1052                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1053                      .dwattr $C$DW$87, DW_AT_name("PDPINTBSTATUS")
    1054                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_PDPINTBSTATUS")
    1055                      .dwattr $C$DW$87, DW_AT_bit_offset(0x07)
    1056                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
    1057                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1058                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1059              
    1060              $C$DW$88        .dwtag  DW_TAG_member
    1061                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1062                      .dwattr $C$DW$88, DW_AT_name("FCOMPOE")
    1063                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_FCOMPOE")
    1064                      .dwattr $C$DW$88, DW_AT_bit_offset(0x06)
    1065                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1066                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1067                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1068              
    1069              $C$DW$89        .dwtag  DW_TAG_member
    1070                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1071                      .dwattr $C$DW$89, DW_AT_name("ACTRLD")
    1072                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_ACTRLD")
    1073                      .dwattr $C$DW$89, DW_AT_bit_offset(0x04)
    1074                      .dwattr $C$DW$89, DW_AT_bit_size(0x02)
    1075                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1076                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1077              
    1078              $C$DW$90        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Ev.asm           PAGE   21

    1079                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1080                      .dwattr $C$DW$90, DW_AT_name("SVENABLE")
    1081                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_SVENABLE")
    1082                      .dwattr $C$DW$90, DW_AT_bit_offset(0x03)
    1083                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1084                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1085                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1086              
    1087              $C$DW$91        .dwtag  DW_TAG_member
    1088                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1089                      .dwattr $C$DW$91, DW_AT_name("CLD")
    1090                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_CLD")
    1091                      .dwattr $C$DW$91, DW_AT_bit_offset(0x01)
    1092                      .dwattr $C$DW$91, DW_AT_bit_size(0x02)
    1093                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1094                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1095              
    1096              $C$DW$92        .dwtag  DW_TAG_member
    1097                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1098                      .dwattr $C$DW$92, DW_AT_name("CENABLE")
    1099                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_CENABLE")
    1100                      .dwattr $C$DW$92, DW_AT_bit_offset(0x00)
    1101                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1102                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1103                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1104              
    1105                      .dwendtag $C$DW$T$34
    1106              
    1107              
    1108              $C$DW$T$35      .dwtag  DW_TAG_union_type
    1109                      .dwattr $C$DW$T$35, DW_AT_name("COMCONB_REG")
    1110                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1111              $C$DW$93        .dwtag  DW_TAG_member
    1112                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1113                      .dwattr $C$DW$93, DW_AT_name("all")
    1114                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_all")
    1115                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1116                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1117              
    1118              $C$DW$94        .dwtag  DW_TAG_member
    1119                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$34)
    1120                      .dwattr $C$DW$94, DW_AT_name("bit")
    1121                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_bit")
    1122                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1123                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1124              
    1125                      .dwendtag $C$DW$T$35
    1126              
    1127              
    1128              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1129                      .dwattr $C$DW$T$36, DW_AT_name("DBTCON_BITS")
    1130                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1131              $C$DW$95        .dwtag  DW_TAG_member
    1132                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1133                      .dwattr $C$DW$95, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Ev.asm           PAGE   22

    1134                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_rsvd1")
    1135                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0e)
    1136                      .dwattr $C$DW$95, DW_AT_bit_size(0x02)
    1137                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1138                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1139              
    1140              $C$DW$96        .dwtag  DW_TAG_member
    1141                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1142                      .dwattr $C$DW$96, DW_AT_name("DBTPS")
    1143                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_DBTPS")
    1144                      .dwattr $C$DW$96, DW_AT_bit_offset(0x0b)
    1145                      .dwattr $C$DW$96, DW_AT_bit_size(0x03)
    1146                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1147                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1148              
    1149              $C$DW$97        .dwtag  DW_TAG_member
    1150                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1151                      .dwattr $C$DW$97, DW_AT_name("EDBT1")
    1152                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_EDBT1")
    1153                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0a)
    1154                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1155                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1156                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1157              
    1158              $C$DW$98        .dwtag  DW_TAG_member
    1159                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1160                      .dwattr $C$DW$98, DW_AT_name("EDBT2")
    1161                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_EDBT2")
    1162                      .dwattr $C$DW$98, DW_AT_bit_offset(0x09)
    1163                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1164                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1165                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1166              
    1167              $C$DW$99        .dwtag  DW_TAG_member
    1168                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1169                      .dwattr $C$DW$99, DW_AT_name("EDBT3")
    1170                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_EDBT3")
    1171                      .dwattr $C$DW$99, DW_AT_bit_offset(0x08)
    1172                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1173                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1174                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1175              
    1176              $C$DW$100       .dwtag  DW_TAG_member
    1177                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1178                      .dwattr $C$DW$100, DW_AT_name("DBT")
    1179                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_DBT")
    1180                      .dwattr $C$DW$100, DW_AT_bit_offset(0x04)
    1181                      .dwattr $C$DW$100, DW_AT_bit_size(0x04)
    1182                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1183                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1184              
    1185              $C$DW$101       .dwtag  DW_TAG_member
    1186                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1187                      .dwattr $C$DW$101, DW_AT_name("rsvd2")
    1188                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_rsvd2")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Ev.asm           PAGE   23

    1189                      .dwattr $C$DW$101, DW_AT_bit_offset(0x00)
    1190                      .dwattr $C$DW$101, DW_AT_bit_size(0x04)
    1191                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1192                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1193              
    1194                      .dwendtag $C$DW$T$36
    1195              
    1196              
    1197              $C$DW$T$37      .dwtag  DW_TAG_union_type
    1198                      .dwattr $C$DW$T$37, DW_AT_name("DBTCON_REG")
    1199                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1200              $C$DW$102       .dwtag  DW_TAG_member
    1201                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1202                      .dwattr $C$DW$102, DW_AT_name("all")
    1203                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_all")
    1204                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1205                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1206              
    1207              $C$DW$103       .dwtag  DW_TAG_member
    1208                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$36)
    1209                      .dwattr $C$DW$103, DW_AT_name("bit")
    1210                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_bit")
    1211                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1212                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1213              
    1214                      .dwendtag $C$DW$T$37
    1215              
    1216              
    1217              $C$DW$T$38      .dwtag  DW_TAG_union_type
    1218                      .dwattr $C$DW$T$38, DW_AT_name("EVAIFRA_REG")
    1219                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1220              $C$DW$104       .dwtag  DW_TAG_member
    1221                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1222                      .dwattr $C$DW$104, DW_AT_name("all")
    1223                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_all")
    1224                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1225                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1226              
    1227              $C$DW$105       .dwtag  DW_TAG_member
    1228                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$43)
    1229                      .dwattr $C$DW$105, DW_AT_name("bit")
    1230                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_bit")
    1231                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1232                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1233              
    1234                      .dwendtag $C$DW$T$38
    1235              
    1236              
    1237              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1238                      .dwattr $C$DW$T$39, DW_AT_name("EVAIFRB_BITS")
    1239                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1240              $C$DW$106       .dwtag  DW_TAG_member
    1241                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1242                      .dwattr $C$DW$106, DW_AT_name("T2PINT")
    1243                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_T2PINT")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Ev.asm           PAGE   24

    1244                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0f)
    1245                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1246                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1247                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1248              
    1249              $C$DW$107       .dwtag  DW_TAG_member
    1250                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1251                      .dwattr $C$DW$107, DW_AT_name("T2CINT")
    1252                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_T2CINT")
    1253                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0e)
    1254                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1255                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1256                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1257              
    1258              $C$DW$108       .dwtag  DW_TAG_member
    1259                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1260                      .dwattr $C$DW$108, DW_AT_name("T2UFINT")
    1261                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_T2UFINT")
    1262                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0d)
    1263                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1264                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1265                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1266              
    1267              $C$DW$109       .dwtag  DW_TAG_member
    1268                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1269                      .dwattr $C$DW$109, DW_AT_name("T2OFINT")
    1270                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_T2OFINT")
    1271                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0c)
    1272                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1273                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1274                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1275              
    1276              $C$DW$110       .dwtag  DW_TAG_member
    1277                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1278                      .dwattr $C$DW$110, DW_AT_name("rsvd1")
    1279                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rsvd1")
    1280                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00)
    1281                      .dwattr $C$DW$110, DW_AT_bit_size(0x0c)
    1282                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1283                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1284              
    1285                      .dwendtag $C$DW$T$39
    1286              
    1287              
    1288              $C$DW$T$40      .dwtag  DW_TAG_union_type
    1289                      .dwattr $C$DW$T$40, DW_AT_name("EVAIFRB_REG")
    1290                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1291              $C$DW$111       .dwtag  DW_TAG_member
    1292                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1293                      .dwattr $C$DW$111, DW_AT_name("all")
    1294                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_all")
    1295                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1296                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1297              
    1298              $C$DW$112       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Ev.asm           PAGE   25

    1299                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$39)
    1300                      .dwattr $C$DW$112, DW_AT_name("bit")
    1301                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_bit")
    1302                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1303                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1304              
    1305                      .dwendtag $C$DW$T$40
    1306              
    1307              
    1308              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1309                      .dwattr $C$DW$T$41, DW_AT_name("EVAIFRC_BITS")
    1310                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1311              $C$DW$113       .dwtag  DW_TAG_member
    1312                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1313                      .dwattr $C$DW$113, DW_AT_name("CAP1INT")
    1314                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_CAP1INT")
    1315                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0f)
    1316                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1317                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1318                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1319              
    1320              $C$DW$114       .dwtag  DW_TAG_member
    1321                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1322                      .dwattr $C$DW$114, DW_AT_name("CAP2INT")
    1323                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_CAP2INT")
    1324                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0e)
    1325                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1326                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1327                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1328              
    1329              $C$DW$115       .dwtag  DW_TAG_member
    1330                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1331                      .dwattr $C$DW$115, DW_AT_name("CAP3INT")
    1332                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_CAP3INT")
    1333                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0d)
    1334                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1335                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1336                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1337              
    1338              $C$DW$116       .dwtag  DW_TAG_member
    1339                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1340                      .dwattr $C$DW$116, DW_AT_name("rsvd1")
    1341                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_rsvd1")
    1342                      .dwattr $C$DW$116, DW_AT_bit_offset(0x00)
    1343                      .dwattr $C$DW$116, DW_AT_bit_size(0x0d)
    1344                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1345                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1346              
    1347                      .dwendtag $C$DW$T$41
    1348              
    1349              
    1350              $C$DW$T$42      .dwtag  DW_TAG_union_type
    1351                      .dwattr $C$DW$T$42, DW_AT_name("EVAIFRC_REG")
    1352                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1353              $C$DW$117       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Ev.asm           PAGE   26

    1354                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1355                      .dwattr $C$DW$117, DW_AT_name("all")
    1356                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_all")
    1357                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1358                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1359              
    1360              $C$DW$118       .dwtag  DW_TAG_member
    1361                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$41)
    1362                      .dwattr $C$DW$118, DW_AT_name("bit")
    1363                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_bit")
    1364                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1365                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1366              
    1367                      .dwendtag $C$DW$T$42
    1368              
    1369              
    1370              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1371                      .dwattr $C$DW$T$43, DW_AT_name("EVAIMRA_BITS")
    1372                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1373              $C$DW$119       .dwtag  DW_TAG_member
    1374                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1375                      .dwattr $C$DW$119, DW_AT_name("PDPINTA")
    1376                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_PDPINTA")
    1377                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0f)
    1378                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1379                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1380                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1381              
    1382              $C$DW$120       .dwtag  DW_TAG_member
    1383                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1384                      .dwattr $C$DW$120, DW_AT_name("CMP1INT")
    1385                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_CMP1INT")
    1386                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0e)
    1387                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1388                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1389                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1390              
    1391              $C$DW$121       .dwtag  DW_TAG_member
    1392                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1393                      .dwattr $C$DW$121, DW_AT_name("CMP2INT")
    1394                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_CMP2INT")
    1395                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0d)
    1396                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1397                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1398                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1399              
    1400              $C$DW$122       .dwtag  DW_TAG_member
    1401                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1402                      .dwattr $C$DW$122, DW_AT_name("CMP3INT")
    1403                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_CMP3INT")
    1404                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0c)
    1405                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1406                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1407                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1408              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Ev.asm           PAGE   27

    1409              $C$DW$123       .dwtag  DW_TAG_member
    1410                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1411                      .dwattr $C$DW$123, DW_AT_name("rsvd1")
    1412                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_rsvd1")
    1413                      .dwattr $C$DW$123, DW_AT_bit_offset(0x09)
    1414                      .dwattr $C$DW$123, DW_AT_bit_size(0x03)
    1415                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1416                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1417              
    1418              $C$DW$124       .dwtag  DW_TAG_member
    1419                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1420                      .dwattr $C$DW$124, DW_AT_name("T1PINT")
    1421                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_T1PINT")
    1422                      .dwattr $C$DW$124, DW_AT_bit_offset(0x08)
    1423                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1424                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1425                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1426              
    1427              $C$DW$125       .dwtag  DW_TAG_member
    1428                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1429                      .dwattr $C$DW$125, DW_AT_name("T1CINT")
    1430                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_T1CINT")
    1431                      .dwattr $C$DW$125, DW_AT_bit_offset(0x07)
    1432                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1433                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1434                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1435              
    1436              $C$DW$126       .dwtag  DW_TAG_member
    1437                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1438                      .dwattr $C$DW$126, DW_AT_name("T1UFINT")
    1439                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_T1UFINT")
    1440                      .dwattr $C$DW$126, DW_AT_bit_offset(0x06)
    1441                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1442                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1443                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1444              
    1445              $C$DW$127       .dwtag  DW_TAG_member
    1446                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1447                      .dwattr $C$DW$127, DW_AT_name("T1OFINT")
    1448                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_T1OFINT")
    1449                      .dwattr $C$DW$127, DW_AT_bit_offset(0x05)
    1450                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1451                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1452                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1453              
    1454              $C$DW$128       .dwtag  DW_TAG_member
    1455                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1456                      .dwattr $C$DW$128, DW_AT_name("rsvd2")
    1457                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_rsvd2")
    1458                      .dwattr $C$DW$128, DW_AT_bit_offset(0x00)
    1459                      .dwattr $C$DW$128, DW_AT_bit_size(0x05)
    1460                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1461                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1462              
    1463                      .dwendtag $C$DW$T$43
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Ev.asm           PAGE   28

    1464              
    1465              
    1466              $C$DW$T$44      .dwtag  DW_TAG_union_type
    1467                      .dwattr $C$DW$T$44, DW_AT_name("EVAIMRA_REG")
    1468                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1469              $C$DW$129       .dwtag  DW_TAG_member
    1470                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1471                      .dwattr $C$DW$129, DW_AT_name("all")
    1472                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_all")
    1473                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1474                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1475              
    1476              $C$DW$130       .dwtag  DW_TAG_member
    1477                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$43)
    1478                      .dwattr $C$DW$130, DW_AT_name("bit")
    1479                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_bit")
    1480                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1481                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1482              
    1483                      .dwendtag $C$DW$T$44
    1484              
    1485              
    1486              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1487                      .dwattr $C$DW$T$45, DW_AT_name("EVAIMRB_BITS")
    1488                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    1489              $C$DW$131       .dwtag  DW_TAG_member
    1490                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1491                      .dwattr $C$DW$131, DW_AT_name("T2PINT")
    1492                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_T2PINT")
    1493                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0f)
    1494                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1495                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1496                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1497              
    1498              $C$DW$132       .dwtag  DW_TAG_member
    1499                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1500                      .dwattr $C$DW$132, DW_AT_name("T2CINT")
    1501                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_T2CINT")
    1502                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0e)
    1503                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1504                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1505                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1506              
    1507              $C$DW$133       .dwtag  DW_TAG_member
    1508                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1509                      .dwattr $C$DW$133, DW_AT_name("T2UFINT")
    1510                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_T2UFINT")
    1511                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0d)
    1512                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1513                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1514                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1515              
    1516              $C$DW$134       .dwtag  DW_TAG_member
    1517                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1518                      .dwattr $C$DW$134, DW_AT_name("T2OFINT")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:52 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Ev.asm           PAGE   29

    1519                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_T2OFINT")
    1520                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0c)
    1521                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1522                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1523                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1524              
    1525              $C$DW$135       .dwtag  DW_TAG_member
    1526                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1527                      .dwattr $C$DW$135, DW_AT_name("rsvd1")
    1528                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_rsvd1")
    1529                      .dwattr $C$DW$135, DW_AT_bit_offset(0x00)
    1530                      .dwattr $C$DW$135, DW_AT_bit_size(0x0c)
    1531                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1532                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1533              
    1534                      .dwendtag $C$DW$T$45
    1535              
    1536              
    1537              $C$DW$T$46      .dwtag  DW_TAG_union_type
    1538                      .dwattr $C$DW$T$46, DW_AT_name("EVAIMRB_REG")
    1539                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    1540              $C$DW$136       .dwtag  DW_TAG_member
    1541                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1542                      .dwattr $C$DW$136, DW_AT_name("all")
    1543                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_all")
    1544                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1545                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1546              
    1547              $C$DW$137       .dwtag  DW_TAG_member
    1548                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$45)
    1549                      .dwattr $C$DW$137, DW_AT_name("bit")
    1550                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_bit")
    1551                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1552                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1553              
    1554                      .dwendtag $C$DW$T$46
    1555              
    1556              
    1557              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    1558                      .dwattr $C$DW$T$47, DW_AT_name("EVAIMRC_BITS")
    1559                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    1560              $C$DW$138       .dwtag  DW_TAG_member
    1561                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1562                      .dwattr $C$DW$138, DW_AT_name("CAP1INT")
