TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Gpio.asm         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Tue Apr  8 10:05:52 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=softlib --hll_source=on --mem_model:code
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/repo/jabil2025/gpb/gpb_project_v3/Gpio.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\repo\jabil2025\gpb\gpb_project_v3\projects\example_nonBIOS_ram\D
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("GpioMuxRegs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_GpioMuxRegs")

    1409              ; 348 | uTemp |= 0x0002;                                                       
    1410              ;----------------------------------------------------------------------
    1411 0000018b 1A41          OR        *-SP[1],#0x0002       ; [CPU_ALU] |348| 
         0000018c 0002 
    1412 0000018d       $C$L42:    
    1413                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Gpio.c",line 350,column 2,is_stmt,isa 0
    1414              ;----------------------------------------------------------------------
    1415              ; 350 | if(GpioDataRegs.GPBDAT.bit.GPIOB10) // DI_B[2]                         
    1416              ;----------------------------------------------------------------------
    1417 0000018d 4A04!         TBIT      @$BLOCKED(_GpioDataRegs)+4,#10 ; [CPU_ALU] |350| 
    1418 0000018e 6C03          B         $C$L43,NTC            ; [CPU_ALU] |350| 
    1419                      ; branchcc occurs ; [] |350| 
    1420                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Gpio.c",line 351,column 3,is_stmt,isa 0
    1421              ;----------------------------------------------------------------------
    1422              ; 351 | uTemp |= 0x0004;                                                       
    1423              ;----------------------------------------------------------------------
    1424 0000018f 1A41          OR        *-SP[1],#0x0004       ; [CPU_ALU] |351| 
         00000190 0004 
    1425 00000191       $C$L43:    
    1426                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Gpio.c",line 353,column 2,is_stmt,isa 0
    1427              ;----------------------------------------------------------------------
    1428              ; 353 | if(GpioDataRegs.GPBDAT.bit.GPIOB11) // DI_B[3]                         
    1429              ;----------------------------------------------------------------------
    1430 00000191 4B04!         TBIT      @$BLOCKED(_GpioDataRegs)+4,#11 ; [CPU_ALU] |353| 
    1431 00000192 6C03          B         $C$L44,NTC            ; [CPU_ALU] |353| 
    1432                      ; branchcc occurs ; [] |353| 
    1433                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Gpio.c",line 354,column 3,is_stmt,isa 0
    1434              ;----------------------------------------------------------------------
    1435              ; 354 | uTemp |= 0x0008;                                                       
    1436              ;----------------------------------------------------------------------
    1437 00000193 1A41          OR        *-SP[1],#0x0008       ; [CPU_ALU] |354| 
         00000194 0008 
    1438 00000195       $C$L44:    
    1439                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Gpio.c",line 356,column 2,is_stmt,isa 0
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Gpio.asm         PAGE   30

    1440              ;----------------------------------------------------------------------
    1441              ; 356 | return uTemp;                                                          
    1442              ;----------------------------------------------------------------------
    1443 00000195 9241          MOV       AL,*-SP[1]            ; [CPU_ALU] |356| 
    1444                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Gpio.c",line 358,column 1,is_stmt,isa 0
    1445              ;----------------------------------------------------------------------
    1446              ; 358 | } // ReadDspDI_B()                                                     
    1447              ;----------------------------------------------------------------------
    1448 00000196 FE82          SUBB      SP,#2                 ; [CPU_ARAU] 
    1449                      .dwcfi  cfa_offset, -2
    1450              $C$DW$18        .dwtag  DW_TAG_TI_branch
    1451                      .dwattr $C$DW$18, DW_AT_low_pc(0x00)
    1452                      .dwattr $C$DW$18, DW_AT_TI_return
    1453              
    1454 00000197 0006          LRETR     ; [CPU_ALU] 
    1455                      ; return occurs ; [] 
    1456                      .dwattr $C$DW$16, DW_AT_TI_end_file("C:/repo/jabil2025/gpb/gpb_project_v3/Gpio.c")
    1457                      .dwattr $C$DW$16, DW_AT_TI_end_line(0x166)
    1458                      .dwattr $C$DW$16, DW_AT_TI_end_column(0x01)
    1459                      .dwendentry
    1460                      .dwendtag $C$DW$16
    1461              
    1462              ;**************************************************************
    1463              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1464              ;**************************************************************
    1465                      .global _GpioMuxRegs
    1466                      .global _GpioDataRegs
    1467              
    1468              ;***************************************************************
    1469              ;* TYPE INFORMATION                                            *
    1470              ;***************************************************************
    1471              
    1472              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1473                      .dwattr $C$DW$T$20, DW_AT_name("GPACLEAR_BITS")
    1474                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    1475              $C$DW$19        .dwtag  DW_TAG_member
    1476                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
    1477                      .dwattr $C$DW$19, DW_AT_name("GPIOA0")
    1478                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_GPIOA0")
    1479                      .dwattr $C$DW$19, DW_AT_bit_offset(0x0f)
    1480                      .dwattr $C$DW$19, DW_AT_bit_size(0x01)
    1481                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1482                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
    1483              
    1484              $C$DW$20        .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
    1486                      .dwattr $C$DW$20, DW_AT_name("GPIOA1")
    1487                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_GPIOA1")
    1488                      .dwattr $C$DW$20, DW_AT_bit_offset(0x0e)
    1489                      .dwattr $C$DW$20, DW_AT_bit_size(0x01)
    1490                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1491                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
    1492              
    1493              $C$DW$21        .dwtag  DW_TAG_member
    1494                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Gpio.asm         PAGE   31

    1495                      .dwattr $C$DW$21, DW_AT_name("GPIOA2")
    1496                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_GPIOA2")
    1497                      .dwattr $C$DW$21, DW_AT_bit_offset(0x0d)
    1498                      .dwattr $C$DW$21, DW_AT_bit_size(0x01)
    1499                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1500                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
    1501              
    1502              $C$DW$22        .dwtag  DW_TAG_member
    1503                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
    1504                      .dwattr $C$DW$22, DW_AT_name("GPIOA3")
    1505                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_GPIOA3")
    1506                      .dwattr $C$DW$22, DW_AT_bit_offset(0x0c)
    1507                      .dwattr $C$DW$22, DW_AT_bit_size(0x01)
    1508                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1509                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
    1510              
    1511              $C$DW$23        .dwtag  DW_TAG_member
    1512                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
    1513                      .dwattr $C$DW$23, DW_AT_name("GPIOA4")
    1514                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_GPIOA4")
    1515                      .dwattr $C$DW$23, DW_AT_bit_offset(0x0b)
    1516                      .dwattr $C$DW$23, DW_AT_bit_size(0x01)
    1517                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1518                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
    1519              
    1520              $C$DW$24        .dwtag  DW_TAG_member
    1521                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
    1522                      .dwattr $C$DW$24, DW_AT_name("GPIOA5")
    1523                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_GPIOA5")
    1524                      .dwattr $C$DW$24, DW_AT_bit_offset(0x0a)
    1525                      .dwattr $C$DW$24, DW_AT_bit_size(0x01)
    1526                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1527                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
    1528              
    1529              $C$DW$25        .dwtag  DW_TAG_member
    1530                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
    1531                      .dwattr $C$DW$25, DW_AT_name("GPIOA6")
    1532                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_GPIOA6")
    1533                      .dwattr $C$DW$25, DW_AT_bit_offset(0x09)
    1534                      .dwattr $C$DW$25, DW_AT_bit_size(0x01)
    1535                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1536                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
    1537              
    1538              $C$DW$26        .dwtag  DW_TAG_member
    1539                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
    1540                      .dwattr $C$DW$26, DW_AT_name("GPIOA7")
    1541                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_GPIOA7")
    1542                      .dwattr $C$DW$26, DW_AT_bit_offset(0x08)
    1543                      .dwattr $C$DW$26, DW_AT_bit_size(0x01)
    1544                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1545                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
    1546              
    1547              $C$DW$27        .dwtag  DW_TAG_member
    1548                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
    1549                      .dwattr $C$DW$27, DW_AT_name("GPIOA8")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Gpio.asm         PAGE   32

    1550                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_GPIOA8")
    1551                      .dwattr $C$DW$27, DW_AT_bit_offset(0x07)
    1552                      .dwattr $C$DW$27, DW_AT_bit_size(0x01)
    1553                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1554                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
    1555              
    1556              $C$DW$28        .dwtag  DW_TAG_member
    1557                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
    1558                      .dwattr $C$DW$28, DW_AT_name("GPIOA9")
    1559                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_GPIOA9")
    1560                      .dwattr $C$DW$28, DW_AT_bit_offset(0x06)
    1561                      .dwattr $C$DW$28, DW_AT_bit_size(0x01)
    1562                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1563                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
    1564              
    1565              $C$DW$29        .dwtag  DW_TAG_member
    1566                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
    1567                      .dwattr $C$DW$29, DW_AT_name("GPIOA10")
    1568                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_GPIOA10")
    1569                      .dwattr $C$DW$29, DW_AT_bit_offset(0x05)
    1570                      .dwattr $C$DW$29, DW_AT_bit_size(0x01)
    1571                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1572                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
    1573              
    1574              $C$DW$30        .dwtag  DW_TAG_member
    1575                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
    1576                      .dwattr $C$DW$30, DW_AT_name("GPIOA11")
    1577                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_GPIOA11")
    1578                      .dwattr $C$DW$30, DW_AT_bit_offset(0x04)
    1579                      .dwattr $C$DW$30, DW_AT_bit_size(0x01)
    1580                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1581                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
    1582              
    1583              $C$DW$31        .dwtag  DW_TAG_member
    1584                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
    1585                      .dwattr $C$DW$31, DW_AT_name("GPIOA12")
    1586                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_GPIOA12")
    1587                      .dwattr $C$DW$31, DW_AT_bit_offset(0x03)
    1588                      .dwattr $C$DW$31, DW_AT_bit_size(0x01)
    1589                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1590                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
    1591              
    1592              $C$DW$32        .dwtag  DW_TAG_member
    1593                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
    1594                      .dwattr $C$DW$32, DW_AT_name("GPIOA13")
    1595                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_GPIOA13")
    1596                      .dwattr $C$DW$32, DW_AT_bit_offset(0x02)
    1597                      .dwattr $C$DW$32, DW_AT_bit_size(0x01)
    1598                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1599                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
    1600              
    1601              $C$DW$33        .dwtag  DW_TAG_member
    1602                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
    1603                      .dwattr $C$DW$33, DW_AT_name("GPIOA14")
    1604                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_GPIOA14")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Gpio.asm         PAGE   33

    1605                      .dwattr $C$DW$33, DW_AT_bit_offset(0x01)
    1606                      .dwattr $C$DW$33, DW_AT_bit_size(0x01)
    1607                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1608                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
    1609              
    1610              $C$DW$34        .dwtag  DW_TAG_member
    1611                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
    1612                      .dwattr $C$DW$34, DW_AT_name("GPIOA15")
    1613                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_GPIOA15")
    1614                      .dwattr $C$DW$34, DW_AT_bit_offset(0x00)
    1615                      .dwattr $C$DW$34, DW_AT_bit_size(0x01)
    1616                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1617                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
    1618              
    1619                      .dwendtag $C$DW$T$20
    1620              
    1621              
    1622              $C$DW$T$21      .dwtag  DW_TAG_union_type
    1623                      .dwattr $C$DW$T$21, DW_AT_name("GPACLEAR_REG")
    1624                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1625              $C$DW$35        .dwtag  DW_TAG_member
    1626                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
    1627                      .dwattr $C$DW$35, DW_AT_name("all")
    1628                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_all")
    1629                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1630                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
    1631              
    1632              $C$DW$36        .dwtag  DW_TAG_member
    1633                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$20)
    1634                      .dwattr $C$DW$36, DW_AT_name("bit")
    1635                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_bit")
    1636                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1637                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
    1638              
    1639                      .dwendtag $C$DW$T$21
    1640              
    1641              
    1642              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1643                      .dwattr $C$DW$T$22, DW_AT_name("GPADAT_BITS")
    1644                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    1645              $C$DW$37        .dwtag  DW_TAG_member
    1646                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
    1647                      .dwattr $C$DW$37, DW_AT_name("GPIOA0")
    1648                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_GPIOA0")
    1649                      .dwattr $C$DW$37, DW_AT_bit_offset(0x0f)
    1650                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
    1651                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1652                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
    1653              
    1654              $C$DW$38        .dwtag  DW_TAG_member
    1655                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
    1656                      .dwattr $C$DW$38, DW_AT_name("GPIOA1")
    1657                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_GPIOA1")
    1658                      .dwattr $C$DW$38, DW_AT_bit_offset(0x0e)
    1659                      .dwattr $C$DW$38, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Gpio.asm         PAGE   34

    1660                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1661                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
    1662              
    1663              $C$DW$39        .dwtag  DW_TAG_member
    1664                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
    1665                      .dwattr $C$DW$39, DW_AT_name("GPIOA2")
    1666                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_GPIOA2")
    1667                      .dwattr $C$DW$39, DW_AT_bit_offset(0x0d)
    1668                      .dwattr $C$DW$39, DW_AT_bit_size(0x01)
    1669                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1670                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
    1671              
    1672              $C$DW$40        .dwtag  DW_TAG_member
    1673                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
    1674                      .dwattr $C$DW$40, DW_AT_name("GPIOA3")
    1675                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_GPIOA3")
    1676                      .dwattr $C$DW$40, DW_AT_bit_offset(0x0c)
    1677                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
    1678                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1679                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
    1680              
    1681              $C$DW$41        .dwtag  DW_TAG_member
    1682                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
    1683                      .dwattr $C$DW$41, DW_AT_name("GPIOA4")
    1684                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_GPIOA4")
    1685                      .dwattr $C$DW$41, DW_AT_bit_offset(0x0b)
    1686                      .dwattr $C$DW$41, DW_AT_bit_size(0x01)
    1687                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1688                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
    1689              
    1690              $C$DW$42        .dwtag  DW_TAG_member
    1691                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
    1692                      .dwattr $C$DW$42, DW_AT_name("GPIOA5")
    1693                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_GPIOA5")
    1694                      .dwattr $C$DW$42, DW_AT_bit_offset(0x0a)
    1695                      .dwattr $C$DW$42, DW_AT_bit_size(0x01)
    1696                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1697                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
    1698              
    1699              $C$DW$43        .dwtag  DW_TAG_member
    1700                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
    1701                      .dwattr $C$DW$43, DW_AT_name("GPIOA6")
    1702                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_GPIOA6")
    1703                      .dwattr $C$DW$43, DW_AT_bit_offset(0x09)
    1704                      .dwattr $C$DW$43, DW_AT_bit_size(0x01)
    1705                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1706                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
    1707              
    1708              $C$DW$44        .dwtag  DW_TAG_member
    1709                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
    1710                      .dwattr $C$DW$44, DW_AT_name("GPIOA7")
    1711                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_GPIOA7")
    1712                      .dwattr $C$DW$44, DW_AT_bit_offset(0x08)
    1713                      .dwattr $C$DW$44, DW_AT_bit_size(0x01)
    1714                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Gpio.asm         PAGE   35

    1715                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
    1716              
    1717              $C$DW$45        .dwtag  DW_TAG_member
    1718                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
    1719                      .dwattr $C$DW$45, DW_AT_name("GPIOA8")
    1720                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_GPIOA8")
    1721                      .dwattr $C$DW$45, DW_AT_bit_offset(0x07)
    1722                      .dwattr $C$DW$45, DW_AT_bit_size(0x01)
    1723                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1724                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
    1725              
    1726              $C$DW$46        .dwtag  DW_TAG_member
    1727                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
    1728                      .dwattr $C$DW$46, DW_AT_name("GPIOA9")
    1729                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_GPIOA9")
    1730                      .dwattr $C$DW$46, DW_AT_bit_offset(0x06)
    1731                      .dwattr $C$DW$46, DW_AT_bit_size(0x01)
    1732                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1733                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1734              
    1735              $C$DW$47        .dwtag  DW_TAG_member
    1736                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
    1737                      .dwattr $C$DW$47, DW_AT_name("GPIOA10")
    1738                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_GPIOA10")
    1739                      .dwattr $C$DW$47, DW_AT_bit_offset(0x05)
    1740                      .dwattr $C$DW$47, DW_AT_bit_size(0x01)
    1741                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1742                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
    1743              
    1744              $C$DW$48        .dwtag  DW_TAG_member
    1745                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
    1746                      .dwattr $C$DW$48, DW_AT_name("GPIOA11")
    1747                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_GPIOA11")
    1748                      .dwattr $C$DW$48, DW_AT_bit_offset(0x04)
    1749                      .dwattr $C$DW$48, DW_AT_bit_size(0x01)
    1750                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1751                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1752              
    1753              $C$DW$49        .dwtag  DW_TAG_member
    1754                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
    1755                      .dwattr $C$DW$49, DW_AT_name("GPIOA12")
    1756                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_GPIOA12")
    1757                      .dwattr $C$DW$49, DW_AT_bit_offset(0x03)
    1758                      .dwattr $C$DW$49, DW_AT_bit_size(0x01)
    1759                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1760                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1761              
    1762              $C$DW$50        .dwtag  DW_TAG_member
    1763                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
    1764                      .dwattr $C$DW$50, DW_AT_name("GPIOA13")
    1765                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_GPIOA13")
    1766                      .dwattr $C$DW$50, DW_AT_bit_offset(0x02)
    1767                      .dwattr $C$DW$50, DW_AT_bit_size(0x01)
    1768                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1769                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Gpio.asm         PAGE   36

    1770              
    1771              $C$DW$51        .dwtag  DW_TAG_member
    1772                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
    1773                      .dwattr $C$DW$51, DW_AT_name("GPIOA14")
    1774                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_GPIOA14")
    1775                      .dwattr $C$DW$51, DW_AT_bit_offset(0x01)
    1776                      .dwattr $C$DW$51, DW_AT_bit_size(0x01)
    1777                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1778                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1779              
    1780              $C$DW$52        .dwtag  DW_TAG_member
    1781                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
    1782                      .dwattr $C$DW$52, DW_AT_name("GPIOA15")
    1783                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_GPIOA15")
    1784                      .dwattr $C$DW$52, DW_AT_bit_offset(0x00)
    1785                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
    1786                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1787                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1788              
    1789                      .dwendtag $C$DW$T$22
    1790              
    1791              
    1792              $C$DW$T$23      .dwtag  DW_TAG_union_type
    1793                      .dwattr $C$DW$T$23, DW_AT_name("GPADAT_REG")
    1794                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1795              $C$DW$53        .dwtag  DW_TAG_member
    1796                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
    1797                      .dwattr $C$DW$53, DW_AT_name("all")
    1798                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_all")
    1799                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1800                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1801              
    1802              $C$DW$54        .dwtag  DW_TAG_member
    1803                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$22)
    1804                      .dwattr $C$DW$54, DW_AT_name("bit")
    1805                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_bit")
    1806                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1807                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1808              
    1809                      .dwendtag $C$DW$T$23
    1810              
    1811              
    1812              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1813                      .dwattr $C$DW$T$24, DW_AT_name("GPADIR_BITS")
    1814                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1815              $C$DW$55        .dwtag  DW_TAG_member
    1816                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
    1817                      .dwattr $C$DW$55, DW_AT_name("GPIOA0")
    1818                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_GPIOA0")
    1819                      .dwattr $C$DW$55, DW_AT_bit_offset(0x0f)
    1820                      .dwattr $C$DW$55, DW_AT_bit_size(0x01)
    1821                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1822                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1823              
    1824              $C$DW$56        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Gpio.asm         PAGE   37

    1825                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
    1826                      .dwattr $C$DW$56, DW_AT_name("GPIOA1")
    1827                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_GPIOA1")
    1828                      .dwattr $C$DW$56, DW_AT_bit_offset(0x0e)
    1829                      .dwattr $C$DW$56, DW_AT_bit_size(0x01)
    1830                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1831                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1832              
    1833              $C$DW$57        .dwtag  DW_TAG_member
    1834                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
    1835                      .dwattr $C$DW$57, DW_AT_name("GPIOA2")
    1836                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_GPIOA2")
    1837                      .dwattr $C$DW$57, DW_AT_bit_offset(0x0d)
    1838                      .dwattr $C$DW$57, DW_AT_bit_size(0x01)
    1839                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1840                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1841              
    1842              $C$DW$58        .dwtag  DW_TAG_member
    1843                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
    1844                      .dwattr $C$DW$58, DW_AT_name("GPIOA3")
    1845                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_GPIOA3")
    1846                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0c)
    1847                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
    1848                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1849                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1850              
    1851              $C$DW$59        .dwtag  DW_TAG_member
    1852                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
    1853                      .dwattr $C$DW$59, DW_AT_name("GPIOA4")
    1854                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_GPIOA4")
    1855                      .dwattr $C$DW$59, DW_AT_bit_offset(0x0b)
    1856                      .dwattr $C$DW$59, DW_AT_bit_size(0x01)
    1857                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1858                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1859              
    1860              $C$DW$60        .dwtag  DW_TAG_member
    1861                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
    1862                      .dwattr $C$DW$60, DW_AT_name("GPIOA5")
    1863                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_GPIOA5")
    1864                      .dwattr $C$DW$60, DW_AT_bit_offset(0x0a)
    1865                      .dwattr $C$DW$60, DW_AT_bit_size(0x01)
    1866                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1867                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1868              
    1869              $C$DW$61        .dwtag  DW_TAG_member
    1870                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
    1871                      .dwattr $C$DW$61, DW_AT_name("GPIOA6")
    1872                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_GPIOA6")
    1873                      .dwattr $C$DW$61, DW_AT_bit_offset(0x09)
    1874                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
    1875                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1876                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1877              
    1878              $C$DW$62        .dwtag  DW_TAG_member
    1879                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Gpio.asm         PAGE   38

    1880                      .dwattr $C$DW$62, DW_AT_name("GPIOA7")
    1881                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_GPIOA7")
    1882                      .dwattr $C$DW$62, DW_AT_bit_offset(0x08)
    1883                      .dwattr $C$DW$62, DW_AT_bit_size(0x01)
    1884                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1885                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1886              
    1887              $C$DW$63        .dwtag  DW_TAG_member
    1888                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
    1889                      .dwattr $C$DW$63, DW_AT_name("GPIOA8")
    1890                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_GPIOA8")
    1891                      .dwattr $C$DW$63, DW_AT_bit_offset(0x07)
    1892                      .dwattr $C$DW$63, DW_AT_bit_size(0x01)
    1893                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1894                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1895              
    1896              $C$DW$64        .dwtag  DW_TAG_member
    1897                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
    1898                      .dwattr $C$DW$64, DW_AT_name("GPIOA9")
    1899                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_GPIOA9")
    1900                      .dwattr $C$DW$64, DW_AT_bit_offset(0x06)
    1901                      .dwattr $C$DW$64, DW_AT_bit_size(0x01)
    1902                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1903                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1904              
    1905              $C$DW$65        .dwtag  DW_TAG_member
    1906                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
    1907                      .dwattr $C$DW$65, DW_AT_name("GPIOA10")
    1908                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_GPIOA10")
    1909                      .dwattr $C$DW$65, DW_AT_bit_offset(0x05)
    1910                      .dwattr $C$DW$65, DW_AT_bit_size(0x01)
    1911                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1912                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1913              
    1914              $C$DW$66        .dwtag  DW_TAG_member
    1915                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1916                      .dwattr $C$DW$66, DW_AT_name("GPIOA11")
    1917                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_GPIOA11")
    1918                      .dwattr $C$DW$66, DW_AT_bit_offset(0x04)
    1919                      .dwattr $C$DW$66, DW_AT_bit_size(0x01)
    1920                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1921                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1922              
    1923              $C$DW$67        .dwtag  DW_TAG_member
    1924                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1925                      .dwattr $C$DW$67, DW_AT_name("GPIOA12")
    1926                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_GPIOA12")
    1927                      .dwattr $C$DW$67, DW_AT_bit_offset(0x03)
    1928                      .dwattr $C$DW$67, DW_AT_bit_size(0x01)
    1929                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1930                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1931              
    1932              $C$DW$68        .dwtag  DW_TAG_member
    1933                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1934                      .dwattr $C$DW$68, DW_AT_name("GPIOA13")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Gpio.asm         PAGE   39

    1935                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_GPIOA13")
    1936                      .dwattr $C$DW$68, DW_AT_bit_offset(0x02)
    1937                      .dwattr $C$DW$68, DW_AT_bit_size(0x01)
    1938                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1939                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1940              
    1941              $C$DW$69        .dwtag  DW_TAG_member
    1942                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1943                      .dwattr $C$DW$69, DW_AT_name("GPIOA14")
    1944                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_GPIOA14")
    1945                      .dwattr $C$DW$69, DW_AT_bit_offset(0x01)
    1946                      .dwattr $C$DW$69, DW_AT_bit_size(0x01)
    1947                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1948                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1949              
    1950              $C$DW$70        .dwtag  DW_TAG_member
    1951                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1952                      .dwattr $C$DW$70, DW_AT_name("GPIOA15")
    1953                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_GPIOA15")
    1954                      .dwattr $C$DW$70, DW_AT_bit_offset(0x00)
    1955                      .dwattr $C$DW$70, DW_AT_bit_size(0x01)
    1956                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1957                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1958              
    1959                      .dwendtag $C$DW$T$24
    1960              
    1961              
    1962              $C$DW$T$25      .dwtag  DW_TAG_union_type
    1963                      .dwattr $C$DW$T$25, DW_AT_name("GPADIR_REG")
    1964                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1965              $C$DW$71        .dwtag  DW_TAG_member
    1966                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1967                      .dwattr $C$DW$71, DW_AT_name("all")
    1968                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_all")
    1969                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1970                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1971              
    1972              $C$DW$72        .dwtag  DW_TAG_member
    1973                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$24)
    1974                      .dwattr $C$DW$72, DW_AT_name("bit")
    1975                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_bit")
    1976                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1977                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1978              
    1979                      .dwendtag $C$DW$T$25
    1980              
    1981              
    1982              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1983                      .dwattr $C$DW$T$26, DW_AT_name("GPAMUX_BITS")
    1984                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1985              $C$DW$73        .dwtag  DW_TAG_member
    1986                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1987                      .dwattr $C$DW$73, DW_AT_name("PWM1_GPIOA0")
    1988                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_PWM1_GPIOA0")
    1989                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0f)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Gpio.asm         PAGE   40

    1990                      .dwattr $C$DW$73, DW_AT_bit_size(0x01)
    1991                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1992                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1993              
    1994              $C$DW$74        .dwtag  DW_TAG_member
    1995                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1996                      .dwattr $C$DW$74, DW_AT_name("PWM2_GPIOA1")
    1997                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_PWM2_GPIOA1")
    1998                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0e)
    1999                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
    2000                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2001                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    2002              
    2003              $C$DW$75        .dwtag  DW_TAG_member
    2004                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    2005                      .dwattr $C$DW$75, DW_AT_name("PWM3_GPIOA2")
    2006                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_PWM3_GPIOA2")
    2007                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0d)
    2008                      .dwattr $C$DW$75, DW_AT_bit_size(0x01)
    2009                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2010                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    2011              
    2012              $C$DW$76        .dwtag  DW_TAG_member
    2013                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    2014                      .dwattr $C$DW$76, DW_AT_name("PWM4_GPIOA3")
    2015                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_PWM4_GPIOA3")
    2016                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0c)
    2017                      .dwattr $C$DW$76, DW_AT_bit_size(0x01)
    2018                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2019                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    2020              
    2021              $C$DW$77        .dwtag  DW_TAG_member
    2022                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    2023                      .dwattr $C$DW$77, DW_AT_name("PWM5_GPIOA4")
    2024                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_PWM5_GPIOA4")
    2025                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0b)
    2026                      .dwattr $C$DW$77, DW_AT_bit_size(0x01)
    2027                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2028                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    2029              
    2030              $C$DW$78        .dwtag  DW_TAG_member
    2031                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    2032                      .dwattr $C$DW$78, DW_AT_name("PWM6_GPIOA5")
    2033                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_PWM6_GPIOA5")
    2034                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0a)
    2035                      .dwattr $C$DW$78, DW_AT_bit_size(0x01)
    2036                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2037                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    2038              
    2039              $C$DW$79        .dwtag  DW_TAG_member
    2040                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    2041                      .dwattr $C$DW$79, DW_AT_name("T1PWM_GPIOA6")
    2042                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_T1PWM_GPIOA6")
    2043                      .dwattr $C$DW$79, DW_AT_bit_offset(0x09)
    2044                      .dwattr $C$DW$79, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Gpio.asm         PAGE   41

    2045                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2046                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    2047              
    2048              $C$DW$80        .dwtag  DW_TAG_member
    2049                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    2050                      .dwattr $C$DW$80, DW_AT_name("T2PWM_GPIOA7")
    2051                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_T2PWM_GPIOA7")
    2052                      .dwattr $C$DW$80, DW_AT_bit_offset(0x08)
    2053                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
    2054                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2055                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    2056              
    2057              $C$DW$81        .dwtag  DW_TAG_member
    2058                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    2059                      .dwattr $C$DW$81, DW_AT_name("CAP1Q1_GPIOA8")
    2060                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_CAP1Q1_GPIOA8")
    2061                      .dwattr $C$DW$81, DW_AT_bit_offset(0x07)
    2062                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    2063                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2064                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    2065              
    2066              $C$DW$82        .dwtag  DW_TAG_member
    2067                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    2068                      .dwattr $C$DW$82, DW_AT_name("CAP2Q2_GPIOA9")
    2069                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_CAP2Q2_GPIOA9")
    2070                      .dwattr $C$DW$82, DW_AT_bit_offset(0x06)
    2071                      .dwattr $C$DW$82, DW_AT_bit_size(0x01)
    2072                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2073                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    2074              
    2075              $C$DW$83        .dwtag  DW_TAG_member
    2076                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    2077                      .dwattr $C$DW$83, DW_AT_name("CAP3QI1_GPIOA10")
    2078                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_CAP3QI1_GPIOA10")
    2079                      .dwattr $C$DW$83, DW_AT_bit_offset(0x05)
    2080                      .dwattr $C$DW$83, DW_AT_bit_size(0x01)
    2081                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2082                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    2083              
    2084              $C$DW$84        .dwtag  DW_TAG_member
    2085                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    2086                      .dwattr $C$DW$84, DW_AT_name("TDIRA_GPIOA11")
    2087                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_TDIRA_GPIOA11")
    2088                      .dwattr $C$DW$84, DW_AT_bit_offset(0x04)
    2089                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
    2090                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2091                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    2092              
    2093              $C$DW$85        .dwtag  DW_TAG_member
    2094                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    2095                      .dwattr $C$DW$85, DW_AT_name("TCLKINA_GPIOA12")
    2096                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_TCLKINA_GPIOA12")
    2097                      .dwattr $C$DW$85, DW_AT_bit_offset(0x03)
    2098                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
    2099                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Gpio.asm         PAGE   42

    2100                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    2101              
    2102              $C$DW$86        .dwtag  DW_TAG_member
    2103                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    2104                      .dwattr $C$DW$86, DW_AT_name("C1TRIP_GPIOA13")
    2105                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_C1TRIP_GPIOA13")
    2106                      .dwattr $C$DW$86, DW_AT_bit_offset(0x02)
    2107                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
    2108                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2109                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    2110              
    2111              $C$DW$87        .dwtag  DW_TAG_member
    2112                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    2113                      .dwattr $C$DW$87, DW_AT_name("C2TRIP_GPIOA14")
    2114                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_C2TRIP_GPIOA14")
    2115                      .dwattr $C$DW$87, DW_AT_bit_offset(0x01)
    2116                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
    2117                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2118                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    2119              
    2120              $C$DW$88        .dwtag  DW_TAG_member
    2121                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    2122                      .dwattr $C$DW$88, DW_AT_name("C3TRIP_GPIOA15")
    2123                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_C3TRIP_GPIOA15")
    2124                      .dwattr $C$DW$88, DW_AT_bit_offset(0x00)
    2125                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    2126                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2127                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    2128              
    2129                      .dwendtag $C$DW$T$26
    2130              
    2131              
    2132              $C$DW$T$27      .dwtag  DW_TAG_union_type
    2133                      .dwattr $C$DW$T$27, DW_AT_name("GPAMUX_REG")
    2134                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    2135              $C$DW$89        .dwtag  DW_TAG_member
    2136                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    2137                      .dwattr $C$DW$89, DW_AT_name("all")
    2138                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_all")
    2139                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2140                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    2141              
    2142              $C$DW$90        .dwtag  DW_TAG_member
    2143                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$26)
    2144                      .dwattr $C$DW$90, DW_AT_name("bit")
    2145                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_bit")
    2146                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2147                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    2148              
    2149                      .dwendtag $C$DW$T$27
    2150              
    2151              
    2152              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2153                      .dwattr $C$DW$T$28, DW_AT_name("GPAQUAL_BITS")
    2154                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Gpio.asm         PAGE   43

    2155              $C$DW$91        .dwtag  DW_TAG_member
    2156                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    2157                      .dwattr $C$DW$91, DW_AT_name("QUALPRD")
    2158                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_QUALPRD")
    2159                      .dwattr $C$DW$91, DW_AT_bit_offset(0x08)
    2160                      .dwattr $C$DW$91, DW_AT_bit_size(0x08)
    2161                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2162                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    2163              
    2164              $C$DW$92        .dwtag  DW_TAG_member
    2165                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    2166                      .dwattr $C$DW$92, DW_AT_name("rsvd1")
    2167                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_rsvd1")
    2168                      .dwattr $C$DW$92, DW_AT_bit_offset(0x00)
    2169                      .dwattr $C$DW$92, DW_AT_bit_size(0x08)
    2170                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2171                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    2172              
    2173                      .dwendtag $C$DW$T$28
    2174              
    2175              
    2176              $C$DW$T$29      .dwtag  DW_TAG_union_type
    2177                      .dwattr $C$DW$T$29, DW_AT_name("GPAQUAL_REG")
    2178                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    2179              $C$DW$93        .dwtag  DW_TAG_member
    2180                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    2181                      .dwattr $C$DW$93, DW_AT_name("all")
    2182                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_all")
    2183                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2184                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    2185              
    2186              $C$DW$94        .dwtag  DW_TAG_member
    2187                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$28)
    2188                      .dwattr $C$DW$94, DW_AT_name("bit")
    2189                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_bit")
    2190                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2191                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    2192              
    2193                      .dwendtag $C$DW$T$29
    2194              
    2195              
    2196              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2197                      .dwattr $C$DW$T$30, DW_AT_name("GPASET_BITS")
    2198                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    2199              $C$DW$95        .dwtag  DW_TAG_member
    2200                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    2201                      .dwattr $C$DW$95, DW_AT_name("GPIOA0")
    2202                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_GPIOA0")
    2203                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0f)
    2204                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    2205                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2206                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    2207              
    2208              $C$DW$96        .dwtag  DW_TAG_member
    2209                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Gpio.asm         PAGE   44

    2210                      .dwattr $C$DW$96, DW_AT_name("GPIOA1")
    2211                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_GPIOA1")
    2212                      .dwattr $C$DW$96, DW_AT_bit_offset(0x0e)
    2213                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    2214                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2215                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    2216              
    2217              $C$DW$97        .dwtag  DW_TAG_member
    2218                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    2219                      .dwattr $C$DW$97, DW_AT_name("GPIOA2")
    2220                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_GPIOA2")
    2221                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0d)
    2222                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    2223                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2224                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    2225              
    2226              $C$DW$98        .dwtag  DW_TAG_member
    2227                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    2228                      .dwattr $C$DW$98, DW_AT_name("GPIOA3")
    2229                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_GPIOA3")
    2230                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0c)
    2231                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    2232                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2233                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    2234              
    2235              $C$DW$99        .dwtag  DW_TAG_member
    2236                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    2237                      .dwattr $C$DW$99, DW_AT_name("GPIOA4")
    2238                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_GPIOA4")
    2239                      .dwattr $C$DW$99, DW_AT_bit_offset(0x0b)
    2240                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    2241                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2242                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2243              
    2244              $C$DW$100       .dwtag  DW_TAG_member
    2245                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    2246                      .dwattr $C$DW$100, DW_AT_name("GPIOA5")
    2247                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_GPIOA5")
    2248                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0a)
    2249                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    2250                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2251                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2252              
    2253              $C$DW$101       .dwtag  DW_TAG_member
    2254                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    2255                      .dwattr $C$DW$101, DW_AT_name("GPIOA6")
    2256                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_GPIOA6")
    2257                      .dwattr $C$DW$101, DW_AT_bit_offset(0x09)
    2258                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    2259                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2260                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2261              
    2262              $C$DW$102       .dwtag  DW_TAG_member
    2263                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    2264                      .dwattr $C$DW$102, DW_AT_name("GPIOA7")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Gpio.asm         PAGE   45

    2265                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_GPIOA7")
    2266                      .dwattr $C$DW$102, DW_AT_bit_offset(0x08)
    2267                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    2268                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2269                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2270              
    2271              $C$DW$103       .dwtag  DW_TAG_member
    2272                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    2273                      .dwattr $C$DW$103, DW_AT_name("GPIOA8")
    2274                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_GPIOA8")
    2275                      .dwattr $C$DW$103, DW_AT_bit_offset(0x07)
    2276                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    2277                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2278                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2279              
    2280              $C$DW$104       .dwtag  DW_TAG_member
    2281                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    2282                      .dwattr $C$DW$104, DW_AT_name("GPIOA9")
    2283                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_GPIOA9")
    2284                      .dwattr $C$DW$104, DW_AT_bit_offset(0x06)
    2285                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    2286                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2287                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2288              
    2289              $C$DW$105       .dwtag  DW_TAG_member
    2290                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    2291                      .dwattr $C$DW$105, DW_AT_name("GPIOA10")
    2292                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_GPIOA10")
    2293                      .dwattr $C$DW$105, DW_AT_bit_offset(0x05)
    2294                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    2295                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2296                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2297              
    2298              $C$DW$106       .dwtag  DW_TAG_member
    2299                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    2300                      .dwattr $C$DW$106, DW_AT_name("GPIOA11")
    2301                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_GPIOA11")
    2302                      .dwattr $C$DW$106, DW_AT_bit_offset(0x04)
    2303                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    2304                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2305                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2306              
    2307              $C$DW$107       .dwtag  DW_TAG_member
    2308                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    2309                      .dwattr $C$DW$107, DW_AT_name("GPIOA12")
    2310                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_GPIOA12")
    2311                      .dwattr $C$DW$107, DW_AT_bit_offset(0x03)
    2312                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    2313                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2314                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2315              
    2316              $C$DW$108       .dwtag  DW_TAG_member
    2317                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    2318                      .dwattr $C$DW$108, DW_AT_name("GPIOA13")
    2319                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIOA13")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Gpio.asm         PAGE   46

    2320                      .dwattr $C$DW$108, DW_AT_bit_offset(0x02)
    2321                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    2322                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2323                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2324              
    2325              $C$DW$109       .dwtag  DW_TAG_member
    2326                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    2327                      .dwattr $C$DW$109, DW_AT_name("GPIOA14")
    2328                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIOA14")
    2329                      .dwattr $C$DW$109, DW_AT_bit_offset(0x01)
    2330                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    2331                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2332                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2333              
    2334              $C$DW$110       .dwtag  DW_TAG_member
    2335                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    2336                      .dwattr $C$DW$110, DW_AT_name("GPIOA15")
    2337                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIOA15")
    2338                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00)
    2339                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    2340                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2341                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2342              
    2343                      .dwendtag $C$DW$T$30
    2344              
    2345              
    2346              $C$DW$T$31      .dwtag  DW_TAG_union_type
    2347                      .dwattr $C$DW$T$31, DW_AT_name("GPASET_REG")
    2348                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    2349              $C$DW$111       .dwtag  DW_TAG_member
    2350                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    2351                      .dwattr $C$DW$111, DW_AT_name("all")
    2352                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_all")
    2353                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2354                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2355              
    2356              $C$DW$112       .dwtag  DW_TAG_member
    2357                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$30)
    2358                      .dwattr $C$DW$112, DW_AT_name("bit")
    2359                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_bit")
    2360                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2361                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2362              
    2363                      .dwendtag $C$DW$T$31
    2364              
    2365              
    2366              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2367                      .dwattr $C$DW$T$32, DW_AT_name("GPATOGGLE_BITS")
    2368                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    2369              $C$DW$113       .dwtag  DW_TAG_member
    2370                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    2371                      .dwattr $C$DW$113, DW_AT_name("GPIOA0")
    2372                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPIOA0")
    2373                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0f)
    2374                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Gpio.asm         PAGE   47

    2375                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2376                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2377              
    2378              $C$DW$114       .dwtag  DW_TAG_member
    2379                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    2380                      .dwattr $C$DW$114, DW_AT_name("GPIOA1")
    2381                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIOA1")
    2382                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0e)
    2383                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    2384                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2385                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2386              
    2387              $C$DW$115       .dwtag  DW_TAG_member
    2388                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    2389                      .dwattr $C$DW$115, DW_AT_name("GPIOA2")
    2390                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_GPIOA2")
    2391                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0d)
    2392                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    2393                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2394                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2395              
    2396              $C$DW$116       .dwtag  DW_TAG_member
    2397                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    2398                      .dwattr $C$DW$116, DW_AT_name("GPIOA3")
    2399                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_GPIOA3")
    2400                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0c)
    2401                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    2402                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2403                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2404              
    2405              $C$DW$117       .dwtag  DW_TAG_member
    2406                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    2407                      .dwattr $C$DW$117, DW_AT_name("GPIOA4")
    2408                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_GPIOA4")
    2409                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0b)
    2410                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    2411                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2412                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2413              
    2414              $C$DW$118       .dwtag  DW_TAG_member
    2415                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    2416                      .dwattr $C$DW$118, DW_AT_name("GPIOA5")
    2417                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPIOA5")
    2418                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0a)
    2419                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    2420                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2421                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2422              
    2423              $C$DW$119       .dwtag  DW_TAG_member
    2424                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    2425                      .dwattr $C$DW$119, DW_AT_name("GPIOA6")
    2426                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_GPIOA6")
    2427                      .dwattr $C$DW$119, DW_AT_bit_offset(0x09)
    2428                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    2429                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Gpio.asm         PAGE   48

    2430                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2431              
    2432              $C$DW$120       .dwtag  DW_TAG_member
    2433                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    2434                      .dwattr $C$DW$120, DW_AT_name("GPIOA7")
    2435                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPIOA7")
    2436                      .dwattr $C$DW$120, DW_AT_bit_offset(0x08)
    2437                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    2438                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2439                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2440              
    2441              $C$DW$121       .dwtag  DW_TAG_member
    2442                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    2443                      .dwattr $C$DW$121, DW_AT_name("GPIOA8")
    2444                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_GPIOA8")
    2445                      .dwattr $C$DW$121, DW_AT_bit_offset(0x07)
    2446                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    2447                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2448                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2449              
    2450              $C$DW$122       .dwtag  DW_TAG_member
    2451                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    2452                      .dwattr $C$DW$122, DW_AT_name("GPIOA9")
    2453                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_GPIOA9")
    2454                      .dwattr $C$DW$122, DW_AT_bit_offset(0x06)
    2455                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    2456                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2457                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2458              
    2459              $C$DW$123       .dwtag  DW_TAG_member
    2460                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    2461                      .dwattr $C$DW$123, DW_AT_name("GPIOA10")
    2462                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPIOA10")
    2463                      .dwattr $C$DW$123, DW_AT_bit_offset(0x05)
    2464                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    2465                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2466                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2467              
    2468              $C$DW$124       .dwtag  DW_TAG_member
    2469                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    2470                      .dwattr $C$DW$124, DW_AT_name("GPIOA11")
    2471                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIOA11")
    2472                      .dwattr $C$DW$124, DW_AT_bit_offset(0x04)
    2473                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    2474                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2475                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2476              
    2477              $C$DW$125       .dwtag  DW_TAG_member
    2478                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    2479                      .dwattr $C$DW$125, DW_AT_name("GPIOA12")
    2480                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_GPIOA12")
    2481                      .dwattr $C$DW$125, DW_AT_bit_offset(0x03)
    2482                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    2483                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2484                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Gpio.asm         PAGE   49

    2485              
    2486              $C$DW$126       .dwtag  DW_TAG_member
    2487                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    2488                      .dwattr $C$DW$126, DW_AT_name("GPIOA13")
    2489                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_GPIOA13")
    2490                      .dwattr $C$DW$126, DW_AT_bit_offset(0x02)
    2491                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    2492                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2493                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2494              
    2495              $C$DW$127       .dwtag  DW_TAG_member
    2496                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    2497                      .dwattr $C$DW$127, DW_AT_name("GPIOA14")
    2498                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIOA14")
    2499                      .dwattr $C$DW$127, DW_AT_bit_offset(0x01)
    2500                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    2501                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2502                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2503              
    2504              $C$DW$128       .dwtag  DW_TAG_member
    2505                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    2506                      .dwattr $C$DW$128, DW_AT_name("GPIOA15")
    2507                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIOA15")
    2508                      .dwattr $C$DW$128, DW_AT_bit_offset(0x00)
    2509                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    2510                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2511                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2512              
    2513                      .dwendtag $C$DW$T$32
    2514              
    2515              
    2516              $C$DW$T$33      .dwtag  DW_TAG_union_type
    2517                      .dwattr $C$DW$T$33, DW_AT_name("GPATOGGLE_REG")
    2518                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    2519              $C$DW$129       .dwtag  DW_TAG_member
    2520                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    2521                      .dwattr $C$DW$129, DW_AT_name("all")
    2522                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_all")
    2523                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2524                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2525              
    2526              $C$DW$130       .dwtag  DW_TAG_member
    2527                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$32)
    2528                      .dwattr $C$DW$130, DW_AT_name("bit")
    2529                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_bit")
    2530                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2531                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2532              
    2533                      .dwendtag $C$DW$T$33
    2534              
    2535              
    2536              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2537                      .dwattr $C$DW$T$34, DW_AT_name("GPBCLEAR_BITS")
    2538                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    2539              $C$DW$131       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Gpio.asm         PAGE   50

    2540                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    2541                      .dwattr $C$DW$131, DW_AT_name("GPIOB0")
    2542                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIOB0")
    2543                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0f)
    2544                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    2545                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2546                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2547              
    2548              $C$DW$132       .dwtag  DW_TAG_member
    2549                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    2550                      .dwattr $C$DW$132, DW_AT_name("GPIOB1")
    2551                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIOB1")
    2552                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0e)
    2553                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    2554                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2555                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2556              
    2557              $C$DW$133       .dwtag  DW_TAG_member
    2558                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2559                      .dwattr $C$DW$133, DW_AT_name("GPIOB2")
    2560                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIOB2")
    2561                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0d)
    2562                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    2563                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2564                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2565              
    2566              $C$DW$134       .dwtag  DW_TAG_member
    2567                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    2568                      .dwattr $C$DW$134, DW_AT_name("GPIOB3")
    2569                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIOB3")
    2570                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0c)
    2571                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    2572                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2573                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2574              
    2575              $C$DW$135       .dwtag  DW_TAG_member
    2576                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2577                      .dwattr $C$DW$135, DW_AT_name("GPIOB4")
    2578                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIOB4")
    2579                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0b)
    2580                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    2581                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2582                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2583              
    2584              $C$DW$136       .dwtag  DW_TAG_member
    2585                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2586                      .dwattr $C$DW$136, DW_AT_name("GPIOB5")
    2587                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIOB5")
    2588                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0a)
    2589                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    2590                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2591                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2592              
    2593              $C$DW$137       .dwtag  DW_TAG_member
    2594                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Gpio.asm         PAGE   51

    2595                      .dwattr $C$DW$137, DW_AT_name("GPIOB6")
    2596                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIOB6")
    2597                      .dwattr $C$DW$137, DW_AT_bit_offset(0x09)
    2598                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    2599                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2600                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2601              
    2602              $C$DW$138       .dwtag  DW_TAG_member
    2603                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2604                      .dwattr $C$DW$138, DW_AT_name("GPIOB7")
    2605                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIOB7")
    2606                      .dwattr $C$DW$138, DW_AT_bit_offset(0x08)
    2607                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    2608                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2609                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2610              
    2611              $C$DW$139       .dwtag  DW_TAG_member
    2612                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2613                      .dwattr $C$DW$139, DW_AT_name("GPIOB8")
    2614                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIOB8")
    2615                      .dwattr $C$DW$139, DW_AT_bit_offset(0x07)
    2616                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    2617                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2618                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2619              
    2620              $C$DW$140       .dwtag  DW_TAG_member
    2621                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    2622                      .dwattr $C$DW$140, DW_AT_name("GPIOB9")
    2623                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPIOB9")
    2624                      .dwattr $C$DW$140, DW_AT_bit_offset(0x06)
    2625                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    2626                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2627                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2628              
    2629              $C$DW$141       .dwtag  DW_TAG_member
    2630                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    2631                      .dwattr $C$DW$141, DW_AT_name("GPIOB10")
    2632                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPIOB10")
    2633                      .dwattr $C$DW$141, DW_AT_bit_offset(0x05)
    2634                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    2635                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2636                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2637              
    2638              $C$DW$142       .dwtag  DW_TAG_member
    2639                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2640                      .dwattr $C$DW$142, DW_AT_name("GPIOB11")
    2641                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPIOB11")
    2642                      .dwattr $C$DW$142, DW_AT_bit_offset(0x04)
    2643                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    2644                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2645                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2646              
    2647              $C$DW$143       .dwtag  DW_TAG_member
    2648                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2649                      .dwattr $C$DW$143, DW_AT_name("GPIOB12")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Gpio.asm         PAGE   52

    2650                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPIOB12")
    2651                      .dwattr $C$DW$143, DW_AT_bit_offset(0x03)
    2652                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    2653                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2654                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2655              
    2656              $C$DW$144       .dwtag  DW_TAG_member
    2657                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2658                      .dwattr $C$DW$144, DW_AT_name("GPIOB13")
    2659                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIOB13")
    2660                      .dwattr $C$DW$144, DW_AT_bit_offset(0x02)
    2661                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    2662                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2663                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2664              
    2665              $C$DW$145       .dwtag  DW_TAG_member
    2666                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2667                      .dwattr $C$DW$145, DW_AT_name("GPIOB14")
    2668                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIOB14")
    2669                      .dwattr $C$DW$145, DW_AT_bit_offset(0x01)
    2670                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    2671                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2672                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2673              
    2674              $C$DW$146       .dwtag  DW_TAG_member
    2675                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2676                      .dwattr $C$DW$146, DW_AT_name("GPIOB15")
    2677                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_GPIOB15")
    2678                      .dwattr $C$DW$146, DW_AT_bit_offset(0x00)
    2679                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    2680                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2681                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2682              
    2683                      .dwendtag $C$DW$T$34
    2684              
    2685              
    2686              $C$DW$T$35      .dwtag  DW_TAG_union_type
    2687                      .dwattr $C$DW$T$35, DW_AT_name("GPBCLEAR_REG")
    2688                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    2689              $C$DW$147       .dwtag  DW_TAG_member
    2690                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    2691                      .dwattr $C$DW$147, DW_AT_name("all")
    2692                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_all")
    2693                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2694                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2695              
    2696              $C$DW$148       .dwtag  DW_TAG_member
    2697                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$34)
    2698                      .dwattr $C$DW$148, DW_AT_name("bit")
    2699                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_bit")
    2700                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2701                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2702              
    2703                      .dwendtag $C$DW$T$35
    2704              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Gpio.asm         PAGE   53

    2705              
    2706              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2707                      .dwattr $C$DW$T$36, DW_AT_name("GPBDAT_BITS")
    2708                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2709              $C$DW$149       .dwtag  DW_TAG_member
    2710                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2711                      .dwattr $C$DW$149, DW_AT_name("GPIOB0")
    2712                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_GPIOB0")
    2713                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0f)
    2714                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    2715                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2716                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2717              
    2718              $C$DW$150       .dwtag  DW_TAG_member
    2719                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2720                      .dwattr $C$DW$150, DW_AT_name("GPIOB1")
    2721                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPIOB1")
    2722                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0e)
    2723                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    2724                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2725                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2726              
    2727              $C$DW$151       .dwtag  DW_TAG_member
    2728                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2729                      .dwattr $C$DW$151, DW_AT_name("GPIOB2")
    2730                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_GPIOB2")
    2731                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0d)
    2732                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    2733                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2734                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2735              
    2736              $C$DW$152       .dwtag  DW_TAG_member
    2737                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2738                      .dwattr $C$DW$152, DW_AT_name("GPIOB3")
    2739                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_GPIOB3")
    2740                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0c)
    2741                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    2742                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2743                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2744              
    2745              $C$DW$153       .dwtag  DW_TAG_member
    2746                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2747                      .dwattr $C$DW$153, DW_AT_name("GPIOB4")
    2748                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_GPIOB4")
    2749                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0b)
    2750                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    2751                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2752                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2753              
    2754              $C$DW$154       .dwtag  DW_TAG_member
    2755                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2756                      .dwattr $C$DW$154, DW_AT_name("GPIOB5")
    2757                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_GPIOB5")
    2758                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0a)
