TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/main_nonBIOS.asm PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Tue Apr  8 10:05:53 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=softlib --hll_source=on --mem_model:code
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/repo/jabil2025/gpb/gpb_project_v3/main_nonBIOS.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\repo\jabil2025\gpb\gpb_project_v3\projects\example_nonBIOS_ram\D
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    5665 0000077d 1A03!         OR        @$BLOCKED(_GpioDataRegs)+3,#0x0002 ; [CPU_ALU] |679| 
         0000077e 0002 
    5666                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/main_nonBIOS.c",line 680,column 3,is_stmt,isa 0
    5667              ;----------------------------------------------------------------------
    5668              ; 680 | GpioDataRegs.GPATOGGLE.bit.GPIOA2 = 1;                                 
    5669              ;----------------------------------------------------------------------
    5670 0000077f 1A03!         OR        @$BLOCKED(_GpioDataRegs)+3,#0x0004 ; [CPU_ALU] |680| 
         00000780 0004 
    5671                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/main_nonBIOS.c",line 117,column 8,is_stmt,isa 0
    5672 00000781 FFEF          B         $C$L5,UNC             ; [CPU_ALU] |117| 
         00000782 F8FD 
    5673                      ; branch occurs ; [] |117| 
    5674                      .dwattr $C$DW$79, DW_AT_TI_end_file("C:/repo/jabil2025/gpb/gpb_project_v3/main_nonBIOS.c")
    5675                      .dwattr $C$DW$79, DW_AT_TI_end_line(0x2ac)
    5676                      .dwattr $C$DW$79, DW_AT_TI_end_column(0x01)
    5677                      .dwendentry
    5678                      .dwendtag $C$DW$79
    5679              
    5680              ;**************************************************************
    5681              ;* UNDEFINED EXTERNAL REFERENCES                              *
    5682              ;**************************************************************
    5683                      .global _InitSysCtrl
    5684                      .global _InitXintf
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/main_nonBIOS.asm PAGE  113

    5685                      .global _InitGpio
    5686                      .global _InitPieCtrl
    5687                      .global _InitFlash
    5688                      .global _InitAdc
    5689                      .global _InitEv
    5690                      .global _InitECan
    5691                      .global _SetDBGIER
    5692                      .global _DelayUs
    5693                      .global _ConfigEepromInterface
    5694                      .global _EepromWriteByte
    5695                      .global _ConfigDacInterface
    5696                      .global _TxDacData
    5697                      .global _AuxEepromWriteStatus
    5698                      .global _AuxEepromWriteEnable
    5699                      .global _AuxEepromWriteByte
    5700                      .global _ConfigMax7301Interface
    5701                      .global _ConfigMax7301DIO
    5702                      .global _Max7301Write
    5703                      .global _ConfigTlv1570Interface
    5704                      .global _secureRamFuncs_loadstart
    5705                      .global _secureRamFuncs_loadend
    5706                      .global _secureRamFuncs_runstart
    5707                      .global _InitSpi
    5708                      .global _GetAdcCalibrationFactors
    5709                      .global _TxECanMsg
    5710                      .global _RxECanMsg
    5711                      .global _StartConversion
    5712                      .global _GetAdcConversion
    5713                      .global _EepromReadByte
    5714                      .global _ReadCpld
    5715                      .global _EepromTest
    5716                      .global _AuxEepromTest
    5717                      .global _AuxEepromReadStatus
    5718                      .global _AuxEepromReadByte
    5719                      .global _TxSpi
    5720                      .global _FormatSpiTxWord
    5721                      .global _SpiRxNotReady
    5722                      .global _RxSpi
    5723                      .global _ReadDspDI_B
    5724                      .global _ReadDspID_A
    5725                      .global _Max7301Input
    5726                      .global _WriteCpld
    5727                      .global _WriteDspDO_A
    5728                      .global _WriteDspDO_EN
    5729                      .global _TestRam
    5730                      .global _CheckRxMailBoxes
    5731                      .global _crcCalc32
    5732                      .global _Tlv1570Convert
    5733                      .global _CpuTimer0Regs
    5734                      .global _PieCtrlRegs
    5735                      .global _GpioDataRegs
    5736                      .global _memcpy
    5737                      .global I$$TOFS
    5738                      .global FS$$CMP
    5739                      .global FS$$MPY
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/main_nonBIOS.asm PAGE  114

    5740                      .global FS$$TOL
    5741                      .global U$$TOFS
    5742                      .global FS$$DIV
    5743                      .global FS$$ADD
    5744              
    5745              ;***************************************************************
    5746              ;* TYPE INFORMATION                                            *
    5747              ;***************************************************************
    5748              
    5749              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    5750                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    5751              $C$DW$278       .dwtag  DW_TAG_member
    5752                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$19)
    5753                      .dwattr $C$DW$278, DW_AT_name("MODE_A")
    5754                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_MODE_A")
    5755                      .dwattr $C$DW$278, DW_AT_bit_offset(0x0f)
    5756                      .dwattr $C$DW$278, DW_AT_bit_size(0x01)
    5757                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5758                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    5759              
    5760              $C$DW$279       .dwtag  DW_TAG_member
    5761                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$19)
    5762                      .dwattr $C$DW$279, DW_AT_name("MODE_B")
    5763                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_MODE_B")
    5764                      .dwattr $C$DW$279, DW_AT_bit_offset(0x0e)
    5765                      .dwattr $C$DW$279, DW_AT_bit_size(0x01)
    5766                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5767                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    5768              
    5769              $C$DW$280       .dwtag  DW_TAG_member
    5770                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$19)
    5771                      .dwattr $C$DW$280, DW_AT_name("SELFTEST_OK")
    5772                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_SELFTEST_OK")
    5773                      .dwattr $C$DW$280, DW_AT_bit_offset(0x0d)
    5774                      .dwattr $C$DW$280, DW_AT_bit_size(0x01)
    5775                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5776                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    5777              
    5778              $C$DW$281       .dwtag  DW_TAG_member
    5779                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$19)
    5780                      .dwattr $C$DW$281, DW_AT_name("FLTREF_CTRL")
    5781                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_FLTREF_CTRL")
    5782                      .dwattr $C$DW$281, DW_AT_bit_offset(0x0c)
    5783                      .dwattr $C$DW$281, DW_AT_bit_size(0x01)
    5784                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5785                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    5786              
    5787              $C$DW$282       .dwtag  DW_TAG_member
    5788                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$19)
    5789                      .dwattr $C$DW$282, DW_AT_name("BMHV_ENA")
    5790                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_BMHV_ENA")
    5791                      .dwattr $C$DW$282, DW_AT_bit_offset(0x0b)
    5792                      .dwattr $C$DW$282, DW_AT_bit_size(0x01)
    5793                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5794                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/main_nonBIOS.asm PAGE  115

    5795              
    5796              $C$DW$283       .dwtag  DW_TAG_member
    5797                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$19)
    5798                      .dwattr $C$DW$283, DW_AT_name("BMHV_ENB")
    5799                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_BMHV_ENB")
    5800                      .dwattr $C$DW$283, DW_AT_bit_offset(0x0a)
    5801                      .dwattr $C$DW$283, DW_AT_bit_size(0x01)
    5802                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5803                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    5804              
    5805              $C$DW$284       .dwtag  DW_TAG_member
    5806                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$19)
    5807                      .dwattr $C$DW$284, DW_AT_name("BEL_CNTL")
    5808                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_BEL_CNTL")
    5809                      .dwattr $C$DW$284, DW_AT_bit_offset(0x09)
    5810                      .dwattr $C$DW$284, DW_AT_bit_size(0x01)
    5811                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5812                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    5813              
    5814              $C$DW$285       .dwtag  DW_TAG_member
    5815                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$19)
    5816                      .dwattr $C$DW$285, DW_AT_name("CANRX_LED")
    5817                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_CANRX_LED")
    5818                      .dwattr $C$DW$285, DW_AT_bit_offset(0x08)
    5819                      .dwattr $C$DW$285, DW_AT_bit_size(0x01)
    5820                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5821                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    5822              
    5823              $C$DW$286       .dwtag  DW_TAG_member
    5824                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$19)
    5825                      .dwattr $C$DW$286, DW_AT_name("CANTX_LED")
    5826                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_CANTX_LED")
    5827                      .dwattr $C$DW$286, DW_AT_bit_offset(0x07)
    5828                      .dwattr $C$DW$286, DW_AT_bit_size(0x01)
    5829                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5830                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    5831              
    5832              $C$DW$287       .dwtag  DW_TAG_member
    5833                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$19)
    5834                      .dwattr $C$DW$287, DW_AT_name("MJIL_RST")
    5835                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_MJIL_RST")
    5836                      .dwattr $C$DW$287, DW_AT_bit_offset(0x06)
    5837                      .dwattr $C$DW$287, DW_AT_bit_size(0x01)
    5838                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5839                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    5840              
    5841              $C$DW$288       .dwtag  DW_TAG_member
    5842                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$19)
    5843                      .dwattr $C$DW$288, DW_AT_name("MNIL_RST")
    5844                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_MNIL_RST")
    5845                      .dwattr $C$DW$288, DW_AT_bit_offset(0x05)
    5846                      .dwattr $C$DW$288, DW_AT_bit_size(0x01)
    5847                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5848                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    5849              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/main_nonBIOS.asm PAGE  116

    5850              $C$DW$289       .dwtag  DW_TAG_member
    5851                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$19)
    5852                      .dwattr $C$DW$289, DW_AT_name("LOFCLK")
    5853                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_LOFCLK")
    5854                      .dwattr $C$DW$289, DW_AT_bit_offset(0x04)
    5855                      .dwattr $C$DW$289, DW_AT_bit_size(0x01)
    5856                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5857                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    5858              
    5859              $C$DW$290       .dwtag  DW_TAG_member
    5860                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$19)
    5861                      .dwattr $C$DW$290, DW_AT_name("VAC_ENAB")
    5862                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_VAC_ENAB")
    5863                      .dwattr $C$DW$290, DW_AT_bit_offset(0x03)
    5864                      .dwattr $C$DW$290, DW_AT_bit_size(0x01)
    5865                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5866                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    5867              
    5868              $C$DW$291       .dwtag  DW_TAG_member
    5869                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$19)
    5870                      .dwattr $C$DW$291, DW_AT_name("M24V_CTRL")
    5871                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_M24V_CTRL")
    5872                      .dwattr $C$DW$291, DW_AT_bit_offset(0x02)
    5873                      .dwattr $C$DW$291, DW_AT_bit_size(0x01)
    5874                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5875                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    5876              
    5877              $C$DW$292       .dwtag  DW_TAG_member
    5878                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$19)
    5879                      .dwattr $C$DW$292, DW_AT_name("RCVRPD")
    5880                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_RCVRPD")
    5881                      .dwattr $C$DW$292, DW_AT_bit_offset(0x01)
    5882                      .dwattr $C$DW$292, DW_AT_bit_size(0x01)
    5883                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5884                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    5885              
    5886              $C$DW$293       .dwtag  DW_TAG_member
    5887                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$19)
    5888                      .dwattr $C$DW$293, DW_AT_name("RESERVED")
    5889                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_RESERVED")
    5890                      .dwattr $C$DW$293, DW_AT_bit_offset(0x00)
    5891                      .dwattr $C$DW$293, DW_AT_bit_size(0x01)
    5892                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5893                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    5894              
    5895                      .dwendtag $C$DW$T$20
    5896              
    5897              
    5898              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    5899                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    5900              $C$DW$294       .dwtag  DW_TAG_member
    5901                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$19)
    5902                      .dwattr $C$DW$294, DW_AT_name("VCODE")
    5903                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_VCODE")
    5904                      .dwattr $C$DW$294, DW_AT_bit_offset(0x0c)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/main_nonBIOS.asm PAGE  117

    5905                      .dwattr $C$DW$294, DW_AT_bit_size(0x04)
    5906                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5907                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    5908              
    5909              $C$DW$295       .dwtag  DW_TAG_member
    5910                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$19)
    5911                      .dwattr $C$DW$295, DW_AT_name("KLYITRIG_MON")
    5912                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_KLYITRIG_MON")
    5913                      .dwattr $C$DW$295, DW_AT_bit_offset(0x0b)
    5914                      .dwattr $C$DW$295, DW_AT_bit_size(0x01)
    5915                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5916                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    5917              
    5918              $C$DW$296       .dwtag  DW_TAG_member
    5919                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$19)
    5920                      .dwattr $C$DW$296, DW_AT_name("ILOIL_MON")
    5921                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_ILOIL_MON")
    5922                      .dwattr $C$DW$296, DW_AT_bit_offset(0x0a)
    5923                      .dwattr $C$DW$296, DW_AT_bit_size(0x01)
    5924                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5925                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    5926              
    5927              $C$DW$297       .dwtag  DW_TAG_member
    5928                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$19)
    5929                      .dwattr $C$DW$297, DW_AT_name("ILMOD_MON")
    5930                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_ILMOD_MON")
    5931                      .dwattr $C$DW$297, DW_AT_bit_offset(0x09)
    5932                      .dwattr $C$DW$297, DW_AT_bit_size(0x01)
    5933                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5934                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    5935              
    5936              $C$DW$298       .dwtag  DW_TAG_member
    5937                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$19)
    5938                      .dwattr $C$DW$298, DW_AT_name("ILKFIL_MON")
    5939                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_ILKFIL_MON")
    5940                      .dwattr $C$DW$298, DW_AT_bit_offset(0x08)
    5941                      .dwattr $C$DW$298, DW_AT_bit_size(0x01)
    5942                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5943                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    5944              
    5945              $C$DW$299       .dwtag  DW_TAG_member
    5946                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$19)
    5947                      .dwattr $C$DW$299, DW_AT_name("ILHVOC_MON")
    5948                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_ILHVOC_MON")
    5949                      .dwattr $C$DW$299, DW_AT_bit_offset(0x07)
    5950                      .dwattr $C$DW$299, DW_AT_bit_size(0x01)
    5951                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5952                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    5953              
    5954              $C$DW$300       .dwtag  DW_TAG_member
    5955                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$19)
    5956                      .dwattr $C$DW$300, DW_AT_name("ILHVCB_MON")
    5957                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_ILHVCB_MON")
    5958                      .dwattr $C$DW$300, DW_AT_bit_offset(0x06)
    5959                      .dwattr $C$DW$300, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/main_nonBIOS.asm PAGE  118

    5960                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5961                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    5962              
    5963              $C$DW$301       .dwtag  DW_TAG_member
    5964                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$19)
    5965                      .dwattr $C$DW$301, DW_AT_name("BEAMEN_MON")
    5966                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_BEAMEN_MON")
    5967                      .dwattr $C$DW$301, DW_AT_bit_offset(0x05)
    5968                      .dwattr $C$DW$301, DW_AT_bit_size(0x01)
    5969                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5970                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    5971              
    5972              $C$DW$302       .dwtag  DW_TAG_member
    5973                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$19)
    5974                      .dwattr $C$DW$302, DW_AT_name("CB24VPG")
    5975                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_CB24VPG")
    5976                      .dwattr $C$DW$302, DW_AT_bit_offset(0x04)
    5977                      .dwattr $C$DW$302, DW_AT_bit_size(0x01)
    5978                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5979                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    5980              
    5981              $C$DW$303       .dwtag  DW_TAG_member
    5982                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$19)
    5983                      .dwattr $C$DW$303, DW_AT_name("MODTRIG_MON")
    5984                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_MODTRIG_MON")
    5985                      .dwattr $C$DW$303, DW_AT_bit_offset(0x03)
    5986                      .dwattr $C$DW$303, DW_AT_bit_size(0x01)
    5987                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5988                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    5989              
    5990              $C$DW$304       .dwtag  DW_TAG_member
    5991                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$19)
    5992                      .dwattr $C$DW$304, DW_AT_name("MOD24VPG")
    5993                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_MOD24VPG")
    5994                      .dwattr $C$DW$304, DW_AT_bit_offset(0x02)
    5995                      .dwattr $C$DW$304, DW_AT_bit_size(0x01)
    5996                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5997                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    5998              
    5999              $C$DW$305       .dwtag  DW_TAG_member
    6000                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$19)
    6001                      .dwattr $C$DW$305, DW_AT_name("MODE_FLT")
    6002                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_MODE_FLT")
    6003                      .dwattr $C$DW$305, DW_AT_bit_offset(0x01)
    6004                      .dwattr $C$DW$305, DW_AT_bit_size(0x01)
    6005                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6006                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    6007              
    6008              $C$DW$306       .dwtag  DW_TAG_member
    6009                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$19)
    6010                      .dwattr $C$DW$306, DW_AT_name("KHV_ST")
    6011                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_KHV_ST")
    6012                      .dwattr $C$DW$306, DW_AT_bit_offset(0x00)
    6013                      .dwattr $C$DW$306, DW_AT_bit_size(0x01)
    6014                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/main_nonBIOS.asm PAGE  119

    6015                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    6016              
    6017                      .dwendtag $C$DW$T$21
    6018              
    6019              
    6020              $C$DW$T$23      .dwtag  DW_TAG_union_type
    6021                      .dwattr $C$DW$T$23, DW_AT_name("CANMSG")
    6022                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
    6023              $C$DW$307       .dwtag  DW_TAG_member
    6024                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$22)
    6025                      .dwattr $C$DW$307, DW_AT_name("bData")
    6026                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_bData")
    6027                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6028                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    6029              
    6030              $C$DW$308       .dwtag  DW_TAG_member
    6031                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$97)
    6032                      .dwattr $C$DW$308, DW_AT_name("sMsgStruct")
    6033                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_sMsgStruct")
    6034                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6035                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    6036              
    6037                      .dwendtag $C$DW$T$23
    6038              
    6039              $C$DW$T$98      .dwtag  DW_TAG_typedef
    6040                      .dwattr $C$DW$T$98, DW_AT_name("SMessage")
    6041                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$23)
    6042                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    6043              
    6044              $C$DW$T$99      .dwtag  DW_TAG_pointer_type
    6045                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
    6046                      .dwattr $C$DW$T$99, DW_AT_address_class(0x20)
    6047              
    6048              
    6049              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    6050                      .dwattr $C$DW$T$24, DW_AT_name("CPUTIMER_REGS")
    6051                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
    6052              $C$DW$309       .dwtag  DW_TAG_member
    6053                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$91)
    6054                      .dwattr $C$DW$309, DW_AT_name("TIM")
    6055                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_TIM")
    6056                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6057                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    6058              
    6059              $C$DW$310       .dwtag  DW_TAG_member
    6060                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$87)
    6061                      .dwattr $C$DW$310, DW_AT_name("PRD")
    6062                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_PRD")
    6063                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6064                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    6065              
    6066              $C$DW$311       .dwtag  DW_TAG_member
    6067                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$90)
    6068                      .dwattr $C$DW$311, DW_AT_name("TCR")
    6069                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_TCR")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/main_nonBIOS.asm PAGE  120

    6070                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6071                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    6072              
    6073              $C$DW$312       .dwtag  DW_TAG_member
    6074                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$19)
    6075                      .dwattr $C$DW$312, DW_AT_name("rsvd1")
    6076                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_rsvd1")
    6077                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6078                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    6079              
    6080              $C$DW$313       .dwtag  DW_TAG_member
    6081                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$96)
    6082                      .dwattr $C$DW$313, DW_AT_name("TPR")
    6083                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_TPR")
    6084                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6085                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    6086              
    6087              $C$DW$314       .dwtag  DW_TAG_member
    6088                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$94)
    6089                      .dwattr $C$DW$314, DW_AT_name("TPRH")
    6090                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_TPRH")
    6091                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6092                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    6093              
    6094                      .dwendtag $C$DW$T$24
    6095              
    6096              $C$DW$315       .dwtag  DW_TAG_TI_far_type
    6097                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$24)
    6098              
    6099              $C$DW$T$100     .dwtag  DW_TAG_volatile_type
    6100                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$315)
    6101              
    6102              
    6103              $C$DW$T$25      .dwtag  DW_TAG_union_type
    6104                      .dwattr $C$DW$T$25, DW_AT_name("DspGpInput")
    6105                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    6106              $C$DW$316       .dwtag  DW_TAG_member
    6107                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$19)
    6108                      .dwattr $C$DW$316, DW_AT_name("Word")
    6109                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_Word")
    6110                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6111                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    6112              
    6113              $C$DW$317       .dwtag  DW_TAG_member
    6114                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$21)
    6115                      .dwattr $C$DW$317, DW_AT_name("Bit")
    6116                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_Bit")
    6117                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6118                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    6119              
    6120                      .dwendtag $C$DW$T$25
    6121              
    6122              
    6123              $C$DW$T$26      .dwtag  DW_TAG_union_type
    6124                      .dwattr $C$DW$T$26, DW_AT_name("DspGpOutput")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/main_nonBIOS.asm PAGE  121

    6125                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    6126              $C$DW$318       .dwtag  DW_TAG_member
    6127                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$19)
    6128                      .dwattr $C$DW$318, DW_AT_name("Word")
    6129                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_Word")
    6130                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6131                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    6132              
    6133              $C$DW$319       .dwtag  DW_TAG_member
    6134                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$20)
    6135                      .dwattr $C$DW$319, DW_AT_name("Bit")
    6136                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_Bit")
    6137                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6138                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    6139              
    6140                      .dwendtag $C$DW$T$26
    6141              
    6142              
    6143              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    6144                      .dwattr $C$DW$T$27, DW_AT_name("GPACLEAR_BITS")
    6145                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    6146              $C$DW$320       .dwtag  DW_TAG_member
    6147                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$19)
    6148                      .dwattr $C$DW$320, DW_AT_name("GPIOA0")
    6149                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_GPIOA0")
    6150                      .dwattr $C$DW$320, DW_AT_bit_offset(0x0f)
    6151                      .dwattr $C$DW$320, DW_AT_bit_size(0x01)
    6152                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6153                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    6154              
    6155              $C$DW$321       .dwtag  DW_TAG_member
    6156                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$19)
    6157                      .dwattr $C$DW$321, DW_AT_name("GPIOA1")
    6158                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_GPIOA1")
    6159                      .dwattr $C$DW$321, DW_AT_bit_offset(0x0e)
    6160                      .dwattr $C$DW$321, DW_AT_bit_size(0x01)
    6161                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6162                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    6163              
    6164              $C$DW$322       .dwtag  DW_TAG_member
    6165                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$19)
    6166                      .dwattr $C$DW$322, DW_AT_name("GPIOA2")
    6167                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_GPIOA2")
    6168                      .dwattr $C$DW$322, DW_AT_bit_offset(0x0d)
    6169                      .dwattr $C$DW$322, DW_AT_bit_size(0x01)
    6170                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6171                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    6172              
    6173              $C$DW$323       .dwtag  DW_TAG_member
    6174                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$19)
    6175                      .dwattr $C$DW$323, DW_AT_name("GPIOA3")
    6176                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_GPIOA3")
    6177                      .dwattr $C$DW$323, DW_AT_bit_offset(0x0c)
    6178                      .dwattr $C$DW$323, DW_AT_bit_size(0x01)
    6179                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/main_nonBIOS.asm PAGE  122

    6180                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    6181              
    6182              $C$DW$324       .dwtag  DW_TAG_member
    6183                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$19)
    6184                      .dwattr $C$DW$324, DW_AT_name("GPIOA4")
    6185                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_GPIOA4")
    6186                      .dwattr $C$DW$324, DW_AT_bit_offset(0x0b)
    6187                      .dwattr $C$DW$324, DW_AT_bit_size(0x01)
    6188                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6189                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    6190              
    6191              $C$DW$325       .dwtag  DW_TAG_member
    6192                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$19)
    6193                      .dwattr $C$DW$325, DW_AT_name("GPIOA5")
    6194                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_GPIOA5")
    6195                      .dwattr $C$DW$325, DW_AT_bit_offset(0x0a)
    6196                      .dwattr $C$DW$325, DW_AT_bit_size(0x01)
    6197                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6198                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    6199              
    6200              $C$DW$326       .dwtag  DW_TAG_member
    6201                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$19)
    6202                      .dwattr $C$DW$326, DW_AT_name("GPIOA6")
    6203                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_GPIOA6")
    6204                      .dwattr $C$DW$326, DW_AT_bit_offset(0x09)
    6205                      .dwattr $C$DW$326, DW_AT_bit_size(0x01)
    6206                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6207                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    6208              
    6209              $C$DW$327       .dwtag  DW_TAG_member
    6210                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$19)
    6211                      .dwattr $C$DW$327, DW_AT_name("GPIOA7")
    6212                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_GPIOA7")
    6213                      .dwattr $C$DW$327, DW_AT_bit_offset(0x08)
    6214                      .dwattr $C$DW$327, DW_AT_bit_size(0x01)
    6215                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6216                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    6217              
    6218              $C$DW$328       .dwtag  DW_TAG_member
    6219                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$19)
    6220                      .dwattr $C$DW$328, DW_AT_name("GPIOA8")
    6221                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_GPIOA8")
    6222                      .dwattr $C$DW$328, DW_AT_bit_offset(0x07)
    6223                      .dwattr $C$DW$328, DW_AT_bit_size(0x01)
    6224                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6225                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    6226              
    6227              $C$DW$329       .dwtag  DW_TAG_member
    6228                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$19)
    6229                      .dwattr $C$DW$329, DW_AT_name("GPIOA9")
    6230                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_GPIOA9")
    6231                      .dwattr $C$DW$329, DW_AT_bit_offset(0x06)
    6232                      .dwattr $C$DW$329, DW_AT_bit_size(0x01)
    6233                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6234                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/main_nonBIOS.asm PAGE  123

    6235              
    6236              $C$DW$330       .dwtag  DW_TAG_member
    6237                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$19)
    6238                      .dwattr $C$DW$330, DW_AT_name("GPIOA10")
    6239                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_GPIOA10")
    6240                      .dwattr $C$DW$330, DW_AT_bit_offset(0x05)
    6241                      .dwattr $C$DW$330, DW_AT_bit_size(0x01)
    6242                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6243                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    6244              
    6245              $C$DW$331       .dwtag  DW_TAG_member
    6246                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$19)
    6247                      .dwattr $C$DW$331, DW_AT_name("GPIOA11")
    6248                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_GPIOA11")
    6249                      .dwattr $C$DW$331, DW_AT_bit_offset(0x04)
    6250                      .dwattr $C$DW$331, DW_AT_bit_size(0x01)
    6251                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6252                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    6253              
    6254              $C$DW$332       .dwtag  DW_TAG_member
    6255                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$19)
    6256                      .dwattr $C$DW$332, DW_AT_name("GPIOA12")
    6257                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_GPIOA12")
    6258                      .dwattr $C$DW$332, DW_AT_bit_offset(0x03)
    6259                      .dwattr $C$DW$332, DW_AT_bit_size(0x01)
    6260                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6261                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    6262              
    6263              $C$DW$333       .dwtag  DW_TAG_member
    6264                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$19)
    6265                      .dwattr $C$DW$333, DW_AT_name("GPIOA13")
    6266                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_GPIOA13")
    6267                      .dwattr $C$DW$333, DW_AT_bit_offset(0x02)
    6268                      .dwattr $C$DW$333, DW_AT_bit_size(0x01)
    6269                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6270                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    6271              
    6272              $C$DW$334       .dwtag  DW_TAG_member
    6273                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$19)
    6274                      .dwattr $C$DW$334, DW_AT_name("GPIOA14")
    6275                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_GPIOA14")
    6276                      .dwattr $C$DW$334, DW_AT_bit_offset(0x01)
    6277                      .dwattr $C$DW$334, DW_AT_bit_size(0x01)
    6278                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6279                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    6280              
    6281              $C$DW$335       .dwtag  DW_TAG_member
    6282                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$19)
    6283                      .dwattr $C$DW$335, DW_AT_name("GPIOA15")
    6284                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_GPIOA15")
    6285                      .dwattr $C$DW$335, DW_AT_bit_offset(0x00)
    6286                      .dwattr $C$DW$335, DW_AT_bit_size(0x01)
    6287                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6288                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    6289              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/main_nonBIOS.asm PAGE  124

    6290                      .dwendtag $C$DW$T$27
    6291              
    6292              
    6293              $C$DW$T$28      .dwtag  DW_TAG_union_type
    6294                      .dwattr $C$DW$T$28, DW_AT_name("GPACLEAR_REG")
    6295                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    6296              $C$DW$336       .dwtag  DW_TAG_member
    6297                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$19)
    6298                      .dwattr $C$DW$336, DW_AT_name("all")
    6299                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_all")
    6300                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6301                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    6302              
    6303              $C$DW$337       .dwtag  DW_TAG_member
    6304                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$27)
    6305                      .dwattr $C$DW$337, DW_AT_name("bit")
    6306                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_bit")
    6307                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6308                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    6309              
    6310                      .dwendtag $C$DW$T$28
    6311              
    6312              
    6313              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    6314                      .dwattr $C$DW$T$29, DW_AT_name("GPADAT_BITS")
    6315                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    6316              $C$DW$338       .dwtag  DW_TAG_member
    6317                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$19)
    6318                      .dwattr $C$DW$338, DW_AT_name("GPIOA0")
    6319                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_GPIOA0")
    6320                      .dwattr $C$DW$338, DW_AT_bit_offset(0x0f)
    6321                      .dwattr $C$DW$338, DW_AT_bit_size(0x01)
    6322                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6323                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    6324              
    6325              $C$DW$339       .dwtag  DW_TAG_member
    6326                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$19)
    6327                      .dwattr $C$DW$339, DW_AT_name("GPIOA1")
    6328                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_GPIOA1")
    6329                      .dwattr $C$DW$339, DW_AT_bit_offset(0x0e)
    6330                      .dwattr $C$DW$339, DW_AT_bit_size(0x01)
    6331                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6332                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    6333              
    6334              $C$DW$340       .dwtag  DW_TAG_member
    6335                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$19)
    6336                      .dwattr $C$DW$340, DW_AT_name("GPIOA2")
    6337                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_GPIOA2")
    6338                      .dwattr $C$DW$340, DW_AT_bit_offset(0x0d)
    6339                      .dwattr $C$DW$340, DW_AT_bit_size(0x01)
    6340                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6341                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    6342              
    6343              $C$DW$341       .dwtag  DW_TAG_member
    6344                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/main_nonBIOS.asm PAGE  125

    6345                      .dwattr $C$DW$341, DW_AT_name("GPIOA3")
    6346                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_GPIOA3")
    6347                      .dwattr $C$DW$341, DW_AT_bit_offset(0x0c)
    6348                      .dwattr $C$DW$341, DW_AT_bit_size(0x01)
    6349                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6350                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    6351              
    6352              $C$DW$342       .dwtag  DW_TAG_member
    6353                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$19)
    6354                      .dwattr $C$DW$342, DW_AT_name("GPIOA4")
    6355                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_GPIOA4")
    6356                      .dwattr $C$DW$342, DW_AT_bit_offset(0x0b)
    6357                      .dwattr $C$DW$342, DW_AT_bit_size(0x01)
    6358                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6359                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    6360              
    6361              $C$DW$343       .dwtag  DW_TAG_member
    6362                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$19)
    6363                      .dwattr $C$DW$343, DW_AT_name("GPIOA5")
    6364                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_GPIOA5")
    6365                      .dwattr $C$DW$343, DW_AT_bit_offset(0x0a)
    6366                      .dwattr $C$DW$343, DW_AT_bit_size(0x01)
    6367                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6368                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    6369              
    6370              $C$DW$344       .dwtag  DW_TAG_member
    6371                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$19)
    6372                      .dwattr $C$DW$344, DW_AT_name("GPIOA6")
    6373                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_GPIOA6")
    6374                      .dwattr $C$DW$344, DW_AT_bit_offset(0x09)
    6375                      .dwattr $C$DW$344, DW_AT_bit_size(0x01)
    6376                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6377                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    6378              
    6379              $C$DW$345       .dwtag  DW_TAG_member
    6380                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$19)
    6381                      .dwattr $C$DW$345, DW_AT_name("GPIOA7")
    6382                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_GPIOA7")
    6383                      .dwattr $C$DW$345, DW_AT_bit_offset(0x08)
    6384                      .dwattr $C$DW$345, DW_AT_bit_size(0x01)
    6385                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6386                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    6387              
    6388              $C$DW$346       .dwtag  DW_TAG_member
    6389                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$19)
    6390                      .dwattr $C$DW$346, DW_AT_name("GPIOA8")
    6391                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_GPIOA8")
    6392                      .dwattr $C$DW$346, DW_AT_bit_offset(0x07)
    6393                      .dwattr $C$DW$346, DW_AT_bit_size(0x01)
    6394                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6395                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    6396              
    6397              $C$DW$347       .dwtag  DW_TAG_member
    6398                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$19)
    6399                      .dwattr $C$DW$347, DW_AT_name("GPIOA9")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/main_nonBIOS.asm PAGE  126

    6400                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_GPIOA9")
    6401                      .dwattr $C$DW$347, DW_AT_bit_offset(0x06)
    6402                      .dwattr $C$DW$347, DW_AT_bit_size(0x01)
    6403                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6404                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    6405              
    6406              $C$DW$348       .dwtag  DW_TAG_member
    6407                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$19)
    6408                      .dwattr $C$DW$348, DW_AT_name("GPIOA10")
    6409                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_GPIOA10")
    6410                      .dwattr $C$DW$348, DW_AT_bit_offset(0x05)
    6411                      .dwattr $C$DW$348, DW_AT_bit_size(0x01)
    6412                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6413                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    6414              
    6415              $C$DW$349       .dwtag  DW_TAG_member
    6416                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$19)
    6417                      .dwattr $C$DW$349, DW_AT_name("GPIOA11")
    6418                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_GPIOA11")
    6419                      .dwattr $C$DW$349, DW_AT_bit_offset(0x04)
    6420                      .dwattr $C$DW$349, DW_AT_bit_size(0x01)
    6421                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6422                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    6423              
    6424              $C$DW$350       .dwtag  DW_TAG_member
    6425                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$19)
    6426                      .dwattr $C$DW$350, DW_AT_name("GPIOA12")
    6427                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_GPIOA12")
    6428                      .dwattr $C$DW$350, DW_AT_bit_offset(0x03)
    6429                      .dwattr $C$DW$350, DW_AT_bit_size(0x01)
    6430                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6431                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    6432              
    6433              $C$DW$351       .dwtag  DW_TAG_member
    6434                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$19)
    6435                      .dwattr $C$DW$351, DW_AT_name("GPIOA13")
    6436                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_GPIOA13")
    6437                      .dwattr $C$DW$351, DW_AT_bit_offset(0x02)
    6438                      .dwattr $C$DW$351, DW_AT_bit_size(0x01)
    6439                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6440                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    6441              
    6442              $C$DW$352       .dwtag  DW_TAG_member
    6443                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$19)
    6444                      .dwattr $C$DW$352, DW_AT_name("GPIOA14")
    6445                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_GPIOA14")
    6446                      .dwattr $C$DW$352, DW_AT_bit_offset(0x01)
    6447                      .dwattr $C$DW$352, DW_AT_bit_size(0x01)
    6448                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6449                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    6450              
    6451              $C$DW$353       .dwtag  DW_TAG_member
    6452                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$19)
    6453                      .dwattr $C$DW$353, DW_AT_name("GPIOA15")
    6454                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_GPIOA15")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/main_nonBIOS.asm PAGE  127

    6455                      .dwattr $C$DW$353, DW_AT_bit_offset(0x00)
    6456                      .dwattr $C$DW$353, DW_AT_bit_size(0x01)
    6457                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6458                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    6459              
    6460                      .dwendtag $C$DW$T$29
    6461              
    6462              
    6463              $C$DW$T$30      .dwtag  DW_TAG_union_type
    6464                      .dwattr $C$DW$T$30, DW_AT_name("GPADAT_REG")
    6465                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    6466              $C$DW$354       .dwtag  DW_TAG_member
    6467                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$19)
    6468                      .dwattr $C$DW$354, DW_AT_name("all")
    6469                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_all")
    6470                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6471                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    6472              
    6473              $C$DW$355       .dwtag  DW_TAG_member
    6474                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$29)
    6475                      .dwattr $C$DW$355, DW_AT_name("bit")
    6476                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_bit")
    6477                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6478                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    6479              
    6480                      .dwendtag $C$DW$T$30
    6481              
    6482              
    6483              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    6484                      .dwattr $C$DW$T$31, DW_AT_name("GPASET_BITS")
    6485                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    6486              $C$DW$356       .dwtag  DW_TAG_member
    6487                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$19)
    6488                      .dwattr $C$DW$356, DW_AT_name("GPIOA0")
    6489                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_GPIOA0")
    6490                      .dwattr $C$DW$356, DW_AT_bit_offset(0x0f)
    6491                      .dwattr $C$DW$356, DW_AT_bit_size(0x01)
    6492                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6493                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    6494              
    6495              $C$DW$357       .dwtag  DW_TAG_member
    6496                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$19)
    6497                      .dwattr $C$DW$357, DW_AT_name("GPIOA1")
    6498                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_GPIOA1")
    6499                      .dwattr $C$DW$357, DW_AT_bit_offset(0x0e)
    6500                      .dwattr $C$DW$357, DW_AT_bit_size(0x01)
    6501                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6502                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    6503              
    6504              $C$DW$358       .dwtag  DW_TAG_member
    6505                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$19)
    6506                      .dwattr $C$DW$358, DW_AT_name("GPIOA2")
    6507                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_GPIOA2")
    6508                      .dwattr $C$DW$358, DW_AT_bit_offset(0x0d)
    6509                      .dwattr $C$DW$358, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/main_nonBIOS.asm PAGE  128

    6510                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6511                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    6512              
    6513              $C$DW$359       .dwtag  DW_TAG_member
    6514                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$19)
    6515                      .dwattr $C$DW$359, DW_AT_name("GPIOA3")
    6516                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_GPIOA3")
    6517                      .dwattr $C$DW$359, DW_AT_bit_offset(0x0c)
    6518                      .dwattr $C$DW$359, DW_AT_bit_size(0x01)
    6519                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6520                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    6521              
    6522              $C$DW$360       .dwtag  DW_TAG_member
    6523                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$19)
    6524                      .dwattr $C$DW$360, DW_AT_name("GPIOA4")
    6525                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_GPIOA4")
    6526                      .dwattr $C$DW$360, DW_AT_bit_offset(0x0b)
    6527                      .dwattr $C$DW$360, DW_AT_bit_size(0x01)
    6528                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6529                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    6530              
    6531              $C$DW$361       .dwtag  DW_TAG_member
    6532                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$19)
    6533                      .dwattr $C$DW$361, DW_AT_name("GPIOA5")
    6534                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_GPIOA5")
    6535                      .dwattr $C$DW$361, DW_AT_bit_offset(0x0a)
    6536                      .dwattr $C$DW$361, DW_AT_bit_size(0x01)
    6537                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6538                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    6539              
    6540              $C$DW$362       .dwtag  DW_TAG_member
    6541                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$19)
    6542                      .dwattr $C$DW$362, DW_AT_name("GPIOA6")
    6543                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_GPIOA6")
    6544                      .dwattr $C$DW$362, DW_AT_bit_offset(0x09)
    6545                      .dwattr $C$DW$362, DW_AT_bit_size(0x01)
    6546                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6547                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    6548              
    6549              $C$DW$363       .dwtag  DW_TAG_member
    6550                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$19)
    6551                      .dwattr $C$DW$363, DW_AT_name("GPIOA7")
    6552                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_GPIOA7")
    6553                      .dwattr $C$DW$363, DW_AT_bit_offset(0x08)
    6554                      .dwattr $C$DW$363, DW_AT_bit_size(0x01)
    6555                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6556                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    6557              
    6558              $C$DW$364       .dwtag  DW_TAG_member
    6559                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$19)
    6560                      .dwattr $C$DW$364, DW_AT_name("GPIOA8")
    6561                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_GPIOA8")
    6562                      .dwattr $C$DW$364, DW_AT_bit_offset(0x07)
    6563                      .dwattr $C$DW$364, DW_AT_bit_size(0x01)
    6564                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/main_nonBIOS.asm PAGE  129

    6565                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    6566              
    6567              $C$DW$365       .dwtag  DW_TAG_member
    6568                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$19)
    6569                      .dwattr $C$DW$365, DW_AT_name("GPIOA9")
    6570                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_GPIOA9")
    6571                      .dwattr $C$DW$365, DW_AT_bit_offset(0x06)
    6572                      .dwattr $C$DW$365, DW_AT_bit_size(0x01)
    6573                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6574                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    6575              
    6576              $C$DW$366       .dwtag  DW_TAG_member
    6577                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$19)
    6578                      .dwattr $C$DW$366, DW_AT_name("GPIOA10")
    6579                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_GPIOA10")
    6580                      .dwattr $C$DW$366, DW_AT_bit_offset(0x05)
    6581                      .dwattr $C$DW$366, DW_AT_bit_size(0x01)
    6582                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6583                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    6584              
    6585              $C$DW$367       .dwtag  DW_TAG_member
    6586                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$19)
    6587                      .dwattr $C$DW$367, DW_AT_name("GPIOA11")
    6588                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_GPIOA11")
    6589                      .dwattr $C$DW$367, DW_AT_bit_offset(0x04)
    6590                      .dwattr $C$DW$367, DW_AT_bit_size(0x01)
    6591                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6592                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    6593              
    6594              $C$DW$368       .dwtag  DW_TAG_member
    6595                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$19)
    6596                      .dwattr $C$DW$368, DW_AT_name("GPIOA12")
    6597                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_GPIOA12")
    6598                      .dwattr $C$DW$368, DW_AT_bit_offset(0x03)
    6599                      .dwattr $C$DW$368, DW_AT_bit_size(0x01)
    6600                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6601                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    6602              
    6603              $C$DW$369       .dwtag  DW_TAG_member
    6604                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$19)
    6605                      .dwattr $C$DW$369, DW_AT_name("GPIOA13")
    6606                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_GPIOA13")
    6607                      .dwattr $C$DW$369, DW_AT_bit_offset(0x02)
    6608                      .dwattr $C$DW$369, DW_AT_bit_size(0x01)
    6609                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6610                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    6611              
    6612              $C$DW$370       .dwtag  DW_TAG_member
    6613                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$19)
    6614                      .dwattr $C$DW$370, DW_AT_name("GPIOA14")
    6615                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_GPIOA14")
    6616                      .dwattr $C$DW$370, DW_AT_bit_offset(0x01)
    6617                      .dwattr $C$DW$370, DW_AT_bit_size(0x01)
    6618                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6619                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/main_nonBIOS.asm PAGE  130

    6620              
    6621              $C$DW$371       .dwtag  DW_TAG_member
    6622                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$19)
    6623                      .dwattr $C$DW$371, DW_AT_name("GPIOA15")
    6624                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_GPIOA15")
    6625                      .dwattr $C$DW$371, DW_AT_bit_offset(0x00)
    6626                      .dwattr $C$DW$371, DW_AT_bit_size(0x01)
    6627                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6628                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    6629              
    6630                      .dwendtag $C$DW$T$31
    6631              
    6632              
    6633              $C$DW$T$32      .dwtag  DW_TAG_union_type
    6634                      .dwattr $C$DW$T$32, DW_AT_name("GPASET_REG")
    6635                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    6636              $C$DW$372       .dwtag  DW_TAG_member
    6637                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$19)
    6638                      .dwattr $C$DW$372, DW_AT_name("all")
    6639                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_all")
    6640                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6641                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    6642              
    6643              $C$DW$373       .dwtag  DW_TAG_member
    6644                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$31)
    6645                      .dwattr $C$DW$373, DW_AT_name("bit")
    6646                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_bit")
    6647                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6648                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    6649              
    6650                      .dwendtag $C$DW$T$32
    6651              
    6652              
    6653              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    6654                      .dwattr $C$DW$T$33, DW_AT_name("GPATOGGLE_BITS")
    6655                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    6656              $C$DW$374       .dwtag  DW_TAG_member
    6657                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$19)
    6658                      .dwattr $C$DW$374, DW_AT_name("GPIOA0")
    6659                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_GPIOA0")
    6660                      .dwattr $C$DW$374, DW_AT_bit_offset(0x0f)
    6661                      .dwattr $C$DW$374, DW_AT_bit_size(0x01)
    6662                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6663                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    6664              
    6665              $C$DW$375       .dwtag  DW_TAG_member
    6666                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$19)
    6667                      .dwattr $C$DW$375, DW_AT_name("GPIOA1")
    6668                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_GPIOA1")
    6669                      .dwattr $C$DW$375, DW_AT_bit_offset(0x0e)
    6670                      .dwattr $C$DW$375, DW_AT_bit_size(0x01)
    6671                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6672                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    6673              
    6674              $C$DW$376       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/main_nonBIOS.asm PAGE  131

    6675                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$19)
    6676                      .dwattr $C$DW$376, DW_AT_name("GPIOA2")
    6677                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_GPIOA2")
    6678                      .dwattr $C$DW$376, DW_AT_bit_offset(0x0d)
    6679                      .dwattr $C$DW$376, DW_AT_bit_size(0x01)
    6680                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6681                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    6682              
    6683              $C$DW$377       .dwtag  DW_TAG_member
    6684                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$19)
    6685                      .dwattr $C$DW$377, DW_AT_name("GPIOA3")
    6686                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_GPIOA3")
    6687                      .dwattr $C$DW$377, DW_AT_bit_offset(0x0c)
    6688                      .dwattr $C$DW$377, DW_AT_bit_size(0x01)
    6689                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6690                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    6691              
    6692              $C$DW$378       .dwtag  DW_TAG_member
    6693                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$19)
    6694                      .dwattr $C$DW$378, DW_AT_name("GPIOA4")
    6695                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_GPIOA4")
    6696                      .dwattr $C$DW$378, DW_AT_bit_offset(0x0b)
    6697                      .dwattr $C$DW$378, DW_AT_bit_size(0x01)
    6698                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6699                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    6700              
    6701              $C$DW$379       .dwtag  DW_TAG_member
    6702                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$19)
    6703                      .dwattr $C$DW$379, DW_AT_name("GPIOA5")
    6704                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_GPIOA5")
    6705                      .dwattr $C$DW$379, DW_AT_bit_offset(0x0a)
    6706                      .dwattr $C$DW$379, DW_AT_bit_size(0x01)
    6707                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6708                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    6709              
    6710              $C$DW$380       .dwtag  DW_TAG_member
    6711                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$19)
    6712                      .dwattr $C$DW$380, DW_AT_name("GPIOA6")
    6713                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_GPIOA6")
    6714                      .dwattr $C$DW$380, DW_AT_bit_offset(0x09)
    6715                      .dwattr $C$DW$380, DW_AT_bit_size(0x01)
    6716                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6717                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    6718              
    6719              $C$DW$381       .dwtag  DW_TAG_member
    6720                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$19)
    6721                      .dwattr $C$DW$381, DW_AT_name("GPIOA7")
    6722                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_GPIOA7")
    6723                      .dwattr $C$DW$381, DW_AT_bit_offset(0x08)
    6724                      .dwattr $C$DW$381, DW_AT_bit_size(0x01)
    6725                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6726                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    6727              
    6728              $C$DW$382       .dwtag  DW_TAG_member
    6729                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/main_nonBIOS.asm PAGE  132

    6730                      .dwattr $C$DW$382, DW_AT_name("GPIOA8")
    6731                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_GPIOA8")
    6732                      .dwattr $C$DW$382, DW_AT_bit_offset(0x07)
    6733                      .dwattr $C$DW$382, DW_AT_bit_size(0x01)
    6734                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6735                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    6736              
    6737              $C$DW$383       .dwtag  DW_TAG_member
    6738                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$19)
    6739                      .dwattr $C$DW$383, DW_AT_name("GPIOA9")
    6740                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_GPIOA9")
    6741                      .dwattr $C$DW$383, DW_AT_bit_offset(0x06)
    6742                      .dwattr $C$DW$383, DW_AT_bit_size(0x01)
    6743                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6744                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    6745              
    6746              $C$DW$384       .dwtag  DW_TAG_member
    6747                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$19)
    6748                      .dwattr $C$DW$384, DW_AT_name("GPIOA10")
    6749                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_GPIOA10")
    6750                      .dwattr $C$DW$384, DW_AT_bit_offset(0x05)
    6751                      .dwattr $C$DW$384, DW_AT_bit_size(0x01)
    6752                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6753                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    6754              
    6755              $C$DW$385       .dwtag  DW_TAG_member
    6756                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$19)
    6757                      .dwattr $C$DW$385, DW_AT_name("GPIOA11")
    6758                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_GPIOA11")
    6759                      .dwattr $C$DW$385, DW_AT_bit_offset(0x04)
    6760                      .dwattr $C$DW$385, DW_AT_bit_size(0x01)
    6761                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6762                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    6763              
    6764              $C$DW$386       .dwtag  DW_TAG_member
    6765                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$19)
    6766                      .dwattr $C$DW$386, DW_AT_name("GPIOA12")
    6767                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_GPIOA12")
    6768                      .dwattr $C$DW$386, DW_AT_bit_offset(0x03)
    6769                      .dwattr $C$DW$386, DW_AT_bit_size(0x01)
    6770                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6771                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    6772              
    6773              $C$DW$387       .dwtag  DW_TAG_member
    6774                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$19)
    6775                      .dwattr $C$DW$387, DW_AT_name("GPIOA13")
    6776                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_GPIOA13")
    6777                      .dwattr $C$DW$387, DW_AT_bit_offset(0x02)
    6778                      .dwattr $C$DW$387, DW_AT_bit_size(0x01)
    6779                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6780                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    6781              
    6782              $C$DW$388       .dwtag  DW_TAG_member
    6783                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$19)
    6784                      .dwattr $C$DW$388, DW_AT_name("GPIOA14")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/main_nonBIOS.asm PAGE  133

    6785                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_GPIOA14")
    6786                      .dwattr $C$DW$388, DW_AT_bit_offset(0x01)
    6787                      .dwattr $C$DW$388, DW_AT_bit_size(0x01)
    6788                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6789                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    6790              
    6791              $C$DW$389       .dwtag  DW_TAG_member
    6792                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$19)
    6793                      .dwattr $C$DW$389, DW_AT_name("GPIOA15")
    6794                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_GPIOA15")
    6795                      .dwattr $C$DW$389, DW_AT_bit_offset(0x00)
    6796                      .dwattr $C$DW$389, DW_AT_bit_size(0x01)
    6797                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6798                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    6799              
    6800                      .dwendtag $C$DW$T$33
    6801              
    6802              
    6803              $C$DW$T$34      .dwtag  DW_TAG_union_type
    6804                      .dwattr $C$DW$T$34, DW_AT_name("GPATOGGLE_REG")
    6805                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    6806              $C$DW$390       .dwtag  DW_TAG_member
    6807                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$19)
    6808                      .dwattr $C$DW$390, DW_AT_name("all")
    6809                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_all")
    6810                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6811                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    6812              
    6813              $C$DW$391       .dwtag  DW_TAG_member
    6814                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$33)
    6815                      .dwattr $C$DW$391, DW_AT_name("bit")
    6816                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_bit")
    6817                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6818                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    6819              
    6820                      .dwendtag $C$DW$T$34
    6821              
    6822              
    6823              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    6824                      .dwattr $C$DW$T$35, DW_AT_name("GPBCLEAR_BITS")
    6825                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    6826              $C$DW$392       .dwtag  DW_TAG_member
    6827                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$19)
    6828                      .dwattr $C$DW$392, DW_AT_name("GPIOB0")
    6829                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_GPIOB0")
    6830                      .dwattr $C$DW$392, DW_AT_bit_offset(0x0f)
    6831                      .dwattr $C$DW$392, DW_AT_bit_size(0x01)
    6832                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6833                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    6834              
    6835              $C$DW$393       .dwtag  DW_TAG_member
    6836                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$19)
    6837                      .dwattr $C$DW$393, DW_AT_name("GPIOB1")
    6838                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_GPIOB1")
    6839                      .dwattr $C$DW$393, DW_AT_bit_offset(0x0e)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/main_nonBIOS.asm PAGE  134

    6840                      .dwattr $C$DW$393, DW_AT_bit_size(0x01)
    6841                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6842                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    6843              
    6844              $C$DW$394       .dwtag  DW_TAG_member
    6845                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$19)
    6846                      .dwattr $C$DW$394, DW_AT_name("GPIOB2")
    6847                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_GPIOB2")
    6848                      .dwattr $C$DW$394, DW_AT_bit_offset(0x0d)
    6849                      .dwattr $C$DW$394, DW_AT_bit_size(0x01)
    6850                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6851                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    6852              
    6853              $C$DW$395       .dwtag  DW_TAG_member
    6854                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$19)
    6855                      .dwattr $C$DW$395, DW_AT_name("GPIOB3")
    6856                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_GPIOB3")
    6857                      .dwattr $C$DW$395, DW_AT_bit_offset(0x0c)
    6858                      .dwattr $C$DW$395, DW_AT_bit_size(0x01)
    6859                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6860                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    6861              
    6862              $C$DW$396       .dwtag  DW_TAG_member
    6863                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$19)
    6864                      .dwattr $C$DW$396, DW_AT_name("GPIOB4")
    6865                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_GPIOB4")
    6866                      .dwattr $C$DW$396, DW_AT_bit_offset(0x0b)
    6867                      .dwattr $C$DW$396, DW_AT_bit_size(0x01)
    6868                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6869                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    6870              
    6871              $C$DW$397       .dwtag  DW_TAG_member
    6872                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$19)
    6873                      .dwattr $C$DW$397, DW_AT_name("GPIOB5")
    6874                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_GPIOB5")
    6875                      .dwattr $C$DW$397, DW_AT_bit_offset(0x0a)
    6876                      .dwattr $C$DW$397, DW_AT_bit_size(0x01)
    6877                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6878                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    6879              
    6880              $C$DW$398       .dwtag  DW_TAG_member
    6881                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$19)
    6882                      .dwattr $C$DW$398, DW_AT_name("GPIOB6")
    6883                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_GPIOB6")
    6884                      .dwattr $C$DW$398, DW_AT_bit_offset(0x09)
    6885                      .dwattr $C$DW$398, DW_AT_bit_size(0x01)
    6886                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6887                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    6888              
    6889              $C$DW$399       .dwtag  DW_TAG_member
    6890                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$19)
    6891                      .dwattr $C$DW$399, DW_AT_name("GPIOB7")
    6892                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_GPIOB7")
    6893                      .dwattr $C$DW$399, DW_AT_bit_offset(0x08)
    6894                      .dwattr $C$DW$399, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/main_nonBIOS.asm PAGE  135

    6895                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6896                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    6897              
    6898              $C$DW$400       .dwtag  DW_TAG_member
    6899                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$19)
    6900                      .dwattr $C$DW$400, DW_AT_name("GPIOB8")
    6901                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_GPIOB8")
    6902                      .dwattr $C$DW$400, DW_AT_bit_offset(0x07)
    6903                      .dwattr $C$DW$400, DW_AT_bit_size(0x01)
    6904                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6905                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    6906              
    6907              $C$DW$401       .dwtag  DW_TAG_member
    6908                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$19)
    6909                      .dwattr $C$DW$401, DW_AT_name("GPIOB9")
    6910                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_GPIOB9")
    6911                      .dwattr $C$DW$401, DW_AT_bit_offset(0x06)
    6912                      .dwattr $C$DW$401, DW_AT_bit_size(0x01)
    6913                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6914                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    6915              
    6916              $C$DW$402       .dwtag  DW_TAG_member
    6917                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$19)
    6918                      .dwattr $C$DW$402, DW_AT_name("GPIOB10")
    6919                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_GPIOB10")
    6920                      .dwattr $C$DW$402, DW_AT_bit_offset(0x05)
    6921                      .dwattr $C$DW$402, DW_AT_bit_size(0x01)
    6922                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6923                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    6924              
    6925              $C$DW$403       .dwtag  DW_TAG_member
    6926                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$19)
    6927                      .dwattr $C$DW$403, DW_AT_name("GPIOB11")
    6928                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_GPIOB11")
    6929                      .dwattr $C$DW$403, DW_AT_bit_offset(0x04)
    6930                      .dwattr $C$DW$403, DW_AT_bit_size(0x01)
    6931                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6932                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    6933              
    6934              $C$DW$404       .dwtag  DW_TAG_member
    6935                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$19)
    6936                      .dwattr $C$DW$404, DW_AT_name("GPIOB12")
    6937                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_GPIOB12")
    6938                      .dwattr $C$DW$404, DW_AT_bit_offset(0x03)
    6939                      .dwattr $C$DW$404, DW_AT_bit_size(0x01)
    6940                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6941                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    6942              
    6943              $C$DW$405       .dwtag  DW_TAG_member
    6944                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$19)
    6945                      .dwattr $C$DW$405, DW_AT_name("GPIOB13")
    6946                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_GPIOB13")
    6947                      .dwattr $C$DW$405, DW_AT_bit_offset(0x02)
    6948                      .dwattr $C$DW$405, DW_AT_bit_size(0x01)
    6949                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/main_nonBIOS.asm PAGE  136

    6950                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    6951              
    6952              $C$DW$406       .dwtag  DW_TAG_member
    6953                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$19)
    6954                      .dwattr $C$DW$406, DW_AT_name("GPIOB14")
    6955                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_GPIOB14")
    6956                      .dwattr $C$DW$406, DW_AT_bit_offset(0x01)
    6957                      .dwattr $C$DW$406, DW_AT_bit_size(0x01)
    6958                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6959                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    6960              
    6961              $C$DW$407       .dwtag  DW_TAG_member
    6962                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$19)
    6963                      .dwattr $C$DW$407, DW_AT_name("GPIOB15")
    6964                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_GPIOB15")
    6965                      .dwattr $C$DW$407, DW_AT_bit_offset(0x00)
    6966                      .dwattr $C$DW$407, DW_AT_bit_size(0x01)
    6967                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6968                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    6969              
    6970                      .dwendtag $C$DW$T$35
    6971              
    6972              
    6973              $C$DW$T$36      .dwtag  DW_TAG_union_type
    6974                      .dwattr $C$DW$T$36, DW_AT_name("GPBCLEAR_REG")
    6975                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    6976              $C$DW$408       .dwtag  DW_TAG_member
    6977                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$19)
    6978                      .dwattr $C$DW$408, DW_AT_name("all")
    6979                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_all")
    6980                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6981                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    6982              
    6983              $C$DW$409       .dwtag  DW_TAG_member
    6984                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$35)
    6985                      .dwattr $C$DW$409, DW_AT_name("bit")
    6986                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_bit")
    6987                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6988                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    6989              
    6990                      .dwendtag $C$DW$T$36
    6991              
    6992              
    6993              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    6994                      .dwattr $C$DW$T$37, DW_AT_name("GPBDAT_BITS")
    6995                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    6996              $C$DW$410       .dwtag  DW_TAG_member
    6997                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$19)
    6998                      .dwattr $C$DW$410, DW_AT_name("GPIOB0")
    6999                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_GPIOB0")
    7000                      .dwattr $C$DW$410, DW_AT_bit_offset(0x0f)
    7001                      .dwattr $C$DW$410, DW_AT_bit_size(0x01)
    7002                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7003                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    7004              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/main_nonBIOS.asm PAGE  137

    7005              $C$DW$411       .dwtag  DW_TAG_member
    7006                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$19)
    7007                      .dwattr $C$DW$411, DW_AT_name("GPIOB1")
    7008                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_GPIOB1")
    7009                      .dwattr $C$DW$411, DW_AT_bit_offset(0x0e)
    7010                      .dwattr $C$DW$411, DW_AT_bit_size(0x01)
    7011                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7012                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    7013              
    7014              $C$DW$412       .dwtag  DW_TAG_member
    7015                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$19)
    7016                      .dwattr $C$DW$412, DW_AT_name("GPIOB2")
    7017                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_GPIOB2")
    7018                      .dwattr $C$DW$412, DW_AT_bit_offset(0x0d)
    7019                      .dwattr $C$DW$412, DW_AT_bit_size(0x01)
    7020                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7021                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    7022              
    7023              $C$DW$413       .dwtag  DW_TAG_member
    7024                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$19)
    7025                      .dwattr $C$DW$413, DW_AT_name("GPIOB3")
    7026                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_GPIOB3")
    7027                      .dwattr $C$DW$413, DW_AT_bit_offset(0x0c)
    7028                      .dwattr $C$DW$413, DW_AT_bit_size(0x01)
    7029                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7030                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
