TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:45 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Max7301.asm PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.0 *
       3              ;* Date/Time created: Tue Sep 16 13:11:44 2008                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("Max7301.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.0 Copyright (c) 1996-2005 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("TxSpi"), DW_AT_symbol_name("_TxSpi")
      15                      .dwattr DW$1, DW_AT_declaration(0x01)
      16                      .dwattr DW$1, DW_AT_external(0x01)
      17              DW$2    .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)

     703              ; 177 | GpioDataRegs.GPFSET.bit.GPIOF13 = 1;                                   
     704              ;----------------------------------------------------------------------
     705 0000009c 761F!         MOVW      DP,#_GpioDataRegs+21
         0000009d 0000 
     706 0000009e 1A15!         OR        @_GpioDataRegs+21,#0x2000 ; |177| 
         0000009f 2000 
     707 000000a0       L16:    
     708                      .dwpsn  "Max7301.c",179,1
     709 000000a0 FE82          SUBB      SP,#2
     710                      .dwcfa  0x1d, -2
     711 000000a1 0006          LRETR
     712                      ; return occurs
     713                      .dwattr DW$36, DW_AT_end_file("Max7301.c")
     714                      .dwattr DW$36, DW_AT_end_line(0xb3)
     715                      .dwattr DW$36, DW_AT_end_column(0x01)
     716                      .dwendentry
     717                      .dwendtag DW$36
     718              
     719              ;***************************************************************
     720              ;* UNDEFINED EXTERNAL REFERENCES                               *
     721              ;***************************************************************
     722                      .global _TxSpi
     723                      .global _ConfigSpi
     724                      .global _SpiTxNotReady
     725                      .global _RxSpi
     726                      .global _SpiRxNotReady
     727                      .global _GpioDataRegs
     728              
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:45 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Max7301.asm PAGE   15

     729              ;***************************************************************
     730              ;* TYPE INFORMATION                                            *
     731              ;***************************************************************
     732              
     733              DW$T$70 .dwtag  DW_TAG_subroutine_type
     734                      .dwattr DW$T$70, DW_AT_language(DW_LANG_C)
     735              DW$39   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
     736              DW$40   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
     737                      .dwendtag DW$T$70
     738              
     739              
     740              DW$T$72 .dwtag  DW_TAG_subroutine_type
     741                      .dwattr DW$T$72, DW_AT_language(DW_LANG_C)
     742              DW$41   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     743                      .dwendtag DW$T$72
     744              
     745              
     746              DW$T$74 .dwtag  DW_TAG_subroutine_type
     747                      .dwattr DW$T$74, DW_AT_language(DW_LANG_C)
     748              
     749              DW$T$76 .dwtag  DW_TAG_subroutine_type
     750                      .dwattr DW$T$76, DW_AT_language(DW_LANG_C)
     751              DW$42   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$75)
     752              DW$43   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$75)
     753                      .dwendtag DW$T$76
     754              
     755              
     756              DW$T$78 .dwtag  DW_TAG_subroutine_type
     757                      .dwattr DW$T$78, DW_AT_language(DW_LANG_C)
     758              DW$44   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$75)
     759                      .dwendtag DW$T$78
     760              
     761              DW$T$75 .dwtag  DW_TAG_typedef, DW_AT_name("Byte"), DW_AT_type(*DW$T$6)
     762                      .dwattr DW$T$75, DW_AT_language(DW_LANG_C)
     763              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     764                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     765                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
     766              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$11)
     767                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
     768              
     769              DW$T$80 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
     770                      .dwattr DW$T$80, DW_AT_language(DW_LANG_C)
     771              
     772              DW$T$82 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
     773                      .dwattr DW$T$82, DW_AT_language(DW_LANG_C)
     774              DW$45   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     775                      .dwendtag DW$T$82
     776              
     777              DW$46   .dwtag  DW_TAG_far_type
     778                      .dwattr DW$46, DW_AT_type(*DW$T$69)
     779              DW$T$88 .dwtag  DW_TAG_volatile_type
     780                      .dwattr DW$T$88, DW_AT_type(*DW$46)
     781              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
     782                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     783                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:45 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Max7301.asm PAGE   16

     784              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     785                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     786                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
     787              
     788              DW$T$69 .dwtag  DW_TAG_structure_type
     789                      .dwattr DW$T$69, DW_AT_name("GPIO_DATA_REGS")
     790                      .dwattr DW$T$69, DW_AT_byte_size(0x20)
     791              DW$47   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     792                      .dwattr DW$47, DW_AT_name("GPADAT"), DW_AT_symbol_name("_GPADAT")
     793                      .dwattr DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     794                      .dwattr DW$47, DW_AT_accessibility(DW_ACCESS_public)
     795              DW$48   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     796                      .dwattr DW$48, DW_AT_name("GPASET"), DW_AT_symbol_name("_GPASET")
     797                      .dwattr DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     798                      .dwattr DW$48, DW_AT_accessibility(DW_ACCESS_public)
     799              DW$49   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
     800                      .dwattr DW$49, DW_AT_name("GPACLEAR"), DW_AT_symbol_name("_GPACLEAR")
     801                      .dwattr DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     802                      .dwattr DW$49, DW_AT_accessibility(DW_ACCESS_public)
     803              DW$50   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
     804                      .dwattr DW$50, DW_AT_name("GPATOGGLE"), DW_AT_symbol_name("_GPATOGGLE")
     805                      .dwattr DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     806                      .dwattr DW$50, DW_AT_accessibility(DW_ACCESS_public)
     807              DW$51   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
     808                      .dwattr DW$51, DW_AT_name("GPBDAT"), DW_AT_symbol_name("_GPBDAT")
     809                      .dwattr DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     810                      .dwattr DW$51, DW_AT_accessibility(DW_ACCESS_public)
     811              DW$52   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
     812                      .dwattr DW$52, DW_AT_name("GPBSET"), DW_AT_symbol_name("_GPBSET")
     813                      .dwattr DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     814                      .dwattr DW$52, DW_AT_accessibility(DW_ACCESS_public)
     815              DW$53   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
     816                      .dwattr DW$53, DW_AT_name("GPBCLEAR"), DW_AT_symbol_name("_GPBCLEAR")
     817                      .dwattr DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     818                      .dwattr DW$53, DW_AT_accessibility(DW_ACCESS_public)
     819              DW$54   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
     820                      .dwattr DW$54, DW_AT_name("GPBTOGGLE"), DW_AT_symbol_name("_GPBTOGGLE")
     821                      .dwattr DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     822                      .dwattr DW$54, DW_AT_accessibility(DW_ACCESS_public)
     823              DW$55   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
     824                      .dwattr DW$55, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
     825                      .dwattr DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     826                      .dwattr DW$55, DW_AT_accessibility(DW_ACCESS_public)
     827              DW$56   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
     828                      .dwattr DW$56, DW_AT_name("GPDDAT"), DW_AT_symbol_name("_GPDDAT")
     829                      .dwattr DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     830                      .dwattr DW$56, DW_AT_accessibility(DW_ACCESS_public)
     831              DW$57   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
     832                      .dwattr DW$57, DW_AT_name("GPDSET"), DW_AT_symbol_name("_GPDSET")
     833                      .dwattr DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     834                      .dwattr DW$57, DW_AT_accessibility(DW_ACCESS_public)
     835              DW$58   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
     836                      .dwattr DW$58, DW_AT_name("GPDCLEAR"), DW_AT_symbol_name("_GPDCLEAR")
     837                      .dwattr DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     838                      .dwattr DW$58, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:45 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Max7301.asm PAGE   17

     839              DW$59   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
     840                      .dwattr DW$59, DW_AT_name("GPDTOGGLE"), DW_AT_symbol_name("_GPDTOGGLE")
     841                      .dwattr DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     842                      .dwattr DW$59, DW_AT_accessibility(DW_ACCESS_public)
     843              DW$60   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
     844                      .dwattr DW$60, DW_AT_name("GPEDAT"), DW_AT_symbol_name("_GPEDAT")
     845                      .dwattr DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     846                      .dwattr DW$60, DW_AT_accessibility(DW_ACCESS_public)
     847              DW$61   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
     848                      .dwattr DW$61, DW_AT_name("GPESET"), DW_AT_symbol_name("_GPESET")
     849                      .dwattr DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
     850                      .dwattr DW$61, DW_AT_accessibility(DW_ACCESS_public)
     851              DW$62   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
     852                      .dwattr DW$62, DW_AT_name("GPECLEAR"), DW_AT_symbol_name("_GPECLEAR")
     853                      .dwattr DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     854                      .dwattr DW$62, DW_AT_accessibility(DW_ACCESS_public)
     855              DW$63   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
     856                      .dwattr DW$63, DW_AT_name("GPETOGGLE"), DW_AT_symbol_name("_GPETOGGLE")
     857                      .dwattr DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
     858                      .dwattr DW$63, DW_AT_accessibility(DW_ACCESS_public)
     859              DW$64   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$53)
     860                      .dwattr DW$64, DW_AT_name("GPFDAT"), DW_AT_symbol_name("_GPFDAT")
     861                      .dwattr DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     862                      .dwattr DW$64, DW_AT_accessibility(DW_ACCESS_public)
     863              DW$65   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
     864                      .dwattr DW$65, DW_AT_name("GPFSET"), DW_AT_symbol_name("_GPFSET")
     865                      .dwattr DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     866                      .dwattr DW$65, DW_AT_accessibility(DW_ACCESS_public)
     867              DW$66   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
     868                      .dwattr DW$66, DW_AT_name("GPFCLEAR"), DW_AT_symbol_name("_GPFCLEAR")
     869                      .dwattr DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     870                      .dwattr DW$66, DW_AT_accessibility(DW_ACCESS_public)
     871              DW$67   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     872                      .dwattr DW$67, DW_AT_name("GPFTOGGLE"), DW_AT_symbol_name("_GPFTOGGLE")
     873                      .dwattr DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     874                      .dwattr DW$67, DW_AT_accessibility(DW_ACCESS_public)
     875              DW$68   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
     876                      .dwattr DW$68, DW_AT_name("GPGDAT"), DW_AT_symbol_name("_GPGDAT")
     877                      .dwattr DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     878                      .dwattr DW$68, DW_AT_accessibility(DW_ACCESS_public)
     879              DW$69   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
     880                      .dwattr DW$69, DW_AT_name("GPGSET"), DW_AT_symbol_name("_GPGSET")
     881                      .dwattr DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
     882                      .dwattr DW$69, DW_AT_accessibility(DW_ACCESS_public)
     883              DW$70   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
     884                      .dwattr DW$70, DW_AT_name("GPGCLEAR"), DW_AT_symbol_name("_GPGCLEAR")
     885                      .dwattr DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     886                      .dwattr DW$70, DW_AT_accessibility(DW_ACCESS_public)
     887              DW$71   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
     888                      .dwattr DW$71, DW_AT_name("GPGTOGGLE"), DW_AT_symbol_name("_GPGTOGGLE")
     889                      .dwattr DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
     890                      .dwattr DW$71, DW_AT_accessibility(DW_ACCESS_public)
     891              DW$72   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
     892                      .dwattr DW$72, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
     893                      .dwattr DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:45 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Max7301.asm PAGE   18

     894                      .dwattr DW$72, DW_AT_accessibility(DW_ACCESS_public)
     895                      .dwendtag DW$T$69
     896              
     897              
     898              DW$T$68 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
     899                      .dwattr DW$T$68, DW_AT_language(DW_LANG_C)
     900                      .dwattr DW$T$68, DW_AT_byte_size(0x04)
     901              DW$73   .dwtag  DW_TAG_subrange_type
     902                      .dwattr DW$73, DW_AT_upper_bound(0x03)
     903                      .dwendtag DW$T$68
     904              
     905              
     906              DW$T$21 .dwtag  DW_TAG_union_type
     907                      .dwattr DW$T$21, DW_AT_name("GPADAT_REG")
     908                      .dwattr DW$T$21, DW_AT_byte_size(0x01)
     909              DW$74   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     910                      .dwattr DW$74, DW_AT_name("all"), DW_AT_symbol_name("_all")
     911                      .dwattr DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     912                      .dwattr DW$74, DW_AT_accessibility(DW_ACCESS_public)
     913              DW$75   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     914                      .dwattr DW$75, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
     915                      .dwattr DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     916                      .dwattr DW$75, DW_AT_accessibility(DW_ACCESS_public)
     917                      .dwendtag DW$T$21
     918              
     919              
     920              DW$T$23 .dwtag  DW_TAG_union_type
     921                      .dwattr DW$T$23, DW_AT_name("GPASET_REG")
     922                      .dwattr DW$T$23, DW_AT_byte_size(0x01)
     923              DW$76   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     924                      .dwattr DW$76, DW_AT_name("all"), DW_AT_symbol_name("_all")
     925                      .dwattr DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     926                      .dwattr DW$76, DW_AT_accessibility(DW_ACCESS_public)
     927              DW$77   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     928                      .dwattr DW$77, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
     929                      .dwattr DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     930                      .dwattr DW$77, DW_AT_accessibility(DW_ACCESS_public)
     931                      .dwendtag DW$T$23
     932              
     933              
     934              DW$T$25 .dwtag  DW_TAG_union_type
     935                      .dwattr DW$T$25, DW_AT_name("GPACLEAR_REG")
     936                      .dwattr DW$T$25, DW_AT_byte_size(0x01)
     937              DW$78   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     938                      .dwattr DW$78, DW_AT_name("all"), DW_AT_symbol_name("_all")
     939                      .dwattr DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     940                      .dwattr DW$78, DW_AT_accessibility(DW_ACCESS_public)
     941              DW$79   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     942                      .dwattr DW$79, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
     943                      .dwattr DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     944                      .dwattr DW$79, DW_AT_accessibility(DW_ACCESS_public)
     945                      .dwendtag DW$T$25
     946              
     947              
     948              DW$T$27 .dwtag  DW_TAG_union_type
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:45 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Max7301.asm PAGE   19

     949                      .dwattr DW$T$27, DW_AT_name("GPATOGGLE_REG")
     950                      .dwattr DW$T$27, DW_AT_byte_size(0x01)
     951              DW$80   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     952                      .dwattr DW$80, DW_AT_name("all"), DW_AT_symbol_name("_all")
     953                      .dwattr DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     954                      .dwattr DW$80, DW_AT_accessibility(DW_ACCESS_public)
     955              DW$81   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
     956                      .dwattr DW$81, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
     957                      .dwattr DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     958                      .dwattr DW$81, DW_AT_accessibility(DW_ACCESS_public)
     959                      .dwendtag DW$T$27
     960              
     961              
     962              DW$T$29 .dwtag  DW_TAG_union_type
     963                      .dwattr DW$T$29, DW_AT_name("GPBDAT_REG")
     964                      .dwattr DW$T$29, DW_AT_byte_size(0x01)
     965              DW$82   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     966                      .dwattr DW$82, DW_AT_name("all"), DW_AT_symbol_name("_all")
     967                      .dwattr DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     968                      .dwattr DW$82, DW_AT_accessibility(DW_ACCESS_public)
     969              DW$83   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
     970                      .dwattr DW$83, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
     971                      .dwattr DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     972                      .dwattr DW$83, DW_AT_accessibility(DW_ACCESS_public)
     973                      .dwendtag DW$T$29
     974              
     975              
     976              DW$T$31 .dwtag  DW_TAG_union_type
     977                      .dwattr DW$T$31, DW_AT_name("GPBSET_REG")
     978                      .dwattr DW$T$31, DW_AT_byte_size(0x01)
     979              DW$84   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     980                      .dwattr DW$84, DW_AT_name("all"), DW_AT_symbol_name("_all")
     981                      .dwattr DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     982                      .dwattr DW$84, DW_AT_accessibility(DW_ACCESS_public)
     983              DW$85   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
     984                      .dwattr DW$85, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
     985                      .dwattr DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     986                      .dwattr DW$85, DW_AT_accessibility(DW_ACCESS_public)
     987                      .dwendtag DW$T$31
     988              
     989              
     990              DW$T$33 .dwtag  DW_TAG_union_type
     991                      .dwattr DW$T$33, DW_AT_name("GPBCLEAR_REG")
     992                      .dwattr DW$T$33, DW_AT_byte_size(0x01)
     993              DW$86   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     994                      .dwattr DW$86, DW_AT_name("all"), DW_AT_symbol_name("_all")
     995                      .dwattr DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     996                      .dwattr DW$86, DW_AT_accessibility(DW_ACCESS_public)
     997              DW$87   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
     998                      .dwattr DW$87, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
     999                      .dwattr DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1000                      .dwattr DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1001                      .dwendtag DW$T$33
    1002              
    1003              
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:45 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Max7301.asm PAGE   20

    1004              DW$T$35 .dwtag  DW_TAG_union_type
    1005                      .dwattr DW$T$35, DW_AT_name("GPBTOGGLE_REG")
    1006                      .dwattr DW$T$35, DW_AT_byte_size(0x01)
    1007              DW$88   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1008                      .dwattr DW$88, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1009                      .dwattr DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1010                      .dwattr DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1011              DW$89   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    1012                      .dwattr DW$89, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1013                      .dwattr DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1014                      .dwattr DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1015                      .dwendtag DW$T$35
    1016              
    1017              
    1018              DW$T$37 .dwtag  DW_TAG_union_type
    1019                      .dwattr DW$T$37, DW_AT_name("GPDDAT_REG")
    1020                      .dwattr DW$T$37, DW_AT_byte_size(0x01)
    1021              DW$90   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1022                      .dwattr DW$90, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1023                      .dwattr DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1024                      .dwattr DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1025              DW$91   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    1026                      .dwattr DW$91, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1027                      .dwattr DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1028                      .dwattr DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1029                      .dwendtag DW$T$37
    1030              
    1031              
    1032              DW$T$39 .dwtag  DW_TAG_union_type
    1033                      .dwattr DW$T$39, DW_AT_name("GPDSET_REG")
    1034                      .dwattr DW$T$39, DW_AT_byte_size(0x01)
    1035              DW$92   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1036                      .dwattr DW$92, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1037                      .dwattr DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1038                      .dwattr DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1039              DW$93   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    1040                      .dwattr DW$93, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1041                      .dwattr DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1042                      .dwattr DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1043                      .dwendtag DW$T$39
    1044              
    1045              
    1046              DW$T$41 .dwtag  DW_TAG_union_type
    1047                      .dwattr DW$T$41, DW_AT_name("GPDCLEAR_REG")
    1048                      .dwattr DW$T$41, DW_AT_byte_size(0x01)
    1049              DW$94   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1050                      .dwattr DW$94, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1051                      .dwattr DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1052                      .dwattr DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1053              DW$95   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
    1054                      .dwattr DW$95, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1055                      .dwattr DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1056                      .dwattr DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1057                      .dwendtag DW$T$41
    1058              
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:45 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Max7301.asm PAGE   21

    1059              
    1060              DW$T$43 .dwtag  DW_TAG_union_type
    1061                      .dwattr DW$T$43, DW_AT_name("GPDTOGGLE_REG")
    1062                      .dwattr DW$T$43, DW_AT_byte_size(0x01)
    1063              DW$96   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1064                      .dwattr DW$96, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1065                      .dwattr DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1066                      .dwattr DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1067              DW$97   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    1068                      .dwattr DW$97, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1069                      .dwattr DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1070                      .dwattr DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1071                      .dwendtag DW$T$43
    1072              
    1073              
    1074              DW$T$45 .dwtag  DW_TAG_union_type
    1075                      .dwattr DW$T$45, DW_AT_name("GPEDAT_REG")
    1076                      .dwattr DW$T$45, DW_AT_byte_size(0x01)
    1077              DW$98   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1078                      .dwattr DW$98, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1079                      .dwattr DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1080                      .dwattr DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1081              DW$99   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
    1082                      .dwattr DW$99, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1083                      .dwattr DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1084                      .dwattr DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1085                      .dwendtag DW$T$45
    1086              
    1087              
    1088              DW$T$47 .dwtag  DW_TAG_union_type
    1089                      .dwattr DW$T$47, DW_AT_name("GPESET_REG")
    1090                      .dwattr DW$T$47, DW_AT_byte_size(0x01)
    1091              DW$100  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1092                      .dwattr DW$100, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1093                      .dwattr DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1094                      .dwattr DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1095              DW$101  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
    1096                      .dwattr DW$101, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1097                      .dwattr DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1098                      .dwattr DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1099                      .dwendtag DW$T$47
    1100              
    1101              
    1102              DW$T$49 .dwtag  DW_TAG_union_type
    1103                      .dwattr DW$T$49, DW_AT_name("GPECLEAR_REG")
    1104                      .dwattr DW$T$49, DW_AT_byte_size(0x01)
    1105              DW$102  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1106                      .dwattr DW$102, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1107                      .dwattr DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1108                      .dwattr DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1109              DW$103  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
    1110                      .dwattr DW$103, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1111                      .dwattr DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1112                      .dwattr DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1113                      .dwendtag DW$T$49
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:45 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Max7301.asm PAGE   22

    1114              
    1115              
    1116              DW$T$51 .dwtag  DW_TAG_union_type
    1117                      .dwattr DW$T$51, DW_AT_name("GPETOGGLE_REG")
    1118                      .dwattr DW$T$51, DW_AT_byte_size(0x01)
    1119              DW$104  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1120                      .dwattr DW$104, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1121                      .dwattr DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1122                      .dwattr DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1123              DW$105  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
    1124                      .dwattr DW$105, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1125                      .dwattr DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1126                      .dwattr DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1127                      .dwendtag DW$T$51
    1128              
    1129              
    1130              DW$T$53 .dwtag  DW_TAG_union_type
    1131                      .dwattr DW$T$53, DW_AT_name("GPFDAT_REG")
    1132                      .dwattr DW$T$53, DW_AT_byte_size(0x01)
    1133              DW$106  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1134                      .dwattr DW$106, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1135                      .dwattr DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1136                      .dwattr DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1137              DW$107  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
    1138                      .dwattr DW$107, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1139                      .dwattr DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1140                      .dwattr DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1141                      .dwendtag DW$T$53
    1142              
    1143              
    1144              DW$T$55 .dwtag  DW_TAG_union_type
    1145                      .dwattr DW$T$55, DW_AT_name("GPFSET_REG")
    1146                      .dwattr DW$T$55, DW_AT_byte_size(0x01)
    1147              DW$108  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1148                      .dwattr DW$108, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1149                      .dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1150                      .dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1151              DW$109  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
    1152                      .dwattr DW$109, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1153                      .dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1154                      .dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1155                      .dwendtag DW$T$55
    1156              
    1157              
    1158              DW$T$57 .dwtag  DW_TAG_union_type
    1159                      .dwattr DW$T$57, DW_AT_name("GPFCLEAR_REG")
    1160                      .dwattr DW$T$57, DW_AT_byte_size(0x01)
    1161              DW$110  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1162                      .dwattr DW$110, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1163                      .dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1164                      .dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1165              DW$111  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
    1166                      .dwattr DW$111, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1167                      .dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1168                      .dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:45 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Max7301.asm PAGE   23

    1169                      .dwendtag DW$T$57
    1170              
    1171              
    1172              DW$T$59 .dwtag  DW_TAG_union_type
    1173                      .dwattr DW$T$59, DW_AT_name("GPFTOGGLE_REG")
    1174                      .dwattr DW$T$59, DW_AT_byte_size(0x01)
    1175              DW$112  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1176                      .dwattr DW$112, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1177                      .dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1178                      .dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1179              DW$113  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    1180                      .dwattr DW$113, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1181                      .dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1182                      .dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1183                      .dwendtag DW$T$59
    1184              
    1185              
    1186              DW$T$61 .dwtag  DW_TAG_union_type
    1187                      .dwattr DW$T$61, DW_AT_name("GPGDAT_REG")
    1188                      .dwattr DW$T$61, DW_AT_byte_size(0x01)
    1189              DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1190                      .dwattr DW$114, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1191                      .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1192                      .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1193              DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
    1194                      .dwattr DW$115, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1195                      .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1196                      .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1197                      .dwendtag DW$T$61
    1198              
    1199              
    1200              DW$T$63 .dwtag  DW_TAG_union_type
    1201                      .dwattr DW$T$63, DW_AT_name("GPGSET_REG")
    1202                      .dwattr DW$T$63, DW_AT_byte_size(0x01)
    1203              DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1204                      .dwattr DW$116, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1205                      .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1206                      .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1207              DW$117  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
    1208                      .dwattr DW$117, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1209                      .dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1210                      .dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1211                      .dwendtag DW$T$63
    1212              
    1213              
    1214              DW$T$65 .dwtag  DW_TAG_union_type
    1215                      .dwattr DW$T$65, DW_AT_name("GPGCLEAR_REG")
    1216                      .dwattr DW$T$65, DW_AT_byte_size(0x01)
    1217              DW$118  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1218                      .dwattr DW$118, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1219                      .dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1220                      .dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1221              DW$119  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
    1222                      .dwattr DW$119, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1223                      .dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:45 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Max7301.asm PAGE   24

    1224                      .dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1225                      .dwendtag DW$T$65
    1226              
    1227              
    1228              DW$T$67 .dwtag  DW_TAG_union_type
    1229                      .dwattr DW$T$67, DW_AT_name("GPGTOGGLE_REG")
    1230                      .dwattr DW$T$67, DW_AT_byte_size(0x01)
    1231              DW$120  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1232                      .dwattr DW$120, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1233                      .dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1234                      .dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1235              DW$121  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
    1236                      .dwattr DW$121, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1237                      .dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1238                      .dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1239                      .dwendtag DW$T$67
    1240              
    1241              
    1242              DW$T$20 .dwtag  DW_TAG_structure_type
    1243                      .dwattr DW$T$20, DW_AT_name("GPADAT_BITS")
    1244                      .dwattr DW$T$20, DW_AT_byte_size(0x01)
    1245              DW$122  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1246                      .dwattr DW$122, DW_AT_name("GPIOA0"), DW_AT_symbol_name("_GPIOA0")
    1247                      .dwattr DW$122, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1248                      .dwattr DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1249                      .dwattr DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1250              DW$123  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1251                      .dwattr DW$123, DW_AT_name("GPIOA1"), DW_AT_symbol_name("_GPIOA1")
    1252                      .dwattr DW$123, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1253                      .dwattr DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1254                      .dwattr DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1255              DW$124  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1256                      .dwattr DW$124, DW_AT_name("GPIOA2"), DW_AT_symbol_name("_GPIOA2")
    1257                      .dwattr DW$124, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1258                      .dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1259                      .dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1260              DW$125  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1261                      .dwattr DW$125, DW_AT_name("GPIOA3"), DW_AT_symbol_name("_GPIOA3")
    1262                      .dwattr DW$125, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1263                      .dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1264                      .dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1265              DW$126  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1266                      .dwattr DW$126, DW_AT_name("GPIOA4"), DW_AT_symbol_name("_GPIOA4")
    1267                      .dwattr DW$126, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1268                      .dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1269                      .dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1270              DW$127  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1271                      .dwattr DW$127, DW_AT_name("GPIOA5"), DW_AT_symbol_name("_GPIOA5")
    1272                      .dwattr DW$127, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1273                      .dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1274                      .dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1275              DW$128  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1276                      .dwattr DW$128, DW_AT_name("GPIOA6"), DW_AT_symbol_name("_GPIOA6")
    1277                      .dwattr DW$128, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1278                      .dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:45 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Max7301.asm PAGE   25

    1279                      .dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1280              DW$129  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1281                      .dwattr DW$129, DW_AT_name("GPIOA7"), DW_AT_symbol_name("_GPIOA7")
    1282                      .dwattr DW$129, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1283                      .dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1284                      .dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1285              DW$130  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1286                      .dwattr DW$130, DW_AT_name("GPIOA8"), DW_AT_symbol_name("_GPIOA8")
    1287                      .dwattr DW$130, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1288                      .dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1289                      .dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1290              DW$131  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1291                      .dwattr DW$131, DW_AT_name("GPIOA9"), DW_AT_symbol_name("_GPIOA9")
    1292                      .dwattr DW$131, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1293                      .dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1294                      .dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1295              DW$132  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1296                      .dwattr DW$132, DW_AT_name("GPIOA10"), DW_AT_symbol_name("_GPIOA10")
    1297                      .dwattr DW$132, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1298                      .dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1299                      .dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1300              DW$133  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1301                      .dwattr DW$133, DW_AT_name("GPIOA11"), DW_AT_symbol_name("_GPIOA11")
    1302                      .dwattr DW$133, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1303                      .dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1304                      .dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1305              DW$134  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1306                      .dwattr DW$134, DW_AT_name("GPIOA12"), DW_AT_symbol_name("_GPIOA12")
    1307                      .dwattr DW$134, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1308                      .dwattr DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1309                      .dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1310              DW$135  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1311                      .dwattr DW$135, DW_AT_name("GPIOA13"), DW_AT_symbol_name("_GPIOA13")
    1312                      .dwattr DW$135, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1313                      .dwattr DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1314                      .dwattr DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1315              DW$136  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1316                      .dwattr DW$136, DW_AT_name("GPIOA14"), DW_AT_symbol_name("_GPIOA14")
    1317                      .dwattr DW$136, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1318                      .dwattr DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1319                      .dwattr DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1320              DW$137  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1321                      .dwattr DW$137, DW_AT_name("GPIOA15"), DW_AT_symbol_name("_GPIOA15")
    1322                      .dwattr DW$137, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1323                      .dwattr DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1324                      .dwattr DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1325                      .dwendtag DW$T$20
    1326              
    1327              
    1328              DW$T$22 .dwtag  DW_TAG_structure_type
    1329                      .dwattr DW$T$22, DW_AT_name("GPASET_BITS")
    1330                      .dwattr DW$T$22, DW_AT_byte_size(0x01)
    1331              DW$138  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1332                      .dwattr DW$138, DW_AT_name("GPIOA0"), DW_AT_symbol_name("_GPIOA0")
    1333                      .dwattr DW$138, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:45 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Max7301.asm PAGE   26

    1334                      .dwattr DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1335                      .dwattr DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1336              DW$139  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1337                      .dwattr DW$139, DW_AT_name("GPIOA1"), DW_AT_symbol_name("_GPIOA1")
    1338                      .dwattr DW$139, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1339                      .dwattr DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1340                      .dwattr DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1341              DW$140  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1342                      .dwattr DW$140, DW_AT_name("GPIOA2"), DW_AT_symbol_name("_GPIOA2")
    1343                      .dwattr DW$140, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1344                      .dwattr DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1345                      .dwattr DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1346              DW$141  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1347                      .dwattr DW$141, DW_AT_name("GPIOA3"), DW_AT_symbol_name("_GPIOA3")
    1348                      .dwattr DW$141, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1349                      .dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1350                      .dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1351              DW$142  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1352                      .dwattr DW$142, DW_AT_name("GPIOA4"), DW_AT_symbol_name("_GPIOA4")
    1353                      .dwattr DW$142, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1354                      .dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1355                      .dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1356              DW$143  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1357                      .dwattr DW$143, DW_AT_name("GPIOA5"), DW_AT_symbol_name("_GPIOA5")
    1358                      .dwattr DW$143, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1359                      .dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1360                      .dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1361              DW$144  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1362                      .dwattr DW$144, DW_AT_name("GPIOA6"), DW_AT_symbol_name("_GPIOA6")
    1363                      .dwattr DW$144, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1364                      .dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1365                      .dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1366              DW$145  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1367                      .dwattr DW$145, DW_AT_name("GPIOA7"), DW_AT_symbol_name("_GPIOA7")
    1368                      .dwattr DW$145, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1369                      .dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1370                      .dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1371              DW$146  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1372                      .dwattr DW$146, DW_AT_name("GPIOA8"), DW_AT_symbol_name("_GPIOA8")
    1373                      .dwattr DW$146, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1374                      .dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1375                      .dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1376              DW$147  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1377                      .dwattr DW$147, DW_AT_name("GPIOA9"), DW_AT_symbol_name("_GPIOA9")
    1378                      .dwattr DW$147, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1379                      .dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1380                      .dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1381              DW$148  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1382                      .dwattr DW$148, DW_AT_name("GPIOA10"), DW_AT_symbol_name("_GPIOA10")
    1383                      .dwattr DW$148, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1384                      .dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1385                      .dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1386              DW$149  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1387                      .dwattr DW$149, DW_AT_name("GPIOA11"), DW_AT_symbol_name("_GPIOA11")
    1388                      .dwattr DW$149, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:45 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Max7301.asm PAGE   27

    1389                      .dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1390                      .dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1391              DW$150  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1392                      .dwattr DW$150, DW_AT_name("GPIOA12"), DW_AT_symbol_name("_GPIOA12")
    1393                      .dwattr DW$150, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1394                      .dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1395                      .dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1396              DW$151  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1397                      .dwattr DW$151, DW_AT_name("GPIOA13"), DW_AT_symbol_name("_GPIOA13")
    1398                      .dwattr DW$151, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1399                      .dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1400                      .dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1401              DW$152  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1402                      .dwattr DW$152, DW_AT_name("GPIOA14"), DW_AT_symbol_name("_GPIOA14")
    1403                      .dwattr DW$152, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1404                      .dwattr DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1405                      .dwattr DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1406              DW$153  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1407                      .dwattr DW$153, DW_AT_name("GPIOA15"), DW_AT_symbol_name("_GPIOA15")
    1408                      .dwattr DW$153, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1409                      .dwattr DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1410                      .dwattr DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1411                      .dwendtag DW$T$22
    1412              
    1413              
    1414              DW$T$24 .dwtag  DW_TAG_structure_type
    1415                      .dwattr DW$T$24, DW_AT_name("GPACLEAR_BITS")
    1416                      .dwattr DW$T$24, DW_AT_byte_size(0x01)
    1417              DW$154  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1418                      .dwattr DW$154, DW_AT_name("GPIOA0"), DW_AT_symbol_name("_GPIOA0")
    1419                      .dwattr DW$154, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1420                      .dwattr DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1421                      .dwattr DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1422              DW$155  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1423                      .dwattr DW$155, DW_AT_name("GPIOA1"), DW_AT_symbol_name("_GPIOA1")
    1424                      .dwattr DW$155, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1425                      .dwattr DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1426                      .dwattr DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1427              DW$156  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1428                      .dwattr DW$156, DW_AT_name("GPIOA2"), DW_AT_symbol_name("_GPIOA2")
    1429                      .dwattr DW$156, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1430                      .dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1431                      .dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1432              DW$157  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1433                      .dwattr DW$157, DW_AT_name("GPIOA3"), DW_AT_symbol_name("_GPIOA3")
    1434                      .dwattr DW$157, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1435                      .dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1436                      .dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1437              DW$158  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1438                      .dwattr DW$158, DW_AT_name("GPIOA4"), DW_AT_symbol_name("_GPIOA4")
    1439                      .dwattr DW$158, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1440                      .dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1441                      .dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1442              DW$159  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1443                      .dwattr DW$159, DW_AT_name("GPIOA5"), DW_AT_symbol_name("_GPIOA5")
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:45 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Max7301.asm PAGE   28

    1444                      .dwattr DW$159, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1445                      .dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1446                      .dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1447              DW$160  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1448                      .dwattr DW$160, DW_AT_name("GPIOA6"), DW_AT_symbol_name("_GPIOA6")
    1449                      .dwattr DW$160, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1450                      .dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1451                      .dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1452              DW$161  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1453                      .dwattr DW$161, DW_AT_name("GPIOA7"), DW_AT_symbol_name("_GPIOA7")
    1454                      .dwattr DW$161, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1455                      .dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1456                      .dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1457              DW$162  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1458                      .dwattr DW$162, DW_AT_name("GPIOA8"), DW_AT_symbol_name("_GPIOA8")
    1459                      .dwattr DW$162, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1460                      .dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1461                      .dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1462              DW$163  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1463                      .dwattr DW$163, DW_AT_name("GPIOA9"), DW_AT_symbol_name("_GPIOA9")
    1464                      .dwattr DW$163, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1465                      .dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1466                      .dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1467              DW$164  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1468                      .dwattr DW$164, DW_AT_name("GPIOA10"), DW_AT_symbol_name("_GPIOA10")
    1469                      .dwattr DW$164, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1470                      .dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1471                      .dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1472              DW$165  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1473                      .dwattr DW$165, DW_AT_name("GPIOA11"), DW_AT_symbol_name("_GPIOA11")
    1474                      .dwattr DW$165, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1475                      .dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1476                      .dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1477              DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1478                      .dwattr DW$166, DW_AT_name("GPIOA12"), DW_AT_symbol_name("_GPIOA12")
    1479                      .dwattr DW$166, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1480                      .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1481                      .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1482              DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1483                      .dwattr DW$167, DW_AT_name("GPIOA13"), DW_AT_symbol_name("_GPIOA13")
    1484                      .dwattr DW$167, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1485                      .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1486                      .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1487              DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1488                      .dwattr DW$168, DW_AT_name("GPIOA14"), DW_AT_symbol_name("_GPIOA14")
    1489                      .dwattr DW$168, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1490                      .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1491                      .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1492              DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1493                      .dwattr DW$169, DW_AT_name("GPIOA15"), DW_AT_symbol_name("_GPIOA15")
    1494                      .dwattr DW$169, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1495                      .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1496                      .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1497                      .dwendtag DW$T$24
    1498              
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:45 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Max7301.asm PAGE   29

    1499              
    1500              DW$T$26 .dwtag  DW_TAG_structure_type
    1501                      .dwattr DW$T$26, DW_AT_name("GPATOGGLE_BITS")
    1502                      .dwattr DW$T$26, DW_AT_byte_size(0x01)
    1503              DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1504                      .dwattr DW$170, DW_AT_name("GPIOA0"), DW_AT_symbol_name("_GPIOA0")
    1505                      .dwattr DW$170, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1506                      .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1507                      .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1508              DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1509                      .dwattr DW$171, DW_AT_name("GPIOA1"), DW_AT_symbol_name("_GPIOA1")
    1510                      .dwattr DW$171, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1511                      .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1512                      .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1513              DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1514                      .dwattr DW$172, DW_AT_name("GPIOA2"), DW_AT_symbol_name("_GPIOA2")
    1515                      .dwattr DW$172, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1516                      .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1517                      .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1518              DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1519                      .dwattr DW$173, DW_AT_name("GPIOA3"), DW_AT_symbol_name("_GPIOA3")
    1520                      .dwattr DW$173, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1521                      .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1522                      .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1523              DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1524                      .dwattr DW$174, DW_AT_name("GPIOA4"), DW_AT_symbol_name("_GPIOA4")
    1525                      .dwattr DW$174, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1526                      .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1527                      .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1528              DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1529                      .dwattr DW$175, DW_AT_name("GPIOA5"), DW_AT_symbol_name("_GPIOA5")
    1530                      .dwattr DW$175, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1531                      .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1532                      .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1533              DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1534                      .dwattr DW$176, DW_AT_name("GPIOA6"), DW_AT_symbol_name("_GPIOA6")
    1535                      .dwattr DW$176, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1536                      .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1537                      .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1538              DW$177  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1539                      .dwattr DW$177, DW_AT_name("GPIOA7"), DW_AT_symbol_name("_GPIOA7")
    1540                      .dwattr DW$177, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1541                      .dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1542                      .dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1543              DW$178  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1544                      .dwattr DW$178, DW_AT_name("GPIOA8"), DW_AT_symbol_name("_GPIOA8")
    1545                      .dwattr DW$178, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1546                      .dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1547                      .dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1548              DW$179  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1549                      .dwattr DW$179, DW_AT_name("GPIOA9"), DW_AT_symbol_name("_GPIOA9")
    1550                      .dwattr DW$179, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1551                      .dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1552                      .dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1553              DW$180  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:45 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Max7301.asm PAGE   30

    1554                      .dwattr DW$180, DW_AT_name("GPIOA10"), DW_AT_symbol_name("_GPIOA10")
    1555                      .dwattr DW$180, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1556                      .dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1557                      .dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1558              DW$181  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1559                      .dwattr DW$181, DW_AT_name("GPIOA11"), DW_AT_symbol_name("_GPIOA11")
    1560                      .dwattr DW$181, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1561                      .dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1562                      .dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1563              DW$182  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1564                      .dwattr DW$182, DW_AT_name("GPIOA12"), DW_AT_symbol_name("_GPIOA12")
    1565                      .dwattr DW$182, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1566                      .dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1567                      .dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1568              DW$183  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1569                      .dwattr DW$183, DW_AT_name("GPIOA13"), DW_AT_symbol_name("_GPIOA13")
    1570                      .dwattr DW$183, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1571                      .dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1572                      .dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1573              DW$184  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1574                      .dwattr DW$184, DW_AT_name("GPIOA14"), DW_AT_symbol_name("_GPIOA14")
    1575                      .dwattr DW$184, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1576                      .dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1577                      .dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1578              DW$185  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1579                      .dwattr DW$185, DW_AT_name("GPIOA15"), DW_AT_symbol_name("_GPIOA15")
    1580                      .dwattr DW$185, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1581                      .dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1582                      .dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1583                      .dwendtag DW$T$26
    1584              
    1585              
    1586              DW$T$28 .dwtag  DW_TAG_structure_type
    1587                      .dwattr DW$T$28, DW_AT_name("GPBDAT_BITS")
    1588                      .dwattr DW$T$28, DW_AT_byte_size(0x01)
    1589              DW$186  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1590                      .dwattr DW$186, DW_AT_name("GPIOB0"), DW_AT_symbol_name("_GPIOB0")
    1591                      .dwattr DW$186, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1592                      .dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1593                      .dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1594              DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1595                      .dwattr DW$187, DW_AT_name("GPIOB1"), DW_AT_symbol_name("_GPIOB1")
    1596                      .dwattr DW$187, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1597                      .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1598                      .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1599              DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1600                      .dwattr DW$188, DW_AT_name("GPIOB2"), DW_AT_symbol_name("_GPIOB2")
    1601                      .dwattr DW$188, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1602                      .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1603                      .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1604              DW$189  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1605                      .dwattr DW$189, DW_AT_name("GPIOB3"), DW_AT_symbol_name("_GPIOB3")
    1606                      .dwattr DW$189, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1607                      .dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1608                      .dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:45 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Max7301.asm PAGE   31

    1609              DW$190  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1610                      .dwattr DW$190, DW_AT_name("GPIOB4"), DW_AT_symbol_name("_GPIOB4")
    1611                      .dwattr DW$190, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1612                      .dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1613                      .dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1614              DW$191  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1615                      .dwattr DW$191, DW_AT_name("GPIOB5"), DW_AT_symbol_name("_GPIOB5")
    1616                      .dwattr DW$191, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1617                      .dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1618                      .dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1619              DW$192  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1620                      .dwattr DW$192, DW_AT_name("GPIOB6"), DW_AT_symbol_name("_GPIOB6")
    1621                      .dwattr DW$192, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1622                      .dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1623                      .dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1624              DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1625                      .dwattr DW$193, DW_AT_name("GPIOB7"), DW_AT_symbol_name("_GPIOB7")
    1626                      .dwattr DW$193, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1627                      .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1628                      .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1629              DW$194  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1630                      .dwattr DW$194, DW_AT_name("GPIOB8"), DW_AT_symbol_name("_GPIOB8")
    1631                      .dwattr DW$194, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1632                      .dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1633                      .dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1634              DW$195  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1635                      .dwattr DW$195, DW_AT_name("GPIOB9"), DW_AT_symbol_name("_GPIOB9")
    1636                      .dwattr DW$195, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1637                      .dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1638                      .dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1639              DW$196  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1640                      .dwattr DW$196, DW_AT_name("GPIOB10"), DW_AT_symbol_name("_GPIOB10")
    1641                      .dwattr DW$196, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1642                      .dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1643                      .dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1644              DW$197  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1645                      .dwattr DW$197, DW_AT_name("GPIOB11"), DW_AT_symbol_name("_GPIOB11")
    1646                      .dwattr DW$197, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1647                      .dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1648                      .dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1649              DW$198  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1650                      .dwattr DW$198, DW_AT_name("GPIOB12"), DW_AT_symbol_name("_GPIOB12")
    1651                      .dwattr DW$198, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1652                      .dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1653                      .dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1654              DW$199  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1655                      .dwattr DW$199, DW_AT_name("GPIOB13"), DW_AT_symbol_name("_GPIOB13")
    1656                      .dwattr DW$199, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1657                      .dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1658                      .dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1659              DW$200  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1660                      .dwattr DW$200, DW_AT_name("GPIOB14"), DW_AT_symbol_name("_GPIOB14")
    1661                      .dwattr DW$200, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1662                      .dwattr DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1663                      .dwattr DW$200, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:45 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Max7301.asm PAGE   32

    1664              DW$201  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1665                      .dwattr DW$201, DW_AT_name("GPIOB15"), DW_AT_symbol_name("_GPIOB15")
    1666                      .dwattr DW$201, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1667                      .dwattr DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1668                      .dwattr DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1669                      .dwendtag DW$T$28
    1670              
    1671              
    1672              DW$T$30 .dwtag  DW_TAG_structure_type
    1673                      .dwattr DW$T$30, DW_AT_name("GPBSET_BITS")
    1674                      .dwattr DW$T$30, DW_AT_byte_size(0x01)
    1675              DW$202  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1676                      .dwattr DW$202, DW_AT_name("GPIOB0"), DW_AT_symbol_name("_GPIOB0")
    1677                      .dwattr DW$202, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1678                      .dwattr DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1679                      .dwattr DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1680              DW$203  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1681                      .dwattr DW$203, DW_AT_name("GPIOB1"), DW_AT_symbol_name("_GPIOB1")
    1682                      .dwattr DW$203, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1683                      .dwattr DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1684                      .dwattr DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1685              DW$204  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1686                      .dwattr DW$204, DW_AT_name("GPIOB2"), DW_AT_symbol_name("_GPIOB2")
    1687                      .dwattr DW$204, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1688                      .dwattr DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1689                      .dwattr DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1690              DW$205  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1691                      .dwattr DW$205, DW_AT_name("GPIOB3"), DW_AT_symbol_name("_GPIOB3")
    1692                      .dwattr DW$205, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1693                      .dwattr DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1694                      .dwattr DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1695              DW$206  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1696                      .dwattr DW$206, DW_AT_name("GPIOB4"), DW_AT_symbol_name("_GPIOB4")
    1697                      .dwattr DW$206, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1698                      .dwattr DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1699                      .dwattr DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1700              DW$207  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1701                      .dwattr DW$207, DW_AT_name("GPIOB5"), DW_AT_symbol_name("_GPIOB5")
    1702                      .dwattr DW$207, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1703                      .dwattr DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1704                      .dwattr DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1705              DW$208  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1706                      .dwattr DW$208, DW_AT_name("GPIOB6"), DW_AT_symbol_name("_GPIOB6")
    1707                      .dwattr DW$208, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1708                      .dwattr DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1709                      .dwattr DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1710              DW$209  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1711                      .dwattr DW$209, DW_AT_name("GPIOB7"), DW_AT_symbol_name("_GPIOB7")
    1712                      .dwattr DW$209, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1713                      .dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1714                      .dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1715              DW$210  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1716                      .dwattr DW$210, DW_AT_name("GPIOB8"), DW_AT_symbol_name("_GPIOB8")
    1717                      .dwattr DW$210, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1718                      .dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:45 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Max7301.asm PAGE   33

    1719                      .dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1720              DW$211  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1721                      .dwattr DW$211, DW_AT_name("GPIOB9"), DW_AT_symbol_name("_GPIOB9")
    1722                      .dwattr DW$211, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1723                      .dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1724                      .dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1725              DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1726                      .dwattr DW$212, DW_AT_name("GPIOB10"), DW_AT_symbol_name("_GPIOB10")
    1727                      .dwattr DW$212, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1728                      .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1729                      .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1730              DW$213  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1731                      .dwattr DW$213, DW_AT_name("GPIOB11"), DW_AT_symbol_name("_GPIOB11")
    1732                      .dwattr DW$213, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1733                      .dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1734                      .dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
    1735              DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1736                      .dwattr DW$214, DW_AT_name("GPIOB12"), DW_AT_symbol_name("_GPIOB12")
    1737                      .dwattr DW$214, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1738                      .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1739                      .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    1740              DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1741                      .dwattr DW$215, DW_AT_name("GPIOB13"), DW_AT_symbol_name("_GPIOB13")
    1742                      .dwattr DW$215, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1743                      .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1744                      .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    1745              DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1746                      .dwattr DW$216, DW_AT_name("GPIOB14"), DW_AT_symbol_name("_GPIOB14")
    1747                      .dwattr DW$216, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1748                      .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1749                      .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    1750              DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1751                      .dwattr DW$217, DW_AT_name("GPIOB15"), DW_AT_symbol_name("_GPIOB15")
    1752                      .dwattr DW$217, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1753                      .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1754                      .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    1755                      .dwendtag DW$T$30
    1756              
    1757              
    1758              DW$T$32 .dwtag  DW_TAG_structure_type
    1759                      .dwattr DW$T$32, DW_AT_name("GPBCLEAR_BITS")
    1760                      .dwattr DW$T$32, DW_AT_byte_size(0x01)
    1761              DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1762                      .dwattr DW$218, DW_AT_name("GPIOB0"), DW_AT_symbol_name("_GPIOB0")
    1763                      .dwattr DW$218, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1764                      .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1765                      .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    1766              DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1767                      .dwattr DW$219, DW_AT_name("GPIOB1"), DW_AT_symbol_name("_GPIOB1")
    1768                      .dwattr DW$219, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1769                      .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1770                      .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    1771              DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1772                      .dwattr DW$220, DW_AT_name("GPIOB2"), DW_AT_symbol_name("_GPIOB2")
    1773                      .dwattr DW$220, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:45 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Max7301.asm PAGE   34

    1774                      .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1775                      .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
    1776              DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1777                      .dwattr DW$221, DW_AT_name("GPIOB3"), DW_AT_symbol_name("_GPIOB3")
    1778                      .dwattr DW$221, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1779                      .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1780                      .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    1781              DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1782                      .dwattr DW$222, DW_AT_name("GPIOB4"), DW_AT_symbol_name("_GPIOB4")
    1783                      .dwattr DW$222, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1784                      .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1785                      .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
    1786              DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1787                      .dwattr DW$223, DW_AT_name("GPIOB5"), DW_AT_symbol_name("_GPIOB5")
    1788                      .dwattr DW$223, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1789                      .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1790                      .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    1791              DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1792                      .dwattr DW$224, DW_AT_name("GPIOB6"), DW_AT_symbol_name("_GPIOB6")
    1793                      .dwattr DW$224, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1794                      .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1795                      .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    1796              DW$225  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1797                      .dwattr DW$225, DW_AT_name("GPIOB7"), DW_AT_symbol_name("_GPIOB7")
    1798                      .dwattr DW$225, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1799                      .dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1800                      .dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
    1801              DW$226  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1802                      .dwattr DW$226, DW_AT_name("GPIOB8"), DW_AT_symbol_name("_GPIOB8")
    1803                      .dwattr DW$226, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1804                      .dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1805                      .dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
    1806              DW$227  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1807                      .dwattr DW$227, DW_AT_name("GPIOB9"), DW_AT_symbol_name("_GPIOB9")
    1808                      .dwattr DW$227, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1809                      .dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1810                      .dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
    1811              DW$228  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1812                      .dwattr DW$228, DW_AT_name("GPIOB10"), DW_AT_symbol_name("_GPIOB10")
    1813                      .dwattr DW$228, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1814                      .dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1815                      .dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
    1816              DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1817                      .dwattr DW$229, DW_AT_name("GPIOB11"), DW_AT_symbol_name("_GPIOB11")
    1818                      .dwattr DW$229, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1819                      .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1820                      .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
    1821              DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1822                      .dwattr DW$230, DW_AT_name("GPIOB12"), DW_AT_symbol_name("_GPIOB12")
    1823                      .dwattr DW$230, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1824                      .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1825                      .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    1826              DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1827                      .dwattr DW$231, DW_AT_name("GPIOB13"), DW_AT_symbol_name("_GPIOB13")
    1828                      .dwattr DW$231, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:45 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Max7301.asm PAGE   35

    1829                      .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1830                      .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    1831              DW$232  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1832                      .dwattr DW$232, DW_AT_name("GPIOB14"), DW_AT_symbol_name("_GPIOB14")
    1833                      .dwattr DW$232, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1834                      .dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1835                      .dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
    1836              DW$233  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1837                      .dwattr DW$233, DW_AT_name("GPIOB15"), DW_AT_symbol_name("_GPIOB15")
    1838                      .dwattr DW$233, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1839                      .dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1840                      .dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
    1841                      .dwendtag DW$T$32
    1842              
    1843              
    1844              DW$T$34 .dwtag  DW_TAG_structure_type
    1845                      .dwattr DW$T$34, DW_AT_name("GPBTOGGLE_BITS")
    1846                      .dwattr DW$T$34, DW_AT_byte_size(0x01)
    1847              DW$234  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1848                      .dwattr DW$234, DW_AT_name("GPIOB0"), DW_AT_symbol_name("_GPIOB0")
    1849                      .dwattr DW$234, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1850                      .dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1851                      .dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
    1852              DW$235  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1853                      .dwattr DW$235, DW_AT_name("GPIOB1"), DW_AT_symbol_name("_GPIOB1")
    1854                      .dwattr DW$235, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1855                      .dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1856                      .dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
    1857              DW$236  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1858                      .dwattr DW$236, DW_AT_name("GPIOB2"), DW_AT_symbol_name("_GPIOB2")
    1859                      .dwattr DW$236, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1860                      .dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1861                      .dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
    1862              DW$237  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1863                      .dwattr DW$237, DW_AT_name("GPIOB3"), DW_AT_symbol_name("_GPIOB3")
    1864                      .dwattr DW$237, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1865                      .dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1866                      .dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
    1867              DW$238  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1868                      .dwattr DW$238, DW_AT_name("GPIOB4"), DW_AT_symbol_name("_GPIOB4")
    1869                      .dwattr DW$238, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1870                      .dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1871                      .dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
    1872              DW$239  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1873                      .dwattr DW$239, DW_AT_name("GPIOB5"), DW_AT_symbol_name("_GPIOB5")
    1874                      .dwattr DW$239, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1875                      .dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1876                      .dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
    1877              DW$240  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1878                      .dwattr DW$240, DW_AT_name("GPIOB6"), DW_AT_symbol_name("_GPIOB6")
    1879                      .dwattr DW$240, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1880                      .dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1881                      .dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
    1882              DW$241  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1883                      .dwattr DW$241, DW_AT_name("GPIOB7"), DW_AT_symbol_name("_GPIOB7")
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:45 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/Max7301.asm PAGE   36

