TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:55 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/PieVect_nonBIOS.asm PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.0 *
       3              ;* Date/Time created: Tue Sep 16 13:11:54 2008                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("PieVect_nonBIOS.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.0 Copyright (c) 1996-2005 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("T3CINT_ISR"), DW_AT_symbol_name("_T3CINT_ISR")
      15                      .dwattr DW$1, DW_AT_declaration(0x01)
      16                      .dwattr DW$1, DW_AT_external(0x01)
      17              

     402 000000fa 0000!         .field          _rsvd_ISR,32            ; _PieVectTableInit._rsvd12_6 @ 4000
         000000fb 0000 
     403 000000fc 0000!         .field          _rsvd_ISR,32            ; _PieVectTableInit._rsvd12_7 @ 4032
         000000fd 0000 
     404 000000fe 0000!         .field          _rsvd_ISR,32            ; _PieVectTableInit._rsvd12_8 @ 4064
         000000ff 0000 
     405              
     406              DW$66   .dwtag  DW_TAG_variable, DW_AT_name("PieVectTableInit"), DW_AT_symbol_name("_PieVectTableInit")
     407                      .dwattr DW$66, DW_AT_location[DW_OP_addr _PieVectTableInit]
     408                      .dwattr DW$66, DW_AT_type(*DW$T$23)
     409                      .dwattr DW$66, DW_AT_external(0x01)
     410              ;       C:\CCStudio_v3.1\C2000\cgtools\bin\ac2000.exe -@C:\DOCUME~1\iadevait\LOCALS~1\Temp\TI2202 
     411              ;***************************************************************
     412              ;* UNDEFINED EXTERNAL REFERENCES                               *
     413              ;***************************************************************
     414                      .global _T3CINT_ISR
     415                      .global _T3UFINT_ISR
     416                      .global _CMP6INT_ISR
     417                      .global _T3PINT_ISR
     418                      .global _T4CINT_ISR
     419                      .global _T4UFINT_ISR
     420                      .global _T3OFINT_ISR
     421                      .global _T4PINT_ISR
     422                      .global _T2OFINT_ISR
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:55 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/PieVect_nonBIOS.asm PAGE   11

     423                      .global _CAPINT1_ISR
     424                      .global _T2CINT_ISR
     425                      .global _T2UFINT_ISR
     426                      .global _CMP4INT_ISR
     427                      .global _CMP5INT_ISR
     428                      .global _CAPINT2_ISR
     429                      .global _CAPINT3_ISR
     430                      .global _SCIRXINTB_ISR
     431                      .global _SCITXINTB_ISR
     432                      .global _SCIRXINTA_ISR
     433                      .global _SCITXINTA_ISR
     434                      .global _PIE_RESERVED
     435                      .global _rsvd_ISR
     436                      .global _ECAN0INTA_ISR
     437                      .global _ECAN1INTA_ISR
     438                      .global _CAPINT5_ISR
     439                      .global _CAPINT6_ISR
     440                      .global _T4OFINT_ISR
     441                      .global _CAPINT4_ISR
     442                      .global _MRINTA_ISR
     443                      .global _MXINTA_ISR
     444                      .global _SPIRXINTA_ISR
     445                      .global _SPITXINTA_ISR
     446                      .global _USER5_ISR
     447                      .global _USER6_ISR
     448                      .global _USER3_ISR
     449                      .global _USER4_ISR
     450                      .global _USER9_ISR
     451                      .global _USER10_ISR
     452                      .global _USER7_ISR
     453                      .global _USER8_ISR
     454                      .global _RTOSINT_ISR
     455                      .global _EMUINT_ISR
     456                      .global _INT14_ISR
     457                      .global _DATALOG_ISR
     458                      .global _USER1_ISR
     459                      .global _USER2_ISR
     460                      .global _NMI_ISR
     461                      .global _ILLEGAL_ISR
     462                      .global _CMP2INT_ISR
     463                      .global _CMP3INT_ISR
     464                      .global _WAKEINT_ISR
     465                      .global _CMP1INT_ISR
     466                      .global _T1UFINT_ISR
     467                      .global _T2PINT_ISR
     468                      .global _T1PINT_ISR
     469                      .global _T1CINT_ISR
     470                      .global _PDPINTA_ISR
     471                      .global _PDPINTB_ISR
     472                      .global _USER11_ISR
     473                      .global _USER12_ISR
     474                      .global _ADCINT_ISR
     475                      .global _TINT0_ISR
     476                      .global _XINT1_ISR
     477                      .global _XINT2_ISR
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:55 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/PieVect_nonBIOS.asm PAGE   12

     478                      .global _INT13_ISR
     479              
     480              ;***************************************************************
     481              ;* TYPE INFORMATION                                            *
     482              ;***************************************************************
     483              
     484              DW$T$19 .dwtag  DW_TAG_subroutine_type
     485                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
     486              DW$67   .dwtag  DW_TAG_far_type
     487                      .dwattr DW$67, DW_AT_type(*DW$T$22)
     488              DW$T$23 .dwtag  DW_TAG_const_type
     489                      .dwattr DW$T$23, DW_AT_type(*DW$67)
     490              
     491              DW$T$22 .dwtag  DW_TAG_structure_type
     492                      .dwattr DW$T$22, DW_AT_name("PIE_VECT_TABLE")
     493                      .dwattr DW$T$22, DW_AT_byte_size(0x100)
     494              DW$68   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     495                      .dwattr DW$68, DW_AT_name("PIE1_RESERVED"), DW_AT_symbol_name("_PIE1_RESERVED")
     496                      .dwattr DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     497                      .dwattr DW$68, DW_AT_accessibility(DW_ACCESS_public)
     498              DW$69   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     499                      .dwattr DW$69, DW_AT_name("PIE2_RESERVED"), DW_AT_symbol_name("_PIE2_RESERVED")
     500                      .dwattr DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     501                      .dwattr DW$69, DW_AT_accessibility(DW_ACCESS_public)
     502              DW$70   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     503                      .dwattr DW$70, DW_AT_name("PIE3_RESERVED"), DW_AT_symbol_name("_PIE3_RESERVED")
     504                      .dwattr DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     505                      .dwattr DW$70, DW_AT_accessibility(DW_ACCESS_public)
     506              DW$71   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     507                      .dwattr DW$71, DW_AT_name("PIE4_RESERVED"), DW_AT_symbol_name("_PIE4_RESERVED")
     508                      .dwattr DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     509                      .dwattr DW$71, DW_AT_accessibility(DW_ACCESS_public)
     510              DW$72   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     511                      .dwattr DW$72, DW_AT_name("PIE5_RESERVED"), DW_AT_symbol_name("_PIE5_RESERVED")
     512                      .dwattr DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     513                      .dwattr DW$72, DW_AT_accessibility(DW_ACCESS_public)
     514              DW$73   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     515                      .dwattr DW$73, DW_AT_name("PIE6_RESERVED"), DW_AT_symbol_name("_PIE6_RESERVED")
     516                      .dwattr DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     517                      .dwattr DW$73, DW_AT_accessibility(DW_ACCESS_public)
     518              DW$74   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     519                      .dwattr DW$74, DW_AT_name("PIE7_RESERVED"), DW_AT_symbol_name("_PIE7_RESERVED")
     520                      .dwattr DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     521                      .dwattr DW$74, DW_AT_accessibility(DW_ACCESS_public)
     522              DW$75   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     523                      .dwattr DW$75, DW_AT_name("PIE8_RESERVED"), DW_AT_symbol_name("_PIE8_RESERVED")
     524                      .dwattr DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     525                      .dwattr DW$75, DW_AT_accessibility(DW_ACCESS_public)
     526              DW$76   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     527                      .dwattr DW$76, DW_AT_name("PIE9_RESERVED"), DW_AT_symbol_name("_PIE9_RESERVED")
     528                      .dwattr DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     529                      .dwattr DW$76, DW_AT_accessibility(DW_ACCESS_public)
     530              DW$77   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     531                      .dwattr DW$77, DW_AT_name("PIE10_RESERVED"), DW_AT_symbol_name("_PIE10_RESERVED")
     532                      .dwattr DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:55 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/PieVect_nonBIOS.asm PAGE   13

     533                      .dwattr DW$77, DW_AT_accessibility(DW_ACCESS_public)
     534              DW$78   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     535                      .dwattr DW$78, DW_AT_name("PIE11_RESERVED"), DW_AT_symbol_name("_PIE11_RESERVED")
     536                      .dwattr DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     537                      .dwattr DW$78, DW_AT_accessibility(DW_ACCESS_public)
     538              DW$79   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     539                      .dwattr DW$79, DW_AT_name("PIE12_RESERVED"), DW_AT_symbol_name("_PIE12_RESERVED")
     540                      .dwattr DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     541                      .dwattr DW$79, DW_AT_accessibility(DW_ACCESS_public)
     542              DW$80   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     543                      .dwattr DW$80, DW_AT_name("PIE13_RESERVED"), DW_AT_symbol_name("_PIE13_RESERVED")
     544                      .dwattr DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     545                      .dwattr DW$80, DW_AT_accessibility(DW_ACCESS_public)
     546              DW$81   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     547                      .dwattr DW$81, DW_AT_name("XINT13"), DW_AT_symbol_name("_XINT13")
     548                      .dwattr DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     549                      .dwattr DW$81, DW_AT_accessibility(DW_ACCESS_public)
     550              DW$82   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     551                      .dwattr DW$82, DW_AT_name("TINT2"), DW_AT_symbol_name("_TINT2")
     552                      .dwattr DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     553                      .dwattr DW$82, DW_AT_accessibility(DW_ACCESS_public)
     554              DW$83   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     555                      .dwattr DW$83, DW_AT_name("DATALOG"), DW_AT_symbol_name("_DATALOG")
     556                      .dwattr DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     557                      .dwattr DW$83, DW_AT_accessibility(DW_ACCESS_public)
     558              DW$84   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     559                      .dwattr DW$84, DW_AT_name("RTOSINT"), DW_AT_symbol_name("_RTOSINT")
     560                      .dwattr DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     561                      .dwattr DW$84, DW_AT_accessibility(DW_ACCESS_public)
     562              DW$85   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     563                      .dwattr DW$85, DW_AT_name("EMUINT"), DW_AT_symbol_name("_EMUINT")
     564                      .dwattr DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
     565                      .dwattr DW$85, DW_AT_accessibility(DW_ACCESS_public)
     566              DW$86   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     567                      .dwattr DW$86, DW_AT_name("XNMI"), DW_AT_symbol_name("_XNMI")
     568                      .dwattr DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     569                      .dwattr DW$86, DW_AT_accessibility(DW_ACCESS_public)
     570              DW$87   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     571                      .dwattr DW$87, DW_AT_name("ILLEGAL"), DW_AT_symbol_name("_ILLEGAL")
     572                      .dwattr DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
     573                      .dwattr DW$87, DW_AT_accessibility(DW_ACCESS_public)
     574              DW$88   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     575                      .dwattr DW$88, DW_AT_name("USER1"), DW_AT_symbol_name("_USER1")
     576                      .dwattr DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     577                      .dwattr DW$88, DW_AT_accessibility(DW_ACCESS_public)
     578              DW$89   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     579                      .dwattr DW$89, DW_AT_name("USER2"), DW_AT_symbol_name("_USER2")
     580                      .dwattr DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
     581                      .dwattr DW$89, DW_AT_accessibility(DW_ACCESS_public)
     582              DW$90   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     583                      .dwattr DW$90, DW_AT_name("USER3"), DW_AT_symbol_name("_USER3")
     584                      .dwattr DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     585                      .dwattr DW$90, DW_AT_accessibility(DW_ACCESS_public)
     586              DW$91   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     587                      .dwattr DW$91, DW_AT_name("USER4"), DW_AT_symbol_name("_USER4")
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:55 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/PieVect_nonBIOS.asm PAGE   14

     588                      .dwattr DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
     589                      .dwattr DW$91, DW_AT_accessibility(DW_ACCESS_public)
     590              DW$92   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     591                      .dwattr DW$92, DW_AT_name("USER5"), DW_AT_symbol_name("_USER5")
     592                      .dwattr DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     593                      .dwattr DW$92, DW_AT_accessibility(DW_ACCESS_public)
     594              DW$93   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     595                      .dwattr DW$93, DW_AT_name("USER6"), DW_AT_symbol_name("_USER6")
     596                      .dwattr DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
     597                      .dwattr DW$93, DW_AT_accessibility(DW_ACCESS_public)
     598              DW$94   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     599                      .dwattr DW$94, DW_AT_name("USER7"), DW_AT_symbol_name("_USER7")
     600                      .dwattr DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     601                      .dwattr DW$94, DW_AT_accessibility(DW_ACCESS_public)
     602              DW$95   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     603                      .dwattr DW$95, DW_AT_name("USER8"), DW_AT_symbol_name("_USER8")
     604                      .dwattr DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
     605                      .dwattr DW$95, DW_AT_accessibility(DW_ACCESS_public)
     606              DW$96   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     607                      .dwattr DW$96, DW_AT_name("USER9"), DW_AT_symbol_name("_USER9")
     608                      .dwattr DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     609                      .dwattr DW$96, DW_AT_accessibility(DW_ACCESS_public)
     610              DW$97   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     611                      .dwattr DW$97, DW_AT_name("USER10"), DW_AT_symbol_name("_USER10")
     612                      .dwattr DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
     613                      .dwattr DW$97, DW_AT_accessibility(DW_ACCESS_public)
     614              DW$98   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     615                      .dwattr DW$98, DW_AT_name("USER11"), DW_AT_symbol_name("_USER11")
     616                      .dwattr DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     617                      .dwattr DW$98, DW_AT_accessibility(DW_ACCESS_public)
     618              DW$99   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     619                      .dwattr DW$99, DW_AT_name("USER12"), DW_AT_symbol_name("_USER12")
     620                      .dwattr DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
     621                      .dwattr DW$99, DW_AT_accessibility(DW_ACCESS_public)
     622              DW$100  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     623                      .dwattr DW$100, DW_AT_name("PDPINTA"), DW_AT_symbol_name("_PDPINTA")
     624                      .dwattr DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     625                      .dwattr DW$100, DW_AT_accessibility(DW_ACCESS_public)
     626              DW$101  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     627                      .dwattr DW$101, DW_AT_name("PDPINTB"), DW_AT_symbol_name("_PDPINTB")
     628                      .dwattr DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
     629                      .dwattr DW$101, DW_AT_accessibility(DW_ACCESS_public)
     630              DW$102  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     631                      .dwattr DW$102, DW_AT_name("rsvd1_3"), DW_AT_symbol_name("_rsvd1_3")
     632                      .dwattr DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     633                      .dwattr DW$102, DW_AT_accessibility(DW_ACCESS_public)
     634              DW$103  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     635                      .dwattr DW$103, DW_AT_name("XINT1"), DW_AT_symbol_name("_XINT1")
     636                      .dwattr DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
     637                      .dwattr DW$103, DW_AT_accessibility(DW_ACCESS_public)
     638              DW$104  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     639                      .dwattr DW$104, DW_AT_name("XINT2"), DW_AT_symbol_name("_XINT2")
     640                      .dwattr DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     641                      .dwattr DW$104, DW_AT_accessibility(DW_ACCESS_public)
     642              DW$105  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:55 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/PieVect_nonBIOS.asm PAGE   15

     643                      .dwattr DW$105, DW_AT_name("ADCINT"), DW_AT_symbol_name("_ADCINT")
     644                      .dwattr DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
     645                      .dwattr DW$105, DW_AT_accessibility(DW_ACCESS_public)
     646              DW$106  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     647                      .dwattr DW$106, DW_AT_name("TINT0"), DW_AT_symbol_name("_TINT0")
     648                      .dwattr DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
     649                      .dwattr DW$106, DW_AT_accessibility(DW_ACCESS_public)
     650              DW$107  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     651                      .dwattr DW$107, DW_AT_name("WAKEINT"), DW_AT_symbol_name("_WAKEINT")
     652                      .dwattr DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
     653                      .dwattr DW$107, DW_AT_accessibility(DW_ACCESS_public)
     654              DW$108  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     655                      .dwattr DW$108, DW_AT_name("CMP1INT"), DW_AT_symbol_name("_CMP1INT")
     656                      .dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
     657                      .dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
     658              DW$109  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     659                      .dwattr DW$109, DW_AT_name("CMP2INT"), DW_AT_symbol_name("_CMP2INT")
     660                      .dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
     661                      .dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
     662              DW$110  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     663                      .dwattr DW$110, DW_AT_name("CMP3INT"), DW_AT_symbol_name("_CMP3INT")
     664                      .dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
     665                      .dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
     666              DW$111  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     667                      .dwattr DW$111, DW_AT_name("T1PINT"), DW_AT_symbol_name("_T1PINT")
     668                      .dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
     669                      .dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
     670              DW$112  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     671                      .dwattr DW$112, DW_AT_name("T1CINT"), DW_AT_symbol_name("_T1CINT")
     672                      .dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
     673                      .dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
     674              DW$113  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     675                      .dwattr DW$113, DW_AT_name("T1UFINT"), DW_AT_symbol_name("_T1UFINT")
     676                      .dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
     677                      .dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
     678              DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     679                      .dwattr DW$114, DW_AT_name("T1OFINT"), DW_AT_symbol_name("_T1OFINT")
     680                      .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
     681                      .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
     682              DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     683                      .dwattr DW$115, DW_AT_name("rsvd2_8"), DW_AT_symbol_name("_rsvd2_8")
     684                      .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
     685                      .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
     686              DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     687                      .dwattr DW$116, DW_AT_name("T2PINT"), DW_AT_symbol_name("_T2PINT")
     688                      .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
     689                      .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
     690              DW$117  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     691                      .dwattr DW$117, DW_AT_name("T2CINT"), DW_AT_symbol_name("_T2CINT")
     692                      .dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
     693                      .dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
     694              DW$118  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     695                      .dwattr DW$118, DW_AT_name("T2UFINT"), DW_AT_symbol_name("_T2UFINT")
     696                      .dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
     697                      .dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:55 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/PieVect_nonBIOS.asm PAGE   16

     698              DW$119  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     699                      .dwattr DW$119, DW_AT_name("T2OFINT"), DW_AT_symbol_name("_T2OFINT")
     700                      .dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
     701                      .dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
     702              DW$120  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     703                      .dwattr DW$120, DW_AT_name("CAPINT1"), DW_AT_symbol_name("_CAPINT1")
     704                      .dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
     705                      .dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
     706              DW$121  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     707                      .dwattr DW$121, DW_AT_name("CAPINT2"), DW_AT_symbol_name("_CAPINT2")
     708                      .dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
     709                      .dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
     710              DW$122  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     711                      .dwattr DW$122, DW_AT_name("CAPINT3"), DW_AT_symbol_name("_CAPINT3")
     712                      .dwattr DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
     713                      .dwattr DW$122, DW_AT_accessibility(DW_ACCESS_public)
     714              DW$123  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     715                      .dwattr DW$123, DW_AT_name("rsvd3_8"), DW_AT_symbol_name("_rsvd3_8")
     716                      .dwattr DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
     717                      .dwattr DW$123, DW_AT_accessibility(DW_ACCESS_public)
     718              DW$124  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     719                      .dwattr DW$124, DW_AT_name("CMP4INT"), DW_AT_symbol_name("_CMP4INT")
     720                      .dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
     721                      .dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
     722              DW$125  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     723                      .dwattr DW$125, DW_AT_name("CMP5INT"), DW_AT_symbol_name("_CMP5INT")
     724                      .dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
     725                      .dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
     726              DW$126  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     727                      .dwattr DW$126, DW_AT_name("CMP6INT"), DW_AT_symbol_name("_CMP6INT")
     728                      .dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
     729                      .dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
     730              DW$127  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     731                      .dwattr DW$127, DW_AT_name("T3PINT"), DW_AT_symbol_name("_T3PINT")
     732                      .dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
     733                      .dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
     734              DW$128  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     735                      .dwattr DW$128, DW_AT_name("T3CINT"), DW_AT_symbol_name("_T3CINT")
     736                      .dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
     737                      .dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
     738              DW$129  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     739                      .dwattr DW$129, DW_AT_name("T3UFINT"), DW_AT_symbol_name("_T3UFINT")
     740                      .dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
     741                      .dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
     742              DW$130  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     743                      .dwattr DW$130, DW_AT_name("T3OFINT"), DW_AT_symbol_name("_T3OFINT")
     744                      .dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
     745                      .dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
     746              DW$131  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     747                      .dwattr DW$131, DW_AT_name("rsvd4_8"), DW_AT_symbol_name("_rsvd4_8")
     748                      .dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
     749                      .dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
     750              DW$132  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     751                      .dwattr DW$132, DW_AT_name("T4PINT"), DW_AT_symbol_name("_T4PINT")
     752                      .dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:55 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/PieVect_nonBIOS.asm PAGE   17

     753                      .dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
     754              DW$133  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     755                      .dwattr DW$133, DW_AT_name("T4CINT"), DW_AT_symbol_name("_T4CINT")
     756                      .dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
     757                      .dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
     758              DW$134  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     759                      .dwattr DW$134, DW_AT_name("T4UFINT"), DW_AT_symbol_name("_T4UFINT")
     760                      .dwattr DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
     761                      .dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
     762              DW$135  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     763                      .dwattr DW$135, DW_AT_name("T4OFINT"), DW_AT_symbol_name("_T4OFINT")
     764                      .dwattr DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
     765                      .dwattr DW$135, DW_AT_accessibility(DW_ACCESS_public)
     766              DW$136  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     767                      .dwattr DW$136, DW_AT_name("CAPINT4"), DW_AT_symbol_name("_CAPINT4")
     768                      .dwattr DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
     769                      .dwattr DW$136, DW_AT_accessibility(DW_ACCESS_public)
     770              DW$137  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     771                      .dwattr DW$137, DW_AT_name("CAPINT5"), DW_AT_symbol_name("_CAPINT5")
     772                      .dwattr DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
     773                      .dwattr DW$137, DW_AT_accessibility(DW_ACCESS_public)
     774              DW$138  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     775                      .dwattr DW$138, DW_AT_name("CAPINT6"), DW_AT_symbol_name("_CAPINT6")
     776                      .dwattr DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
     777                      .dwattr DW$138, DW_AT_accessibility(DW_ACCESS_public)
     778              DW$139  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     779                      .dwattr DW$139, DW_AT_name("rsvd5_8"), DW_AT_symbol_name("_rsvd5_8")
     780                      .dwattr DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
     781                      .dwattr DW$139, DW_AT_accessibility(DW_ACCESS_public)
     782              DW$140  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     783                      .dwattr DW$140, DW_AT_name("SPIRXINTA"), DW_AT_symbol_name("_SPIRXINTA")
     784                      .dwattr DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
     785                      .dwattr DW$140, DW_AT_accessibility(DW_ACCESS_public)
     786              DW$141  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     787                      .dwattr DW$141, DW_AT_name("SPITXINTA"), DW_AT_symbol_name("_SPITXINTA")
     788                      .dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
     789                      .dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
     790              DW$142  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     791                      .dwattr DW$142, DW_AT_name("rsvd6_3"), DW_AT_symbol_name("_rsvd6_3")
     792                      .dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
     793                      .dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
     794              DW$143  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     795                      .dwattr DW$143, DW_AT_name("rsvd6_4"), DW_AT_symbol_name("_rsvd6_4")
     796                      .dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
     797                      .dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
     798              DW$144  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     799                      .dwattr DW$144, DW_AT_name("MRINTA"), DW_AT_symbol_name("_MRINTA")
     800                      .dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
     801                      .dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
     802              DW$145  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     803                      .dwattr DW$145, DW_AT_name("MXINTA"), DW_AT_symbol_name("_MXINTA")
     804                      .dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
     805                      .dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
     806              DW$146  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     807                      .dwattr DW$146, DW_AT_name("rsvd6_7"), DW_AT_symbol_name("_rsvd6_7")
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:55 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/PieVect_nonBIOS.asm PAGE   18

     808                      .dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
     809                      .dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
     810              DW$147  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     811                      .dwattr DW$147, DW_AT_name("rsvd6_8"), DW_AT_symbol_name("_rsvd6_8")
     812                      .dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
     813                      .dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
     814              DW$148  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     815                      .dwattr DW$148, DW_AT_name("rsvd7_1"), DW_AT_symbol_name("_rsvd7_1")
     816                      .dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
     817                      .dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
     818              DW$149  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     819                      .dwattr DW$149, DW_AT_name("rsvd7_2"), DW_AT_symbol_name("_rsvd7_2")
     820                      .dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
     821                      .dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
     822              DW$150  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     823                      .dwattr DW$150, DW_AT_name("rsvd7_3"), DW_AT_symbol_name("_rsvd7_3")
     824                      .dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
     825                      .dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
     826              DW$151  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     827                      .dwattr DW$151, DW_AT_name("rsvd7_4"), DW_AT_symbol_name("_rsvd7_4")
     828                      .dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
     829                      .dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
     830              DW$152  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     831                      .dwattr DW$152, DW_AT_name("rsvd7_5"), DW_AT_symbol_name("_rsvd7_5")
     832                      .dwattr DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
     833                      .dwattr DW$152, DW_AT_accessibility(DW_ACCESS_public)
     834              DW$153  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     835                      .dwattr DW$153, DW_AT_name("rsvd7_6"), DW_AT_symbol_name("_rsvd7_6")
     836                      .dwattr DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
     837                      .dwattr DW$153, DW_AT_accessibility(DW_ACCESS_public)
     838              DW$154  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     839                      .dwattr DW$154, DW_AT_name("rsvd7_7"), DW_AT_symbol_name("_rsvd7_7")
     840                      .dwattr DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
     841                      .dwattr DW$154, DW_AT_accessibility(DW_ACCESS_public)
     842              DW$155  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     843                      .dwattr DW$155, DW_AT_name("rsvd7_8"), DW_AT_symbol_name("_rsvd7_8")
     844                      .dwattr DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
     845                      .dwattr DW$155, DW_AT_accessibility(DW_ACCESS_public)
     846              DW$156  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     847                      .dwattr DW$156, DW_AT_name("rsvd8_1"), DW_AT_symbol_name("_rsvd8_1")
     848                      .dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
     849                      .dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
     850              DW$157  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     851                      .dwattr DW$157, DW_AT_name("rsvd8_2"), DW_AT_symbol_name("_rsvd8_2")
     852                      .dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
     853                      .dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
     854              DW$158  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     855                      .dwattr DW$158, DW_AT_name("rsvd8_3"), DW_AT_symbol_name("_rsvd8_3")
     856                      .dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
     857                      .dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
     858              DW$159  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     859                      .dwattr DW$159, DW_AT_name("rsvd8_4"), DW_AT_symbol_name("_rsvd8_4")
     860                      .dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
     861                      .dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
     862              DW$160  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:55 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/PieVect_nonBIOS.asm PAGE   19

     863                      .dwattr DW$160, DW_AT_name("rsvd8_5"), DW_AT_symbol_name("_rsvd8_5")
     864                      .dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
     865                      .dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
     866              DW$161  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     867                      .dwattr DW$161, DW_AT_name("rsvd8_6"), DW_AT_symbol_name("_rsvd8_6")
     868                      .dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
     869                      .dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
     870              DW$162  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     871                      .dwattr DW$162, DW_AT_name("rsvd8_7"), DW_AT_symbol_name("_rsvd8_7")
     872                      .dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
     873                      .dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
     874              DW$163  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     875                      .dwattr DW$163, DW_AT_name("rsvd8_8"), DW_AT_symbol_name("_rsvd8_8")
     876                      .dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xbe]
     877                      .dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
     878              DW$164  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     879                      .dwattr DW$164, DW_AT_name("RXAINT"), DW_AT_symbol_name("_RXAINT")
     880                      .dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
     881                      .dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
     882              DW$165  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     883                      .dwattr DW$165, DW_AT_name("TXAINT"), DW_AT_symbol_name("_TXAINT")
     884                      .dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
     885                      .dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
     886              DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     887                      .dwattr DW$166, DW_AT_name("RXBINT"), DW_AT_symbol_name("_RXBINT")
     888                      .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
     889                      .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
     890              DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     891                      .dwattr DW$167, DW_AT_name("TXBINT"), DW_AT_symbol_name("_TXBINT")
     892                      .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
     893                      .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
     894              DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     895                      .dwattr DW$168, DW_AT_name("ECAN0INTA"), DW_AT_symbol_name("_ECAN0INTA")
     896                      .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
     897                      .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
     898              DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     899                      .dwattr DW$169, DW_AT_name("ECAN1INTA"), DW_AT_symbol_name("_ECAN1INTA")
     900                      .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
     901                      .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
     902              DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     903                      .dwattr DW$170, DW_AT_name("rsvd9_7"), DW_AT_symbol_name("_rsvd9_7")
     904                      .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
     905                      .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
     906              DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     907                      .dwattr DW$171, DW_AT_name("rsvd9_8"), DW_AT_symbol_name("_rsvd9_8")
     908                      .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
     909                      .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
     910              DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     911                      .dwattr DW$172, DW_AT_name("rsvd10_1"), DW_AT_symbol_name("_rsvd10_1")
     912                      .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
     913                      .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
     914              DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     915                      .dwattr DW$173, DW_AT_name("rsvd10_2"), DW_AT_symbol_name("_rsvd10_2")
     916                      .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
     917                      .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:55 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/PieVect_nonBIOS.asm PAGE   20

     918              DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     919                      .dwattr DW$174, DW_AT_name("rsvd10_3"), DW_AT_symbol_name("_rsvd10_3")
     920                      .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
     921                      .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
     922              DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     923                      .dwattr DW$175, DW_AT_name("rsvd10_4"), DW_AT_symbol_name("_rsvd10_4")
     924                      .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
     925                      .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
     926              DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     927                      .dwattr DW$176, DW_AT_name("rsvd10_5"), DW_AT_symbol_name("_rsvd10_5")
     928                      .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
     929                      .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
     930              DW$177  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     931                      .dwattr DW$177, DW_AT_name("rsvd10_6"), DW_AT_symbol_name("_rsvd10_6")
     932                      .dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
     933                      .dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
     934              DW$178  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     935                      .dwattr DW$178, DW_AT_name("rsvd10_7"), DW_AT_symbol_name("_rsvd10_7")
     936                      .dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
     937                      .dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
     938              DW$179  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     939                      .dwattr DW$179, DW_AT_name("rsvd10_8"), DW_AT_symbol_name("_rsvd10_8")
     940                      .dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
     941                      .dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
     942              DW$180  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     943                      .dwattr DW$180, DW_AT_name("rsvd11_1"), DW_AT_symbol_name("_rsvd11_1")
     944                      .dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
     945                      .dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
     946              DW$181  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     947                      .dwattr DW$181, DW_AT_name("rsvd11_2"), DW_AT_symbol_name("_rsvd11_2")
     948                      .dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
     949                      .dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
     950              DW$182  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     951                      .dwattr DW$182, DW_AT_name("rsvd11_3"), DW_AT_symbol_name("_rsvd11_3")
     952                      .dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
     953                      .dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
     954              DW$183  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     955                      .dwattr DW$183, DW_AT_name("rsvd11_4"), DW_AT_symbol_name("_rsvd11_4")
     956                      .dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
     957                      .dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
     958              DW$184  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     959                      .dwattr DW$184, DW_AT_name("rsvd11_5"), DW_AT_symbol_name("_rsvd11_5")
     960                      .dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
     961                      .dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
     962              DW$185  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     963                      .dwattr DW$185, DW_AT_name("rsvd11_6"), DW_AT_symbol_name("_rsvd11_6")
     964                      .dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
     965                      .dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
     966              DW$186  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     967                      .dwattr DW$186, DW_AT_name("rsvd11_7"), DW_AT_symbol_name("_rsvd11_7")
     968                      .dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
     969                      .dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
     970              DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     971                      .dwattr DW$187, DW_AT_name("rsvd11_8"), DW_AT_symbol_name("_rsvd11_8")
     972                      .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:55 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/PieVect_nonBIOS.asm PAGE   21

     973                      .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
     974              DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     975                      .dwattr DW$188, DW_AT_name("rsvd12_1"), DW_AT_symbol_name("_rsvd12_1")
     976                      .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
     977                      .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
     978              DW$189  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     979                      .dwattr DW$189, DW_AT_name("rsvd12_2"), DW_AT_symbol_name("_rsvd12_2")
     980                      .dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
     981                      .dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
     982              DW$190  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     983                      .dwattr DW$190, DW_AT_name("rsvd12_3"), DW_AT_symbol_name("_rsvd12_3")
     984                      .dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
     985                      .dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
     986              DW$191  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     987                      .dwattr DW$191, DW_AT_name("rsvd12_4"), DW_AT_symbol_name("_rsvd12_4")
     988                      .dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
     989                      .dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
     990              DW$192  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     991                      .dwattr DW$192, DW_AT_name("rsvd12_5"), DW_AT_symbol_name("_rsvd12_5")
     992                      .dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
     993                      .dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
     994              DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     995                      .dwattr DW$193, DW_AT_name("rsvd12_6"), DW_AT_symbol_name("_rsvd12_6")
     996                      .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
     997                      .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
     998              DW$194  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     999                      .dwattr DW$194, DW_AT_name("rsvd12_7"), DW_AT_symbol_name("_rsvd12_7")
    1000                      .dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    1001                      .dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1002              DW$195  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    1003                      .dwattr DW$195, DW_AT_name("rsvd12_8"), DW_AT_symbol_name("_rsvd12_8")
    1004                      .dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    1005                      .dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1006                      .dwendtag DW$T$22
    1007              
    1008              DW$T$21 .dwtag  DW_TAG_typedef, DW_AT_name("PINT"), DW_AT_type(*DW$T$20)
    1009                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    1010              DW$T$20 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$19)
    1011                      .dwattr DW$T$20, DW_AT_address_class(0x16)
    1012              
    1013              
    1014              ;***************************************************************
    1015              ;* DWARF CIE ENTRIES                                           *
    1016              ;***************************************************************
    1017              
    1018              DW$CIE  .dwcie 1, 40
    1019                      .dwcfa  0x0c, 20, 0
    1020                      .dwcfa  0x07, 0
    1021                      .dwcfa  0x07, 1
    1022                      .dwcfa  0x07, 2
    1023                      .dwcfa  0x07, 3
    1024                      .dwcfa  0x07, 4
    1025                      .dwcfa  0x07, 5
    1026                      .dwcfa  0x07, 6
    1027                      .dwcfa  0x07, 7
TMS320C2000 COFF Assembler PC v4.1.0 Tue Sep 16 13:11:55 2008

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
G:/VMS/Tsunami/100025092/Firmware/spra958f/eZdspF2812/projects/Debug/PieVect_nonBIOS.asm PAGE   22

    1028                      .dwcfa  0x07, 8
    1029                      .dwcfa  0x07, 9
    1030                      .dwcfa  0x07, 10
    1031                      .dwcfa  0x07, 11
    1032                      .dwcfa  0x07, 12
    1033                      .dwcfa  0x07, 13
    1034                      .dwcfa  0x07, 14
    1035                      .dwcfa  0x07, 15
    1036                      .dwcfa  0x07, 16
    1037                      .dwcfa  0x07, 17
    1038                      .dwcfa  0x07, 18
    1039                      .dwcfa  0x07, 19
    1040                      .dwcfa  0x07, 20
    1041                      .dwcfa  0x07, 21
    1042                      .dwcfa  0x07, 22
    1043                      .dwcfa  0x07, 23
    1044                      .dwcfa  0x07, 24
    1045                      .dwcfa  0x07, 25
    1046                      .dwcfa  0x07, 26
    1047                      .dwcfa  0x07, 27
    1048                      .dwcfa  0x07, 28
    1049                      .dwcfa  0x07, 29
    1050                      .dwcfa  0x07, 30
    1051                      .dwcfa  0x07, 31
    1052                      .dwcfa  0x07, 32
    1053                      .dwcfa  0x07, 33
    1054                      .dwcfa  0x07, 34
    1055                      .dwcfa  0x07, 35
    1056                      .dwcfa  0x07, 36
    1057                      .dwcfa  0x07, 37
    1058                      .dwcfa  0x07, 38
    1059                      .dwcfa  0x07, 39
    1060                      .dwcfa  0x07, 40
    1061              
    1062              ;***************************************************************
    1063              ;* DWARF REGISTER MAP                                          *
    1064              ;***************************************************************
    1065              
    1066              DW$196  .dwtag  DW_TAG_assign_register, DW_AT_name("AL")
    1067                      .dwattr DW$196, DW_AT_location[DW_OP_reg0]
    1068              DW$197  .dwtag  DW_TAG_assign_register, DW_AT_name("AH")
    1069                      .dwattr DW$197, DW_AT_location[DW_OP_reg1]
    1070              DW$198  .dwtag  DW_TAG_assign_register, DW_AT_name("PL")
    1071                      .dwattr DW$198, DW_AT_location[DW_OP_reg2]
    1072              DW$199  .dwtag  DW_TAG_assign_register, DW_AT_name("PH")
