TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Spi.asm          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Tue Apr  8 10:05:53 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=softlib --hll_source=on --mem_model:code
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/repo/jabil2025/gpb/gpb_project_v3/Spi.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\repo\jabil2025\gpb\gpb_project_v3\projects\example_nonBIOS_ram\D
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("SpiaRegs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SpiaRegs")

     623                      .dwattr $C$DW$24, DW_AT_TI_max_frame_size(-2)
     624                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Spi.c",line 221,column 1,is_stmt,address _SpiTxNot
     625              
     626                      .dwfde $C$DW$CIE, _SpiTxNotReady
     627              ;----------------------------------------------------------------------
     628              ; 220 | Uint16 SpiTxNotReady(void)                                             
     629              ;----------------------------------------------------------------------
     630              
     631              ;***************************************************************
     632              ;* FNAME: _SpiTxNotReady                FR SIZE:   0           *
     633              ;*                                                             *
     634              ;* FUNCTION ENVIRONMENT                                        *
     635              ;*                                                             *
     636              ;* FUNCTION PROPERTIES                                         *
     637              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     638              ;***************************************************************
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Spi.asm          PAGE   13

     639              
     640 0000006e       _SpiTxNotReady:
     641                      .dwcfi  cfa_offset, -2
     642                      .dwcfi  save_reg_to_mem, 26, 0
     643                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Spi.c",line 222,column 2,is_stmt,isa 0
     644              ;----------------------------------------------------------------------
     645              ; 222 | if(SpiaRegs.SPISTS.bit.BUFFULL_FLAG)                                   
     646              ;----------------------------------------------------------------------
     647 0000006e 761F!         MOVW      DP,#_SpiaRegs+2       ; [CPU_ARAU] 
         0000006f 0000 
     648 00000070 4502!         TBIT      @$BLOCKED(_SpiaRegs)+2,#5 ; [CPU_ALU] |222| 
     649 00000071 6C03          B         $C$L15,NTC            ; [CPU_ALU] |222| 
     650                      ; branchcc occurs ; [] |222| 
     651                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Spi.c",line 223,column 3,is_stmt,isa 0
     652              ;----------------------------------------------------------------------
     653              ; 223 | return 1;                                                              
     654              ; 224 | else                                                                   
     655              ;----------------------------------------------------------------------
     656 00000072 9A01          MOVB      AL,#1                 ; [CPU_ALU] |223| 
     657 00000073 6F02          B         $C$L16,UNC            ; [CPU_ALU] |223| 
     658                      ; branch occurs ; [] |223| 
     659 00000074       $C$L15:    
     660                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Spi.c",line 225,column 3,is_stmt,isa 0
     661              ;----------------------------------------------------------------------
     662              ; 225 | return 0;                                                              
     663              ;----------------------------------------------------------------------
     664 00000074 9A00          MOVB      AL,#0                 ; [CPU_ALU] |225| 
     665 00000075       $C$L16:    
     666                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Spi.c",line 227,column 1,is_stmt,isa 0
     667              $C$DW$25        .dwtag  DW_TAG_TI_branch
     668                      .dwattr $C$DW$25, DW_AT_low_pc(0x00)
     669                      .dwattr $C$DW$25, DW_AT_TI_return
     670              
     671 00000075 0006          LRETR     ; [CPU_ALU] 
     672                      ; return occurs ; [] 
     673                      .dwattr $C$DW$24, DW_AT_TI_end_file("C:/repo/jabil2025/gpb/gpb_project_v3/Spi.c")
     674                      .dwattr $C$DW$24, DW_AT_TI_end_line(0xe3)
     675                      .dwattr $C$DW$24, DW_AT_TI_end_column(0x01)
     676                      .dwendentry
     677                      .dwendtag $C$DW$24
     678              
     679              ;**************************************************************
     680              ;* UNDEFINED EXTERNAL REFERENCES                              *
     681              ;**************************************************************
     682                      .global _SpiaRegs
     683              
     684              ;***************************************************************
     685              ;* TYPE INFORMATION                                            *
     686              ;***************************************************************
     687              
     688              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     689                      .dwattr $C$DW$T$20, DW_AT_name("SPICCR_BITS")
     690                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     691              $C$DW$26        .dwtag  DW_TAG_member
     692                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Spi.asm          PAGE   14

     693                      .dwattr $C$DW$26, DW_AT_name("SPICHAR")
     694                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_SPICHAR")
     695                      .dwattr $C$DW$26, DW_AT_bit_offset(0x0c)
     696                      .dwattr $C$DW$26, DW_AT_bit_size(0x04)
     697                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     698                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     699              
     700              $C$DW$27        .dwtag  DW_TAG_member
     701                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     702                      .dwattr $C$DW$27, DW_AT_name("SPILBK")
     703                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_SPILBK")
     704                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0b)
     705                      .dwattr $C$DW$27, DW_AT_bit_size(0x01)
     706                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     707                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     708              
     709              $C$DW$28        .dwtag  DW_TAG_member
     710                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     711                      .dwattr $C$DW$28, DW_AT_name("rsvd1")
     712                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_rsvd1")
     713                      .dwattr $C$DW$28, DW_AT_bit_offset(0x0a)
     714                      .dwattr $C$DW$28, DW_AT_bit_size(0x01)
     715                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     716                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     717              
     718              $C$DW$29        .dwtag  DW_TAG_member
     719                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     720                      .dwattr $C$DW$29, DW_AT_name("CLKPOLARITY")
     721                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_CLKPOLARITY")
     722                      .dwattr $C$DW$29, DW_AT_bit_offset(0x09)
     723                      .dwattr $C$DW$29, DW_AT_bit_size(0x01)
     724                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     725                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     726              
     727              $C$DW$30        .dwtag  DW_TAG_member
     728                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     729                      .dwattr $C$DW$30, DW_AT_name("SPISWRESET")
     730                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_SPISWRESET")
     731                      .dwattr $C$DW$30, DW_AT_bit_offset(0x08)
     732                      .dwattr $C$DW$30, DW_AT_bit_size(0x01)
     733                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     734                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     735              
     736              $C$DW$31        .dwtag  DW_TAG_member
     737                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     738                      .dwattr $C$DW$31, DW_AT_name("rsvd2")
     739                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_rsvd2")
     740                      .dwattr $C$DW$31, DW_AT_bit_offset(0x00)
     741                      .dwattr $C$DW$31, DW_AT_bit_size(0x08)
     742                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     743                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     744              
     745                      .dwendtag $C$DW$T$20
     746              
     747              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Spi.asm          PAGE   15

     748              $C$DW$T$21      .dwtag  DW_TAG_union_type
     749                      .dwattr $C$DW$T$21, DW_AT_name("SPICCR_REG")
     750                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     751              $C$DW$32        .dwtag  DW_TAG_member
     752                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     753                      .dwattr $C$DW$32, DW_AT_name("all")
     754                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_all")
     755                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     756                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     757              
     758              $C$DW$33        .dwtag  DW_TAG_member
     759                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$20)
     760                      .dwattr $C$DW$33, DW_AT_name("bit")
     761                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_bit")
     762                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     763                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     764              
     765                      .dwendtag $C$DW$T$21
     766              
     767              
     768              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     769                      .dwattr $C$DW$T$22, DW_AT_name("SPICTL_BITS")
     770                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     771              $C$DW$34        .dwtag  DW_TAG_member
     772                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     773                      .dwattr $C$DW$34, DW_AT_name("SPIINTENA")
     774                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_SPIINTENA")
     775                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0f)
     776                      .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     777                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     778                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     779              
     780              $C$DW$35        .dwtag  DW_TAG_member
     781                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     782                      .dwattr $C$DW$35, DW_AT_name("TALK")
     783                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_TALK")
     784                      .dwattr $C$DW$35, DW_AT_bit_offset(0x0e)
     785                      .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     786                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     787                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     788              
     789              $C$DW$36        .dwtag  DW_TAG_member
     790                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     791                      .dwattr $C$DW$36, DW_AT_name("MASTER_SLAVE")
     792                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_MASTER_SLAVE")
     793                      .dwattr $C$DW$36, DW_AT_bit_offset(0x0d)
     794                      .dwattr $C$DW$36, DW_AT_bit_size(0x01)
     795                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     796                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     797              
     798              $C$DW$37        .dwtag  DW_TAG_member
     799                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     800                      .dwattr $C$DW$37, DW_AT_name("CLK_PHASE")
     801                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_CLK_PHASE")
     802                      .dwattr $C$DW$37, DW_AT_bit_offset(0x0c)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Spi.asm          PAGE   16

     803                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     804                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     805                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     806              
     807              $C$DW$38        .dwtag  DW_TAG_member
     808                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     809                      .dwattr $C$DW$38, DW_AT_name("OVERRUNINTENA")
     810                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_OVERRUNINTENA")
     811                      .dwattr $C$DW$38, DW_AT_bit_offset(0x0b)
     812                      .dwattr $C$DW$38, DW_AT_bit_size(0x01)
     813                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     814                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     815              
     816              $C$DW$39        .dwtag  DW_TAG_member
     817                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     818                      .dwattr $C$DW$39, DW_AT_name("rsvd")
     819                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_rsvd")
     820                      .dwattr $C$DW$39, DW_AT_bit_offset(0x00)
     821                      .dwattr $C$DW$39, DW_AT_bit_size(0x0b)
     822                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     823                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     824              
     825                      .dwendtag $C$DW$T$22
     826              
     827              
     828              $C$DW$T$23      .dwtag  DW_TAG_union_type
     829                      .dwattr $C$DW$T$23, DW_AT_name("SPICTL_REG")
     830                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     831              $C$DW$40        .dwtag  DW_TAG_member
     832                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     833                      .dwattr $C$DW$40, DW_AT_name("all")
     834                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_all")
     835                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     836                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     837              
     838              $C$DW$41        .dwtag  DW_TAG_member
     839                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$22)
     840                      .dwattr $C$DW$41, DW_AT_name("bit")
     841                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_bit")
     842                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     843                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     844              
     845                      .dwendtag $C$DW$T$23
     846              
     847              
     848              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     849                      .dwattr $C$DW$T$24, DW_AT_name("SPIFFCT_BITS")
     850                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     851              $C$DW$42        .dwtag  DW_TAG_member
     852                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     853                      .dwattr $C$DW$42, DW_AT_name("TXDLY")
     854                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_TXDLY")
     855                      .dwattr $C$DW$42, DW_AT_bit_offset(0x08)
     856                      .dwattr $C$DW$42, DW_AT_bit_size(0x08)
     857                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Spi.asm          PAGE   17

     858                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     859              
     860              $C$DW$43        .dwtag  DW_TAG_member
     861                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     862                      .dwattr $C$DW$43, DW_AT_name("rsvd")
     863                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_rsvd")
     864                      .dwattr $C$DW$43, DW_AT_bit_offset(0x00)
     865                      .dwattr $C$DW$43, DW_AT_bit_size(0x08)
     866                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     867                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     868              
     869                      .dwendtag $C$DW$T$24
     870              
     871              
     872              $C$DW$T$25      .dwtag  DW_TAG_union_type
     873                      .dwattr $C$DW$T$25, DW_AT_name("SPIFFCT_REG")
     874                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     875              $C$DW$44        .dwtag  DW_TAG_member
     876                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     877                      .dwattr $C$DW$44, DW_AT_name("all")
     878                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_all")
     879                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     880                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     881              
     882              $C$DW$45        .dwtag  DW_TAG_member
     883                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$24)
     884                      .dwattr $C$DW$45, DW_AT_name("bit")
     885                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_bit")
     886                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     887                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     888              
     889                      .dwendtag $C$DW$T$25
     890              
     891              
     892              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     893                      .dwattr $C$DW$T$26, DW_AT_name("SPIFFRX_BITS")
     894                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     895              $C$DW$46        .dwtag  DW_TAG_member
     896                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     897                      .dwattr $C$DW$46, DW_AT_name("RXFFIL")
     898                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_RXFFIL")
     899                      .dwattr $C$DW$46, DW_AT_bit_offset(0x0b)
     900                      .dwattr $C$DW$46, DW_AT_bit_size(0x05)
     901                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     902                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     903              
     904              $C$DW$47        .dwtag  DW_TAG_member
     905                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     906                      .dwattr $C$DW$47, DW_AT_name("RXFFIENA")
     907                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_RXFFIENA")
     908                      .dwattr $C$DW$47, DW_AT_bit_offset(0x0a)
     909                      .dwattr $C$DW$47, DW_AT_bit_size(0x01)
     910                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     911                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     912              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Spi.asm          PAGE   18

     913              $C$DW$48        .dwtag  DW_TAG_member
     914                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     915                      .dwattr $C$DW$48, DW_AT_name("RXFFINTCLR")
     916                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_RXFFINTCLR")
     917                      .dwattr $C$DW$48, DW_AT_bit_offset(0x09)
     918                      .dwattr $C$DW$48, DW_AT_bit_size(0x01)
     919                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     920                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     921              
     922              $C$DW$49        .dwtag  DW_TAG_member
     923                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     924                      .dwattr $C$DW$49, DW_AT_name("RXFFINT")
     925                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_RXFFINT")
     926                      .dwattr $C$DW$49, DW_AT_bit_offset(0x08)
     927                      .dwattr $C$DW$49, DW_AT_bit_size(0x01)
     928                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     929                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     930              
     931              $C$DW$50        .dwtag  DW_TAG_member
     932                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     933                      .dwattr $C$DW$50, DW_AT_name("RXFFST")
     934                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_RXFFST")
     935                      .dwattr $C$DW$50, DW_AT_bit_offset(0x03)
     936                      .dwattr $C$DW$50, DW_AT_bit_size(0x05)
     937                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     938                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     939              
     940              $C$DW$51        .dwtag  DW_TAG_member
     941                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     942                      .dwattr $C$DW$51, DW_AT_name("RXFIFORESET")
     943                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_RXFIFORESET")
     944                      .dwattr $C$DW$51, DW_AT_bit_offset(0x02)
     945                      .dwattr $C$DW$51, DW_AT_bit_size(0x01)
     946                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     947                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     948              
     949              $C$DW$52        .dwtag  DW_TAG_member
     950                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     951                      .dwattr $C$DW$52, DW_AT_name("RXFFOVFCLR")
     952                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_RXFFOVFCLR")
     953                      .dwattr $C$DW$52, DW_AT_bit_offset(0x01)
     954                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
     955                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     956                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     957              
     958              $C$DW$53        .dwtag  DW_TAG_member
     959                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     960                      .dwattr $C$DW$53, DW_AT_name("RXFFOVF")
     961                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_RXFFOVF")
     962                      .dwattr $C$DW$53, DW_AT_bit_offset(0x00)
     963                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
     964                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     965                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     966              
     967                      .dwendtag $C$DW$T$26
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Spi.asm          PAGE   19

     968              
     969              
     970              $C$DW$T$27      .dwtag  DW_TAG_union_type
     971                      .dwattr $C$DW$T$27, DW_AT_name("SPIFFRX_REG")
     972                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     973              $C$DW$54        .dwtag  DW_TAG_member
     974                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     975                      .dwattr $C$DW$54, DW_AT_name("all")
     976                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_all")
     977                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     978                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     979              
     980              $C$DW$55        .dwtag  DW_TAG_member
     981                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$26)
     982                      .dwattr $C$DW$55, DW_AT_name("bit")
     983                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_bit")
     984                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     985                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     986              
     987                      .dwendtag $C$DW$T$27
     988              
     989              
     990              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     991                      .dwattr $C$DW$T$28, DW_AT_name("SPIFFTX_BITS")
     992                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     993              $C$DW$56        .dwtag  DW_TAG_member
     994                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     995                      .dwattr $C$DW$56, DW_AT_name("TXFFIL")
     996                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_TXFFIL")
     997                      .dwattr $C$DW$56, DW_AT_bit_offset(0x0b)
     998                      .dwattr $C$DW$56, DW_AT_bit_size(0x05)
     999                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1000                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1001              
    1002              $C$DW$57        .dwtag  DW_TAG_member
    1003                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
    1004                      .dwattr $C$DW$57, DW_AT_name("TXFFIENA")
    1005                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_TXFFIENA")
    1006                      .dwattr $C$DW$57, DW_AT_bit_offset(0x0a)
    1007                      .dwattr $C$DW$57, DW_AT_bit_size(0x01)
    1008                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1009                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1010              
    1011              $C$DW$58        .dwtag  DW_TAG_member
    1012                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
    1013                      .dwattr $C$DW$58, DW_AT_name("TXFFINTCLR")
    1014                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_TXFFINTCLR")
    1015                      .dwattr $C$DW$58, DW_AT_bit_offset(0x09)
    1016                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
    1017                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1018                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1019              
    1020              $C$DW$59        .dwtag  DW_TAG_member
    1021                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
    1022                      .dwattr $C$DW$59, DW_AT_name("TXFFINT")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Spi.asm          PAGE   20

    1023                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_TXFFINT")
    1024                      .dwattr $C$DW$59, DW_AT_bit_offset(0x08)
    1025                      .dwattr $C$DW$59, DW_AT_bit_size(0x01)
    1026                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1027                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1028              
    1029              $C$DW$60        .dwtag  DW_TAG_member
    1030                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
    1031                      .dwattr $C$DW$60, DW_AT_name("TXFFST")
    1032                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_TXFFST")
    1033                      .dwattr $C$DW$60, DW_AT_bit_offset(0x03)
    1034                      .dwattr $C$DW$60, DW_AT_bit_size(0x05)
    1035                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1036                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1037              
    1038              $C$DW$61        .dwtag  DW_TAG_member
    1039                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
    1040                      .dwattr $C$DW$61, DW_AT_name("TXFIFO")
    1041                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_TXFIFO")
    1042                      .dwattr $C$DW$61, DW_AT_bit_offset(0x02)
    1043                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
    1044                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1045                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1046              
    1047              $C$DW$62        .dwtag  DW_TAG_member
    1048                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
    1049                      .dwattr $C$DW$62, DW_AT_name("SPIFFENA")
    1050                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_SPIFFENA")
    1051                      .dwattr $C$DW$62, DW_AT_bit_offset(0x01)
    1052                      .dwattr $C$DW$62, DW_AT_bit_size(0x01)
    1053                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1054                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1055              
    1056              $C$DW$63        .dwtag  DW_TAG_member
    1057                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
    1058                      .dwattr $C$DW$63, DW_AT_name("SPIRST")
    1059                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_SPIRST")
    1060                      .dwattr $C$DW$63, DW_AT_bit_offset(0x00)
    1061                      .dwattr $C$DW$63, DW_AT_bit_size(0x01)
    1062                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1063                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1064              
    1065                      .dwendtag $C$DW$T$28
    1066              
    1067              
    1068              $C$DW$T$29      .dwtag  DW_TAG_union_type
    1069                      .dwattr $C$DW$T$29, DW_AT_name("SPIFFTX_REG")
    1070                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1071              $C$DW$64        .dwtag  DW_TAG_member
    1072                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
    1073                      .dwattr $C$DW$64, DW_AT_name("all")
    1074                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_all")
    1075                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1076                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1077              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Spi.asm          PAGE   21

    1078              $C$DW$65        .dwtag  DW_TAG_member
    1079                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$28)
    1080                      .dwattr $C$DW$65, DW_AT_name("bit")
    1081                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_bit")
    1082                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1083                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1084              
    1085                      .dwendtag $C$DW$T$29
    1086              
    1087              
    1088              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1089                      .dwattr $C$DW$T$30, DW_AT_name("SPIPRI_BITS")
    1090                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    1091              $C$DW$66        .dwtag  DW_TAG_member
    1092                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1093                      .dwattr $C$DW$66, DW_AT_name("rsvd1")
    1094                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_rsvd1")
    1095                      .dwattr $C$DW$66, DW_AT_bit_offset(0x0c)
    1096                      .dwattr $C$DW$66, DW_AT_bit_size(0x04)
    1097                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1098                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1099              
    1100              $C$DW$67        .dwtag  DW_TAG_member
    1101                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1102                      .dwattr $C$DW$67, DW_AT_name("FREE")
    1103                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_FREE")
    1104                      .dwattr $C$DW$67, DW_AT_bit_offset(0x0b)
    1105                      .dwattr $C$DW$67, DW_AT_bit_size(0x01)
    1106                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1107                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1108              
    1109              $C$DW$68        .dwtag  DW_TAG_member
    1110                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1111                      .dwattr $C$DW$68, DW_AT_name("SOFT")
    1112                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_SOFT")
    1113                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0a)
    1114                      .dwattr $C$DW$68, DW_AT_bit_size(0x01)
    1115                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1116                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1117              
    1118              $C$DW$69        .dwtag  DW_TAG_member
    1119                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1120                      .dwattr $C$DW$69, DW_AT_name("PRIORITY")
    1121                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_PRIORITY")
    1122                      .dwattr $C$DW$69, DW_AT_bit_offset(0x09)
    1123                      .dwattr $C$DW$69, DW_AT_bit_size(0x01)
    1124                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1125                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1126              
    1127              $C$DW$70        .dwtag  DW_TAG_member
    1128                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1129                      .dwattr $C$DW$70, DW_AT_name("rsvd2")
    1130                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_rsvd2")
    1131                      .dwattr $C$DW$70, DW_AT_bit_offset(0x00)
    1132                      .dwattr $C$DW$70, DW_AT_bit_size(0x09)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Spi.asm          PAGE   22

    1133                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1134                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1135              
    1136                      .dwendtag $C$DW$T$30
    1137              
    1138              
    1139              $C$DW$T$31      .dwtag  DW_TAG_union_type
    1140                      .dwattr $C$DW$T$31, DW_AT_name("SPIPRI_REG")
    1141                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1142              $C$DW$71        .dwtag  DW_TAG_member
    1143                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1144                      .dwattr $C$DW$71, DW_AT_name("all")
    1145                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_all")
    1146                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1147                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1148              
    1149              $C$DW$72        .dwtag  DW_TAG_member
    1150                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$30)
    1151                      .dwattr $C$DW$72, DW_AT_name("bit")
    1152                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_bit")
    1153                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1154                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1155              
    1156                      .dwendtag $C$DW$T$31
    1157              
    1158              
    1159              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1160                      .dwattr $C$DW$T$32, DW_AT_name("SPISTS_BITS")
    1161                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1162              $C$DW$73        .dwtag  DW_TAG_member
    1163                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1164                      .dwattr $C$DW$73, DW_AT_name("rsvd1")
    1165                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_rsvd1")
    1166                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0b)
    1167                      .dwattr $C$DW$73, DW_AT_bit_size(0x05)
    1168                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1169                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1170              
    1171              $C$DW$74        .dwtag  DW_TAG_member
    1172                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1173                      .dwattr $C$DW$74, DW_AT_name("BUFFULL_FLAG")
    1174                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_BUFFULL_FLAG")
    1175                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0a)
    1176                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
    1177                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1178                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1179              
    1180              $C$DW$75        .dwtag  DW_TAG_member
    1181                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1182                      .dwattr $C$DW$75, DW_AT_name("INT_FLAG")
    1183                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_INT_FLAG")
    1184                      .dwattr $C$DW$75, DW_AT_bit_offset(0x09)
    1185                      .dwattr $C$DW$75, DW_AT_bit_size(0x01)
    1186                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1187                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Spi.asm          PAGE   23

    1188              
    1189              $C$DW$76        .dwtag  DW_TAG_member
    1190                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1191                      .dwattr $C$DW$76, DW_AT_name("OVERRUN_FLAG")
    1192                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_OVERRUN_FLAG")
    1193                      .dwattr $C$DW$76, DW_AT_bit_offset(0x08)
    1194                      .dwattr $C$DW$76, DW_AT_bit_size(0x01)
    1195                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1196                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1197              
    1198              $C$DW$77        .dwtag  DW_TAG_member
    1199                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1200                      .dwattr $C$DW$77, DW_AT_name("rsvd2")
    1201                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_rsvd2")
    1202                      .dwattr $C$DW$77, DW_AT_bit_offset(0x00)
    1203                      .dwattr $C$DW$77, DW_AT_bit_size(0x08)
    1204                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1205                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1206              
    1207                      .dwendtag $C$DW$T$32
    1208              
    1209              
    1210              $C$DW$T$33      .dwtag  DW_TAG_union_type
    1211                      .dwattr $C$DW$T$33, DW_AT_name("SPISTS_REG")
    1212                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1213              $C$DW$78        .dwtag  DW_TAG_member
    1214                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1215                      .dwattr $C$DW$78, DW_AT_name("all")
    1216                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_all")
    1217                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1218                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1219              
    1220              $C$DW$79        .dwtag  DW_TAG_member
    1221                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$32)
    1222                      .dwattr $C$DW$79, DW_AT_name("bit")
    1223                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_bit")
    1224                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1225                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1226              
    1227                      .dwendtag $C$DW$T$33
    1228              
    1229              
    1230              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1231                      .dwattr $C$DW$T$35, DW_AT_name("SPI_REGS")
    1232                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x10)
    1233              $C$DW$80        .dwtag  DW_TAG_member
    1234                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$21)
    1235                      .dwattr $C$DW$80, DW_AT_name("SPICCR")
    1236                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_SPICCR")
    1237                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1238                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1239              
    1240              $C$DW$81        .dwtag  DW_TAG_member
    1241                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$23)
    1242                      .dwattr $C$DW$81, DW_AT_name("SPICTL")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Spi.asm          PAGE   24

    1243                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_SPICTL")
    1244                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1245                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1246              
    1247              $C$DW$82        .dwtag  DW_TAG_member
    1248                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$33)
    1249                      .dwattr $C$DW$82, DW_AT_name("SPISTS")
    1250                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_SPISTS")
    1251                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1252                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1253              
    1254              $C$DW$83        .dwtag  DW_TAG_member
    1255                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1256                      .dwattr $C$DW$83, DW_AT_name("rsvd1")
    1257                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_rsvd1")
    1258                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1259                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1260              
    1261              $C$DW$84        .dwtag  DW_TAG_member
    1262                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1263                      .dwattr $C$DW$84, DW_AT_name("SPIBRR")
    1264                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_SPIBRR")
    1265                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1266                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1267              
    1268              $C$DW$85        .dwtag  DW_TAG_member
    1269                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1270                      .dwattr $C$DW$85, DW_AT_name("rsvd2")
    1271                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_rsvd2")
    1272                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1273                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1274              
    1275              $C$DW$86        .dwtag  DW_TAG_member
    1276                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1277                      .dwattr $C$DW$86, DW_AT_name("SPIRXEMU")
    1278                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_SPIRXEMU")
    1279                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1280                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1281              
    1282              $C$DW$87        .dwtag  DW_TAG_member
    1283                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1284                      .dwattr $C$DW$87, DW_AT_name("SPIRXBUF")
    1285                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_SPIRXBUF")
    1286                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1287                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1288              
    1289              $C$DW$88        .dwtag  DW_TAG_member
    1290                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1291                      .dwattr $C$DW$88, DW_AT_name("SPITXBUF")
    1292                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_SPITXBUF")
    1293                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1294                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1295              
    1296              $C$DW$89        .dwtag  DW_TAG_member
    1297                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Spi.asm          PAGE   25

    1298                      .dwattr $C$DW$89, DW_AT_name("SPIDAT")
    1299                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_SPIDAT")
    1300                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1301                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1302              
    1303              $C$DW$90        .dwtag  DW_TAG_member
    1304                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$29)
    1305                      .dwattr $C$DW$90, DW_AT_name("SPIFFTX")
    1306                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_SPIFFTX")
    1307                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1308                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1309              
    1310              $C$DW$91        .dwtag  DW_TAG_member
    1311                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$27)
    1312                      .dwattr $C$DW$91, DW_AT_name("SPIFFRX")
    1313                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_SPIFFRX")
    1314                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1315                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1316              
    1317              $C$DW$92        .dwtag  DW_TAG_member
    1318                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$25)
    1319                      .dwattr $C$DW$92, DW_AT_name("SPIFFCT")
    1320                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_SPIFFCT")
    1321                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1322                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1323              
    1324              $C$DW$93        .dwtag  DW_TAG_member
    1325                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$34)
    1326                      .dwattr $C$DW$93, DW_AT_name("rsvd3")
    1327                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_rsvd3")
    1328                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1329                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1330              
    1331              $C$DW$94        .dwtag  DW_TAG_member
    1332                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$31)
    1333                      .dwattr $C$DW$94, DW_AT_name("SPIPRI")
    1334                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_SPIPRI")
    1335                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1336                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1337              
    1338                      .dwendtag $C$DW$T$35
    1339              
    1340              $C$DW$95        .dwtag  DW_TAG_TI_far_type
    1341                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$35)
    1342              
    1343              $C$DW$T$44      .dwtag  DW_TAG_volatile_type
    1344                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$95)
    1345              
    1346              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1347                      .dwattr $C$DW$T$2, DW_AT_name("void")
    1348              
    1349              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1350                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1351                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1352                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Spi.asm          PAGE   26

    1353              
    1354              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1355                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1356                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1357                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1358              
    1359              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1360                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1361                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1362                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1363              
    1364              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1365                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1366                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1367                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1368              
    1369              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1370                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1371                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1372                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1373              
    1374              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1375                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1376                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1377                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1378              
    1379              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1380                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1381                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1382                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1383              
    1384              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1385                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1386                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1387                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1388              
    1389              $C$DW$T$19      .dwtag  DW_TAG_typedef
    1390                      .dwattr $C$DW$T$19, DW_AT_name("Uint16")
    1391                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$11)
    1392                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1393              
    1394              
    1395              $C$DW$T$34      .dwtag  DW_TAG_array_type
    1396                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$19)
    1397                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
