TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/SysCtrl.asm      PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Tue Apr  8 10:05:53 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=softlib --hll_source=on --mem_model:code
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/repo/jabil2025/gpb/gpb_project_v3/SysCtrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\repo\jabil2025\gpb\gpb_project_v3\projects\example_nonBIOS_ram\D
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("CsmPwl")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_CsmPwl")

     427 0000000e 9606!         MOV       @$BLOCKED(_FlashRegs)+6,AL ; [CPU_ALU] |150| 
     428                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/SysCtrl.c",line 151,column 2,is_stmt,isa 0
     429              ;----------------------------------------------------------------------
     430              ; 151 | FlashRegs.FBANKWAIT.bit.PAGEWAIT = 5;                   // Paged access
     431              ;     |  waitstates                                                            
     432              ;----------------------------------------------------------------------
     433 0000000f CC06!         AND       AL,@$BLOCKED(_FlashRegs)+6,#0xf0ff ; [CPU_ALU] |151| 
         00000010 F0FF 
     434 00000011 1AA9          OR        AL,#0x0500            ; [CPU_ALU] |151| 
         00000012 0500 
     435 00000013 9606!         MOV       @$BLOCKED(_FlashRegs)+6,AL ; [CPU_ALU] |151| 
     436                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/SysCtrl.c",line 152,column 2,is_stmt,isa 0
     437              ;----------------------------------------------------------------------
     438              ; 152 | FlashRegs.FOTPWAIT.bit.OTPWAIT = 8;                             // OTP
     439              ;     | waitstates                                                             
     440              ;----------------------------------------------------------------------
     441 00000014 CC07!         AND       AL,@$BLOCKED(_FlashRegs)+7,#0xffe0 ; [CPU_ALU] |152| 
         00000015 FFE0 
     442 00000016 5008          ORB       AL,#0x08              ; [CPU_ALU] |152| 
     443 00000017 9607!         MOV       @$BLOCKED(_FlashRegs)+7,AL ; [CPU_ALU] |152| 
     444                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/SysCtrl.c",line 153,column 2,is_stmt,isa 0
     445              ;----------------------------------------------------------------------
     446              ; 153 | FlashRegs.FOPT.bit.ENPIPE = 1;                                  // Enab
     447              ;     | le the flash pipeline                                                  
     448              ;----------------------------------------------------------------------
     449 00000018 1A00!         OR        @$BLOCKED(_FlashRegs),#0x0001 ; [CPU_ALU] |153| 
         00000019 0001 
     450                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/SysCtrl.c",line 154,column 2,is_stmt,isa 0
     451              ;----------------------------------------------------------------------
     452              ; 154 | asm(" EDIS");
     453              ;     |          // Disable EALLOW protected register access                   
     454              ;----------------------------------------------------------------------
     455 0000001a 761A   EDIS
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/SysCtrl.asm      PAGE   10

     456                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/SysCtrl.c",line 159,column 5,is_stmt,isa 0
     457              ;----------------------------------------------------------------------
     458              ; 159 | asm(" RPT #6 || NOP");                                                 
     459              ;----------------------------------------------------------------------
     460 0000001b F606   RPT #6 || NOP
         0000001c 7700 
     461                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/SysCtrl.c",line 161,column 1,is_stmt,isa 0
     462              ;----------------------------------------------------------------------
     463              ; 161 | } //end of InitFlash()                                                 
     464              ;----------------------------------------------------------------------
     465 0000001d FF69          SPM       #0                    ; [CPU_ALU] 
     466              $C$DW$11        .dwtag  DW_TAG_TI_branch
     467                      .dwattr $C$DW$11, DW_AT_low_pc(0x00)
     468                      .dwattr $C$DW$11, DW_AT_TI_return
     469              
     470 0000001e 0006          LRETR     ; [CPU_ALU] 
     471                      ; return occurs ; [] 
     472                      .dwattr $C$DW$10, DW_AT_TI_end_file("C:/repo/jabil2025/gpb/gpb_project_v3/SysCtrl.c")
     473                      .dwattr $C$DW$10, DW_AT_TI_end_line(0xa1)
     474                      .dwattr $C$DW$10, DW_AT_TI_end_column(0x01)
     475                      .dwendentry
     476                      .dwendtag $C$DW$10
     477              
     478              ;**************************************************************
     479              ;* UNDEFINED EXTERNAL REFERENCES                              *
     480              ;**************************************************************
     481                      .global _CsmPwl
     482                      .global _FlashRegs
     483                      .global _CpuTimer0Regs
     484                      .global _SysCtrlRegs
     485                      .global _DevEmuRegs
     486              
     487              ;***************************************************************
     488              ;* TYPE INFORMATION                                            *
     489              ;***************************************************************
     490              
     491              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     492                      .dwattr $C$DW$T$20, DW_AT_name("CPUTIMER_REGS")
     493                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
     494              $C$DW$12        .dwtag  DW_TAG_member
     495                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$66)
     496                      .dwattr $C$DW$12, DW_AT_name("TIM")
     497                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_TIM")
     498                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     499                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     500              
     501              $C$DW$13        .dwtag  DW_TAG_member
     502                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$58)
     503                      .dwattr $C$DW$13, DW_AT_name("PRD")
     504                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_PRD")
     505                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     506                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     507              
     508              $C$DW$14        .dwtag  DW_TAG_member
     509                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$65)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/SysCtrl.asm      PAGE   11

     510                      .dwattr $C$DW$14, DW_AT_name("TCR")
     511                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_TCR")
     512                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     513                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     514              
     515              $C$DW$15        .dwtag  DW_TAG_member
     516                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     517                      .dwattr $C$DW$15, DW_AT_name("rsvd1")
     518                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_rsvd1")
     519                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     520                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     521              
     522              $C$DW$16        .dwtag  DW_TAG_member
     523                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$71)
     524                      .dwattr $C$DW$16, DW_AT_name("TPR")
     525                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_TPR")
     526                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     527                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     528              
     529              $C$DW$17        .dwtag  DW_TAG_member
     530                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$69)
     531                      .dwattr $C$DW$17, DW_AT_name("TPRH")
     532                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_TPRH")
     533                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     534                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     535              
     536                      .dwendtag $C$DW$T$20
     537              
     538              $C$DW$18        .dwtag  DW_TAG_TI_far_type
     539                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$20)
     540              
     541              $C$DW$T$72      .dwtag  DW_TAG_volatile_type
     542                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$18)
     543              
     544              
     545              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     546                      .dwattr $C$DW$T$21, DW_AT_name("CSM_PWL")
     547                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x08)
     548              $C$DW$19        .dwtag  DW_TAG_member
     549                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     550                      .dwattr $C$DW$19, DW_AT_name("PSWD0")
     551                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_PSWD0")
     552                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     553                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     554              
     555              $C$DW$20        .dwtag  DW_TAG_member
     556                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     557                      .dwattr $C$DW$20, DW_AT_name("PSWD1")
     558                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_PSWD1")
     559                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     560                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     561              
     562              $C$DW$21        .dwtag  DW_TAG_member
     563                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     564                      .dwattr $C$DW$21, DW_AT_name("PSWD2")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/SysCtrl.asm      PAGE   12

     565                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_PSWD2")
     566                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     567                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     568              
     569              $C$DW$22        .dwtag  DW_TAG_member
     570                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     571                      .dwattr $C$DW$22, DW_AT_name("PSWD3")
     572                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_PSWD3")
     573                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     574                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     575              
     576              $C$DW$23        .dwtag  DW_TAG_member
     577                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     578                      .dwattr $C$DW$23, DW_AT_name("PSWD4")
     579                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_PSWD4")
     580                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     581                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     582              
     583              $C$DW$24        .dwtag  DW_TAG_member
     584                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     585                      .dwattr $C$DW$24, DW_AT_name("PSWD5")
     586                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_PSWD5")
     587                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     588                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     589              
     590              $C$DW$25        .dwtag  DW_TAG_member
     591                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     592                      .dwattr $C$DW$25, DW_AT_name("PSWD6")
     593                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_PSWD6")
     594                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     595                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     596              
     597              $C$DW$26        .dwtag  DW_TAG_member
     598                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     599                      .dwattr $C$DW$26, DW_AT_name("PSWD7")
     600                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_PSWD7")
     601                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     602                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     603              
     604                      .dwendtag $C$DW$T$21
     605              
     606              $C$DW$27        .dwtag  DW_TAG_TI_far_type
     607                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$21)
     608              
     609              $C$DW$T$73      .dwtag  DW_TAG_volatile_type
     610                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$27)
     611              
     612              
     613              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     614                      .dwattr $C$DW$T$22, DW_AT_name("DEVICECNF_BITS")
     615                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     616              $C$DW$28        .dwtag  DW_TAG_member
     617                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     618                      .dwattr $C$DW$28, DW_AT_name("rsvd1")
     619                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/SysCtrl.asm      PAGE   13

     620                      .dwattr $C$DW$28, DW_AT_bit_offset(0x0d)
     621                      .dwattr $C$DW$28, DW_AT_bit_size(0x03)
     622                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     623                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     624              
     625              $C$DW$29        .dwtag  DW_TAG_member
     626                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     627                      .dwattr $C$DW$29, DW_AT_name("VMAPS")
     628                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_VMAPS")
     629                      .dwattr $C$DW$29, DW_AT_bit_offset(0x0c)
     630                      .dwattr $C$DW$29, DW_AT_bit_size(0x01)
     631                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     632                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     633              
     634              $C$DW$30        .dwtag  DW_TAG_member
     635                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     636                      .dwattr $C$DW$30, DW_AT_name("rsvd2")
     637                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_rsvd2")
     638                      .dwattr $C$DW$30, DW_AT_bit_offset(0x0b)
     639                      .dwattr $C$DW$30, DW_AT_bit_size(0x01)
     640                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     641                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     642              
     643              $C$DW$31        .dwtag  DW_TAG_member
     644                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     645                      .dwattr $C$DW$31, DW_AT_name("XRSn")
     646                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_XRSn")
     647                      .dwattr $C$DW$31, DW_AT_bit_offset(0x0a)
     648                      .dwattr $C$DW$31, DW_AT_bit_size(0x01)
     649                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     650                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     651              
     652              $C$DW$32        .dwtag  DW_TAG_member
     653                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     654                      .dwattr $C$DW$32, DW_AT_name("rsvd3")
     655                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_rsvd3")
     656                      .dwattr $C$DW$32, DW_AT_bit_offset(0x00)
     657                      .dwattr $C$DW$32, DW_AT_bit_size(0x0a)
     658                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     659                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     660              
     661              $C$DW$33        .dwtag  DW_TAG_member
     662                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     663                      .dwattr $C$DW$33, DW_AT_name("rsvd4")
     664                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_rsvd4")
     665                      .dwattr $C$DW$33, DW_AT_bit_offset(0x0d)
     666                      .dwattr $C$DW$33, DW_AT_bit_size(0x03)
     667                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     668                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     669              
     670              $C$DW$34        .dwtag  DW_TAG_member
     671                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     672                      .dwattr $C$DW$34, DW_AT_name("ENPROT")
     673                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_ENPROT")
     674                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0c)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/SysCtrl.asm      PAGE   14

     675                      .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     676                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     677                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     678              
     679              $C$DW$35        .dwtag  DW_TAG_member
     680                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     681                      .dwattr $C$DW$35, DW_AT_name("rsvd5")
     682                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_rsvd5")
     683                      .dwattr $C$DW$35, DW_AT_bit_offset(0x00)
     684                      .dwattr $C$DW$35, DW_AT_bit_size(0x0c)
     685                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     686                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     687              
     688                      .dwendtag $C$DW$T$22
     689              
     690              
     691              $C$DW$T$24      .dwtag  DW_TAG_union_type
     692                      .dwattr $C$DW$T$24, DW_AT_name("DEVICECNF_REG")
     693                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     694              $C$DW$36        .dwtag  DW_TAG_member
     695                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$23)
     696                      .dwattr $C$DW$36, DW_AT_name("all")
     697                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_all")
     698                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     699                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     700              
     701              $C$DW$37        .dwtag  DW_TAG_member
     702                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$22)
     703                      .dwattr $C$DW$37, DW_AT_name("bit")
     704                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_bit")
     705                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     706                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     707              
     708                      .dwendtag $C$DW$T$24
     709              
     710              
     711              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     712                      .dwattr $C$DW$T$25, DW_AT_name("DEVICEID_BITS")
     713                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     714              $C$DW$38        .dwtag  DW_TAG_member
     715                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     716                      .dwattr $C$DW$38, DW_AT_name("REVID")
     717                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_REVID")
     718                      .dwattr $C$DW$38, DW_AT_bit_offset(0x00)
     719                      .dwattr $C$DW$38, DW_AT_bit_size(0x10)
     720                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     721                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     722              
     723                      .dwendtag $C$DW$T$25
     724              
     725              
     726              $C$DW$T$26      .dwtag  DW_TAG_union_type
     727                      .dwattr $C$DW$T$26, DW_AT_name("DEVICEID_REG")
     728                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     729              $C$DW$39        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/SysCtrl.asm      PAGE   15

     730                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     731                      .dwattr $C$DW$39, DW_AT_name("all")
     732                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_all")
     733                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     734                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     735              
     736              $C$DW$40        .dwtag  DW_TAG_member
     737                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$25)
     738                      .dwattr $C$DW$40, DW_AT_name("bit")
     739                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_bit")
     740                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     741                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     742              
     743                      .dwendtag $C$DW$T$26
     744              
     745              
     746              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     747                      .dwattr $C$DW$T$28, DW_AT_name("DEV_EMU_REGS")
     748                      .dwattr $C$DW$T$28, DW_AT_byte_size(0xd0)
     749              $C$DW$41        .dwtag  DW_TAG_member
     750                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$24)
     751                      .dwattr $C$DW$41, DW_AT_name("DEVICECNF")
     752                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_DEVICECNF")
     753                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     754                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     755              
     756              $C$DW$42        .dwtag  DW_TAG_member
     757                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$53)
     758                      .dwattr $C$DW$42, DW_AT_name("PARTID")
     759                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_PARTID")
     760                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     761                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     762              
     763              $C$DW$43        .dwtag  DW_TAG_member
     764                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$26)
     765                      .dwattr $C$DW$43, DW_AT_name("DEVICEID")
     766                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_DEVICEID")
     767                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     768                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     769              
     770              $C$DW$44        .dwtag  DW_TAG_member
     771                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     772                      .dwattr $C$DW$44, DW_AT_name("PROTSTART")
     773                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_PROTSTART")
     774                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     775                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     776              
     777              $C$DW$45        .dwtag  DW_TAG_member
     778                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     779                      .dwattr $C$DW$45, DW_AT_name("PROTRANGE")
     780                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_PROTRANGE")
     781                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     782                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     783              
     784              $C$DW$46        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/SysCtrl.asm      PAGE   16

     785                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$27)
     786                      .dwattr $C$DW$46, DW_AT_name("rsvd2")
     787                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_rsvd2")
     788                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     789                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     790              
     791                      .dwendtag $C$DW$T$28
     792              
     793              $C$DW$47        .dwtag  DW_TAG_TI_far_type
     794                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$28)
     795              
     796              $C$DW$T$74      .dwtag  DW_TAG_volatile_type
     797                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$47)
     798              
     799              
     800              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     801                      .dwattr $C$DW$T$29, DW_AT_name("FACTIVEWAIT_BITS")
     802                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     803              $C$DW$48        .dwtag  DW_TAG_member
     804                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     805                      .dwattr $C$DW$48, DW_AT_name("ACTIVEWAIT")
     806                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_ACTIVEWAIT")
     807                      .dwattr $C$DW$48, DW_AT_bit_offset(0x07)
     808                      .dwattr $C$DW$48, DW_AT_bit_size(0x09)
     809                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     810                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     811              
     812              $C$DW$49        .dwtag  DW_TAG_member
     813                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     814                      .dwattr $C$DW$49, DW_AT_name("rsvd")
     815                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_rsvd")
     816                      .dwattr $C$DW$49, DW_AT_bit_offset(0x00)
     817                      .dwattr $C$DW$49, DW_AT_bit_size(0x07)
     818                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     819                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     820              
     821                      .dwendtag $C$DW$T$29
     822              
     823              
     824              $C$DW$T$30      .dwtag  DW_TAG_union_type
     825                      .dwattr $C$DW$T$30, DW_AT_name("FACTIVEWAIT_REG")
     826                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     827              $C$DW$50        .dwtag  DW_TAG_member
     828                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     829                      .dwattr $C$DW$50, DW_AT_name("all")
     830                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_all")
     831                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     832                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     833              
     834              $C$DW$51        .dwtag  DW_TAG_member
     835                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$29)
     836                      .dwattr $C$DW$51, DW_AT_name("bit")
     837                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_bit")
     838                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     839                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/SysCtrl.asm      PAGE   17

     840              
     841                      .dwendtag $C$DW$T$30
     842              
     843              
     844              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     845                      .dwattr $C$DW$T$31, DW_AT_name("FBANKWAIT_BITS")
     846                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     847              $C$DW$52        .dwtag  DW_TAG_member
     848                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     849                      .dwattr $C$DW$52, DW_AT_name("RANDWAIT")
     850                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_RANDWAIT")
     851                      .dwattr $C$DW$52, DW_AT_bit_offset(0x0c)
     852                      .dwattr $C$DW$52, DW_AT_bit_size(0x04)
     853                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     854                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     855              
     856              $C$DW$53        .dwtag  DW_TAG_member
     857                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     858                      .dwattr $C$DW$53, DW_AT_name("rsvd1")
     859                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_rsvd1")
     860                      .dwattr $C$DW$53, DW_AT_bit_offset(0x08)
     861                      .dwattr $C$DW$53, DW_AT_bit_size(0x04)
     862                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     863                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     864              
     865              $C$DW$54        .dwtag  DW_TAG_member
     866                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     867                      .dwattr $C$DW$54, DW_AT_name("PAGEWAIT")
     868                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_PAGEWAIT")
     869                      .dwattr $C$DW$54, DW_AT_bit_offset(0x04)
     870                      .dwattr $C$DW$54, DW_AT_bit_size(0x04)
     871                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     872                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     873              
     874              $C$DW$55        .dwtag  DW_TAG_member
     875                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     876                      .dwattr $C$DW$55, DW_AT_name("rsvd2")
     877                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_rsvd2")
     878                      .dwattr $C$DW$55, DW_AT_bit_offset(0x00)
     879                      .dwattr $C$DW$55, DW_AT_bit_size(0x04)
     880                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     881                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     882              
     883                      .dwendtag $C$DW$T$31
     884              
     885              
     886              $C$DW$T$32      .dwtag  DW_TAG_union_type
     887                      .dwattr $C$DW$T$32, DW_AT_name("FBANKWAIT_REG")
     888                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
     889              $C$DW$56        .dwtag  DW_TAG_member
     890                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     891                      .dwattr $C$DW$56, DW_AT_name("all")
     892                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_all")
     893                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     894                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/SysCtrl.asm      PAGE   18

     895              
     896              $C$DW$57        .dwtag  DW_TAG_member
     897                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$31)
     898                      .dwattr $C$DW$57, DW_AT_name("bit")
     899                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_bit")
     900                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     901                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     902              
     903                      .dwendtag $C$DW$T$32
     904              
     905              
     906              $C$DW$T$33      .dwtag  DW_TAG_structure_type
     907                      .dwattr $C$DW$T$33, DW_AT_name("FLASH_REGS")
     908                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x08)
     909              $C$DW$58        .dwtag  DW_TAG_member
     910                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$35)
     911                      .dwattr $C$DW$58, DW_AT_name("FOPT")
     912                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_FOPT")
     913                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     914                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     915              
     916              $C$DW$59        .dwtag  DW_TAG_member
     917                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     918                      .dwattr $C$DW$59, DW_AT_name("rsvd1")
     919                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_rsvd1")
     920                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     921                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     922              
     923              $C$DW$60        .dwtag  DW_TAG_member
     924                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$39)
     925                      .dwattr $C$DW$60, DW_AT_name("FPWR")
     926                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_FPWR")
     927                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     928                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     929              
     930              $C$DW$61        .dwtag  DW_TAG_member
     931                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$41)
     932                      .dwattr $C$DW$61, DW_AT_name("FSTATUS")
     933                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_FSTATUS")
     934                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     935                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     936              
     937              $C$DW$62        .dwtag  DW_TAG_member
     938                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$43)
     939                      .dwattr $C$DW$62, DW_AT_name("FSTDBYWAIT")
     940                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_FSTDBYWAIT")
     941                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     942                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     943              
     944              $C$DW$63        .dwtag  DW_TAG_member
     945                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$30)
     946                      .dwattr $C$DW$63, DW_AT_name("FACTIVEWAIT")
     947                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_FACTIVEWAIT")
     948                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     949                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/SysCtrl.asm      PAGE   19

     950              
     951              $C$DW$64        .dwtag  DW_TAG_member
     952                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$32)
     953                      .dwattr $C$DW$64, DW_AT_name("FBANKWAIT")
     954                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_FBANKWAIT")
     955                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     956                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     957              
     958              $C$DW$65        .dwtag  DW_TAG_member
     959                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$37)
     960                      .dwattr $C$DW$65, DW_AT_name("FOTPWAIT")
     961                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_FOTPWAIT")
     962                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     963                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     964              
     965                      .dwendtag $C$DW$T$33
     966              
     967              $C$DW$66        .dwtag  DW_TAG_TI_far_type
     968                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$33)
     969              
     970              $C$DW$T$79      .dwtag  DW_TAG_volatile_type
     971                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$66)
     972              
     973              
     974              $C$DW$T$34      .dwtag  DW_TAG_structure_type
     975                      .dwattr $C$DW$T$34, DW_AT_name("FOPT_BITS")
     976                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
     977              $C$DW$67        .dwtag  DW_TAG_member
     978                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     979                      .dwattr $C$DW$67, DW_AT_name("ENPIPE")
     980                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_ENPIPE")
     981                      .dwattr $C$DW$67, DW_AT_bit_offset(0x0f)
     982                      .dwattr $C$DW$67, DW_AT_bit_size(0x01)
     983                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     984                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     985              
     986              $C$DW$68        .dwtag  DW_TAG_member
     987                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     988                      .dwattr $C$DW$68, DW_AT_name("rsvd")
     989                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_rsvd")
     990                      .dwattr $C$DW$68, DW_AT_bit_offset(0x00)
     991                      .dwattr $C$DW$68, DW_AT_bit_size(0x0f)
     992                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     993                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     994              
     995                      .dwendtag $C$DW$T$34
     996              
     997              
     998              $C$DW$T$35      .dwtag  DW_TAG_union_type
     999                      .dwattr $C$DW$T$35, DW_AT_name("FOPT_REG")
    1000                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1001              $C$DW$69        .dwtag  DW_TAG_member
    1002                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1003                      .dwattr $C$DW$69, DW_AT_name("all")
    1004                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/SysCtrl.asm      PAGE   20

    1005                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1006                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1007              
    1008              $C$DW$70        .dwtag  DW_TAG_member
    1009                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$34)
    1010                      .dwattr $C$DW$70, DW_AT_name("bit")
    1011                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_bit")
    1012                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1013                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1014              
    1015                      .dwendtag $C$DW$T$35
    1016              
    1017              
    1018              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1019                      .dwattr $C$DW$T$36, DW_AT_name("FOTPWAIT_BITS")
    1020                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1021              $C$DW$71        .dwtag  DW_TAG_member
    1022                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1023                      .dwattr $C$DW$71, DW_AT_name("OTPWAIT")
    1024                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_OTPWAIT")
    1025                      .dwattr $C$DW$71, DW_AT_bit_offset(0x0b)
    1026                      .dwattr $C$DW$71, DW_AT_bit_size(0x05)
    1027                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1028                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1029              
    1030              $C$DW$72        .dwtag  DW_TAG_member
    1031                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1032                      .dwattr $C$DW$72, DW_AT_name("rsvd")
    1033                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_rsvd")
    1034                      .dwattr $C$DW$72, DW_AT_bit_offset(0x00)
    1035                      .dwattr $C$DW$72, DW_AT_bit_size(0x0b)
    1036                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1037                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1038              
    1039                      .dwendtag $C$DW$T$36
    1040              
    1041              
    1042              $C$DW$T$37      .dwtag  DW_TAG_union_type
    1043                      .dwattr $C$DW$T$37, DW_AT_name("FOTPWAIT_REG")
    1044                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1045              $C$DW$73        .dwtag  DW_TAG_member
    1046                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1047                      .dwattr $C$DW$73, DW_AT_name("all")
    1048                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_all")
    1049                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1050                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1051              
    1052              $C$DW$74        .dwtag  DW_TAG_member
    1053                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$36)
    1054                      .dwattr $C$DW$74, DW_AT_name("bit")
    1055                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_bit")
    1056                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1057                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1058              
    1059                      .dwendtag $C$DW$T$37
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/SysCtrl.asm      PAGE   21

    1060              
    1061              
    1062              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1063                      .dwattr $C$DW$T$38, DW_AT_name("FPWR_BITS")
    1064                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1065              $C$DW$75        .dwtag  DW_TAG_member
    1066                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1067                      .dwattr $C$DW$75, DW_AT_name("PWR")
    1068                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_PWR")
    1069                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0e)
    1070                      .dwattr $C$DW$75, DW_AT_bit_size(0x02)
    1071                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1072                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1073              
    1074              $C$DW$76        .dwtag  DW_TAG_member
    1075                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1076                      .dwattr $C$DW$76, DW_AT_name("rsvd")
    1077                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_rsvd")
    1078                      .dwattr $C$DW$76, DW_AT_bit_offset(0x00)
    1079                      .dwattr $C$DW$76, DW_AT_bit_size(0x0e)
    1080                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1081                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1082              
    1083                      .dwendtag $C$DW$T$38
    1084              
    1085              
    1086              $C$DW$T$39      .dwtag  DW_TAG_union_type
    1087                      .dwattr $C$DW$T$39, DW_AT_name("FPWR_REG")
    1088                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1089              $C$DW$77        .dwtag  DW_TAG_member
    1090                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1091                      .dwattr $C$DW$77, DW_AT_name("all")
    1092                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_all")
    1093                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1094                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1095              
    1096              $C$DW$78        .dwtag  DW_TAG_member
    1097                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$38)
    1098                      .dwattr $C$DW$78, DW_AT_name("bit")
    1099                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_bit")
    1100                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1101                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1102              
    1103                      .dwendtag $C$DW$T$39
    1104              
    1105              
    1106              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1107                      .dwattr $C$DW$T$40, DW_AT_name("FSTATUS_BITS")
    1108                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1109              $C$DW$79        .dwtag  DW_TAG_member
    1110                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1111                      .dwattr $C$DW$79, DW_AT_name("PWRS")
    1112                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_PWRS")
    1113                      .dwattr $C$DW$79, DW_AT_bit_offset(0x0e)
    1114                      .dwattr $C$DW$79, DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/SysCtrl.asm      PAGE   22

    1115                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1116                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1117              
    1118              $C$DW$80        .dwtag  DW_TAG_member
    1119                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1120                      .dwattr $C$DW$80, DW_AT_name("STDBYWAITS")
    1121                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_STDBYWAITS")
    1122                      .dwattr $C$DW$80, DW_AT_bit_offset(0x0d)
    1123                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
    1124                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1125                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1126              
    1127              $C$DW$81        .dwtag  DW_TAG_member
    1128                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1129                      .dwattr $C$DW$81, DW_AT_name("ACTIVEWAITS")
    1130                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_ACTIVEWAITS")
    1131                      .dwattr $C$DW$81, DW_AT_bit_offset(0x0c)
    1132                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1133                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1134                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1135              
    1136              $C$DW$82        .dwtag  DW_TAG_member
    1137                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1138                      .dwattr $C$DW$82, DW_AT_name("rsvd1")
    1139                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_rsvd1")
    1140                      .dwattr $C$DW$82, DW_AT_bit_offset(0x08)
    1141                      .dwattr $C$DW$82, DW_AT_bit_size(0x04)
    1142                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1143                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1144              
    1145              $C$DW$83        .dwtag  DW_TAG_member
    1146                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1147                      .dwattr $C$DW$83, DW_AT_name("V3STAT")
    1148                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_V3STAT")
    1149                      .dwattr $C$DW$83, DW_AT_bit_offset(0x07)
    1150                      .dwattr $C$DW$83, DW_AT_bit_size(0x01)
    1151                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1152                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1153              
    1154              $C$DW$84        .dwtag  DW_TAG_member
    1155                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1156                      .dwattr $C$DW$84, DW_AT_name("rsvd2")
    1157                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_rsvd2")
    1158                      .dwattr $C$DW$84, DW_AT_bit_offset(0x00)
    1159                      .dwattr $C$DW$84, DW_AT_bit_size(0x07)
    1160                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1161                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1162              
    1163                      .dwendtag $C$DW$T$40
    1164              
    1165              
    1166              $C$DW$T$41      .dwtag  DW_TAG_union_type
    1167                      .dwattr $C$DW$T$41, DW_AT_name("FSTATUS_REG")
    1168                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1169              $C$DW$85        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/SysCtrl.asm      PAGE   23

    1170                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1171                      .dwattr $C$DW$85, DW_AT_name("all")
    1172                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_all")
    1173                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1174                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1175              
    1176              $C$DW$86        .dwtag  DW_TAG_member
    1177                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$40)
    1178                      .dwattr $C$DW$86, DW_AT_name("bit")
    1179                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_bit")
    1180                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1181                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1182              
    1183                      .dwendtag $C$DW$T$41
    1184              
    1185              
    1186              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1187                      .dwattr $C$DW$T$42, DW_AT_name("FSTDBYWAIT_BITS")
    1188                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1189              $C$DW$87        .dwtag  DW_TAG_member
    1190                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1191                      .dwattr $C$DW$87, DW_AT_name("STDBYWAIT")
    1192                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_STDBYWAIT")
    1193                      .dwattr $C$DW$87, DW_AT_bit_offset(0x07)
    1194                      .dwattr $C$DW$87, DW_AT_bit_size(0x09)
    1195                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1196                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1197              
    1198              $C$DW$88        .dwtag  DW_TAG_member
    1199                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1200                      .dwattr $C$DW$88, DW_AT_name("rsvd")
    1201                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_rsvd")
    1202                      .dwattr $C$DW$88, DW_AT_bit_offset(0x00)
    1203                      .dwattr $C$DW$88, DW_AT_bit_size(0x07)
    1204                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1205                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1206              
    1207                      .dwendtag $C$DW$T$42
    1208              
    1209              
    1210              $C$DW$T$43      .dwtag  DW_TAG_union_type
    1211                      .dwattr $C$DW$T$43, DW_AT_name("FSTDBYWAIT_REG")
    1212                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1213              $C$DW$89        .dwtag  DW_TAG_member
    1214                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1215                      .dwattr $C$DW$89, DW_AT_name("all")
    1216                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_all")
    1217                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1218                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1219              
    1220              $C$DW$90        .dwtag  DW_TAG_member
    1221                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$42)
    1222                      .dwattr $C$DW$90, DW_AT_name("bit")
    1223                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_bit")
    1224                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/SysCtrl.asm      PAGE   24

    1225                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1226              
    1227                      .dwendtag $C$DW$T$43
    1228              
    1229              
    1230              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1231                      .dwattr $C$DW$T$44, DW_AT_name("HISPCP_BITS")
    1232                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1233              $C$DW$91        .dwtag  DW_TAG_member
    1234                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1235                      .dwattr $C$DW$91, DW_AT_name("HSPCLK")
    1236                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_HSPCLK")
    1237                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0d)
    1238                      .dwattr $C$DW$91, DW_AT_bit_size(0x03)
    1239                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1240                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1241              
    1242              $C$DW$92        .dwtag  DW_TAG_member
    1243                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1244                      .dwattr $C$DW$92, DW_AT_name("rsvd1")
    1245                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_rsvd1")
    1246                      .dwattr $C$DW$92, DW_AT_bit_offset(0x00)
    1247                      .dwattr $C$DW$92, DW_AT_bit_size(0x0d)
    1248                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1249                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1250              
    1251                      .dwendtag $C$DW$T$44
    1252              
    1253              
    1254              $C$DW$T$45      .dwtag  DW_TAG_union_type
    1255                      .dwattr $C$DW$T$45, DW_AT_name("HISPCP_REG")
    1256                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    1257              $C$DW$93        .dwtag  DW_TAG_member
    1258                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1259                      .dwattr $C$DW$93, DW_AT_name("all")
    1260                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_all")
    1261                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1262                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1263              
    1264              $C$DW$94        .dwtag  DW_TAG_member
    1265                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$44)
    1266                      .dwattr $C$DW$94, DW_AT_name("bit")
    1267                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_bit")
    1268                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1269                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1270              
    1271                      .dwendtag $C$DW$T$45
    1272              
    1273              
    1274              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1275                      .dwattr $C$DW$T$46, DW_AT_name("LOSPCP_BITS")
    1276                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    1277              $C$DW$95        .dwtag  DW_TAG_member
    1278                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1279                      .dwattr $C$DW$95, DW_AT_name("LSPCLK")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/SysCtrl.asm      PAGE   25

    1280                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_LSPCLK")
    1281                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0d)
    1282                      .dwattr $C$DW$95, DW_AT_bit_size(0x03)
    1283                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1284                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1285              
    1286              $C$DW$96        .dwtag  DW_TAG_member
    1287                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1288                      .dwattr $C$DW$96, DW_AT_name("rsvd1")
    1289                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_rsvd1")
    1290                      .dwattr $C$DW$96, DW_AT_bit_offset(0x00)
    1291                      .dwattr $C$DW$96, DW_AT_bit_size(0x0d)
    1292                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1293                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1294              
    1295                      .dwendtag $C$DW$T$46
    1296              
    1297              
    1298              $C$DW$T$47      .dwtag  DW_TAG_union_type
    1299                      .dwattr $C$DW$T$47, DW_AT_name("LOSPCP_REG")
    1300                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    1301              $C$DW$97        .dwtag  DW_TAG_member
    1302                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1303                      .dwattr $C$DW$97, DW_AT_name("all")
    1304                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_all")
    1305                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1306                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1307              
    1308              $C$DW$98        .dwtag  DW_TAG_member
    1309                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$46)
    1310                      .dwattr $C$DW$98, DW_AT_name("bit")
    1311                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_bit")
    1312                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1313                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1314              
    1315                      .dwendtag $C$DW$T$47
    1316              
    1317              
    1318              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    1319                      .dwattr $C$DW$T$48, DW_AT_name("LPMCR0_BITS")
    1320                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    1321              $C$DW$99        .dwtag  DW_TAG_member
    1322                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1323                      .dwattr $C$DW$99, DW_AT_name("LPM")
    1324                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_LPM")
    1325                      .dwattr $C$DW$99, DW_AT_bit_offset(0x0e)
    1326                      .dwattr $C$DW$99, DW_AT_bit_size(0x02)
    1327                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1328                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1329              
    1330              $C$DW$100       .dwtag  DW_TAG_member
    1331                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1332                      .dwattr $C$DW$100, DW_AT_name("QUALSTDBY")
    1333                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_QUALSTDBY")
    1334                      .dwattr $C$DW$100, DW_AT_bit_offset(0x08)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/SysCtrl.asm      PAGE   26

    1335                      .dwattr $C$DW$100, DW_AT_bit_size(0x06)
    1336                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1337                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1338              
    1339              $C$DW$101       .dwtag  DW_TAG_member
    1340                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1341                      .dwattr $C$DW$101, DW_AT_name("rsvd1")
    1342                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_rsvd1")
    1343                      .dwattr $C$DW$101, DW_AT_bit_offset(0x00)
    1344                      .dwattr $C$DW$101, DW_AT_bit_size(0x08)
    1345                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1346                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1347              
    1348                      .dwendtag $C$DW$T$48
    1349              
    1350              
    1351              $C$DW$T$49      .dwtag  DW_TAG_union_type
    1352                      .dwattr $C$DW$T$49, DW_AT_name("LPMCR0_REG")
    1353                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    1354              $C$DW$102       .dwtag  DW_TAG_member
    1355                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1356                      .dwattr $C$DW$102, DW_AT_name("all")
    1357                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_all")
    1358                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1359                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1360              
    1361              $C$DW$103       .dwtag  DW_TAG_member
    1362                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$48)
    1363                      .dwattr $C$DW$103, DW_AT_name("bit")
    1364                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_bit")
    1365                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1366                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1367              
    1368                      .dwendtag $C$DW$T$49
    1369              
    1370              
    1371              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    1372                      .dwattr $C$DW$T$50, DW_AT_name("LPMCR1_BITS")
    1373                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    1374              $C$DW$104       .dwtag  DW_TAG_member
    1375                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1376                      .dwattr $C$DW$104, DW_AT_name("XINT1")
    1377                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_XINT1")
    1378                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0f)
    1379                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1380                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1381                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1382              
    1383              $C$DW$105       .dwtag  DW_TAG_member
    1384                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1385                      .dwattr $C$DW$105, DW_AT_name("XNMI")
    1386                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_XNMI")
    1387                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0e)
    1388                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1389                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/SysCtrl.asm      PAGE   27

    1390                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1391              
    1392              $C$DW$106       .dwtag  DW_TAG_member
    1393                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1394                      .dwattr $C$DW$106, DW_AT_name("WDINT")
    1395                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_WDINT")
    1396                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0d)
    1397                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1398                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1399                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1400              
    1401              $C$DW$107       .dwtag  DW_TAG_member
    1402                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1403                      .dwattr $C$DW$107, DW_AT_name("T1CTRIP")
    1404                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_T1CTRIP")
    1405                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0c)
    1406                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1407                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1408                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1409              
    1410              $C$DW$108       .dwtag  DW_TAG_member
    1411                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1412                      .dwattr $C$DW$108, DW_AT_name("T2CTRIP")
    1413                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_T2CTRIP")
    1414                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0b)
    1415                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1416                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1417                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1418              
    1419              $C$DW$109       .dwtag  DW_TAG_member
    1420                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1421                      .dwattr $C$DW$109, DW_AT_name("T3CTRIP")
    1422                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_T3CTRIP")
    1423                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0a)
    1424                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1425                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1426                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1427              
    1428              $C$DW$110       .dwtag  DW_TAG_member
    1429                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1430                      .dwattr $C$DW$110, DW_AT_name("T4CTRIP")
    1431                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_T4CTRIP")
    1432                      .dwattr $C$DW$110, DW_AT_bit_offset(0x09)
    1433                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1434                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1435                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1436              
    1437              $C$DW$111       .dwtag  DW_TAG_member
    1438                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1439                      .dwattr $C$DW$111, DW_AT_name("C1TRIP")
    1440                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_C1TRIP")
    1441                      .dwattr $C$DW$111, DW_AT_bit_offset(0x08)
    1442                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1443                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1444                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/SysCtrl.asm      PAGE   28

    1445              
    1446              $C$DW$112       .dwtag  DW_TAG_member
    1447                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1448                      .dwattr $C$DW$112, DW_AT_name("C2TRIP")
    1449                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_C2TRIP")
    1450                      .dwattr $C$DW$112, DW_AT_bit_offset(0x07)
    1451                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1452                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1453                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1454              
    1455              $C$DW$113       .dwtag  DW_TAG_member
    1456                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1457                      .dwattr $C$DW$113, DW_AT_name("C3TRIP")
    1458                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_C3TRIP")
    1459                      .dwattr $C$DW$113, DW_AT_bit_offset(0x06)
    1460                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1461                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1462                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1463              
    1464              $C$DW$114       .dwtag  DW_TAG_member
    1465                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1466                      .dwattr $C$DW$114, DW_AT_name("C4TRIP")
    1467                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_C4TRIP")
    1468                      .dwattr $C$DW$114, DW_AT_bit_offset(0x05)
    1469                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1470                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1471                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1472              
    1473              $C$DW$115       .dwtag  DW_TAG_member
    1474                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1475                      .dwattr $C$DW$115, DW_AT_name("C5TRIP")
    1476                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_C5TRIP")
    1477                      .dwattr $C$DW$115, DW_AT_bit_offset(0x04)
    1478                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1479                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1480                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1481              
    1482              $C$DW$116       .dwtag  DW_TAG_member
    1483                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1484                      .dwattr $C$DW$116, DW_AT_name("C6TRIP")
    1485                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_C6TRIP")
    1486                      .dwattr $C$DW$116, DW_AT_bit_offset(0x03)
    1487                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1488                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1489                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1490              
    1491              $C$DW$117       .dwtag  DW_TAG_member
    1492                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1493                      .dwattr $C$DW$117, DW_AT_name("SCIRXA")
    1494                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_SCIRXA")
    1495                      .dwattr $C$DW$117, DW_AT_bit_offset(0x02)
    1496                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1497                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1498                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1499              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/SysCtrl.asm      PAGE   29

    1500              $C$DW$118       .dwtag  DW_TAG_member
    1501                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1502                      .dwattr $C$DW$118, DW_AT_name("SCIRXB")
    1503                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_SCIRXB")
    1504                      .dwattr $C$DW$118, DW_AT_bit_offset(0x01)
    1505                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1506                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1507                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1508              
    1509              $C$DW$119       .dwtag  DW_TAG_member
    1510                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1511                      .dwattr $C$DW$119, DW_AT_name("CANRX")
    1512                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_CANRX")
    1513                      .dwattr $C$DW$119, DW_AT_bit_offset(0x00)
    1514                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1515                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1516                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1517              
    1518                      .dwendtag $C$DW$T$50
    1519              
    1520              
    1521              $C$DW$T$51      .dwtag  DW_TAG_union_type
    1522                      .dwattr $C$DW$T$51, DW_AT_name("LPMCR1_REG")
    1523                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    1524              $C$DW$120       .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1526                      .dwattr $C$DW$120, DW_AT_name("all")
    1527                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_all")
    1528                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1529                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1530              
    1531              $C$DW$121       .dwtag  DW_TAG_member
    1532                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$50)
    1533                      .dwattr $C$DW$121, DW_AT_name("bit")
    1534                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_bit")
    1535                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1536                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1537              
    1538                      .dwendtag $C$DW$T$51
    1539              
    1540              
    1541              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    1542                      .dwattr $C$DW$T$52, DW_AT_name("PARTID_BITS")
    1543                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    1544              $C$DW$122       .dwtag  DW_TAG_member
    1545                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1546                      .dwattr $C$DW$122, DW_AT_name("PARTNO")
    1547                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_PARTNO")
    1548                      .dwattr $C$DW$122, DW_AT_bit_offset(0x08)
    1549                      .dwattr $C$DW$122, DW_AT_bit_size(0x08)
    1550                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1551                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1552              
    1553              $C$DW$123       .dwtag  DW_TAG_member
    1554                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/SysCtrl.asm      PAGE   30

    1555                      .dwattr $C$DW$123, DW_AT_name("PARTTYPE")
    1556                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_PARTTYPE")
    1557                      .dwattr $C$DW$123, DW_AT_bit_offset(0x00)
    1558                      .dwattr $C$DW$123, DW_AT_bit_size(0x08)
    1559                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1560                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1561              
    1562                      .dwendtag $C$DW$T$52
    1563              
    1564              
    1565              $C$DW$T$53      .dwtag  DW_TAG_union_type
    1566                      .dwattr $C$DW$T$53, DW_AT_name("PARTID_REG")
    1567                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    1568              $C$DW$124       .dwtag  DW_TAG_member
    1569                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1570                      .dwattr $C$DW$124, DW_AT_name("all")
    1571                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_all")
    1572                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1573                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1574              
    1575              $C$DW$125       .dwtag  DW_TAG_member
    1576                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$52)
    1577                      .dwattr $C$DW$125, DW_AT_name("bit")
    1578                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_bit")
    1579                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1580                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1581              
    1582                      .dwendtag $C$DW$T$53
    1583              
    1584              
    1585              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    1586                      .dwattr $C$DW$T$54, DW_AT_name("PCLKCR_BITS")
    1587                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
    1588              $C$DW$126       .dwtag  DW_TAG_member
    1589                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1590                      .dwattr $C$DW$126, DW_AT_name("EVAENCLK")
    1591                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_EVAENCLK")
    1592                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0f)
    1593                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1594                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1595                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1596              
    1597              $C$DW$127       .dwtag  DW_TAG_member
    1598                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1599                      .dwattr $C$DW$127, DW_AT_name("EVBENCLK")
    1600                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_EVBENCLK")
    1601                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0e)
    1602                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1603                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1604                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1605              
    1606              $C$DW$128       .dwtag  DW_TAG_member
    1607                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1608                      .dwattr $C$DW$128, DW_AT_name("rsvd1")
    1609                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/SysCtrl.asm      PAGE   31

    1610                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0d)
    1611                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1612                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1613                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1614              
    1615              $C$DW$129       .dwtag  DW_TAG_member
    1616                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1617                      .dwattr $C$DW$129, DW_AT_name("ADCENCLK")
    1618                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_ADCENCLK")
    1619                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0c)
    1620                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1621                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1622                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1623              
    1624              $C$DW$130       .dwtag  DW_TAG_member
    1625                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1626                      .dwattr $C$DW$130, DW_AT_name("rsvd2")
    1627                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_rsvd2")
    1628                      .dwattr $C$DW$130, DW_AT_bit_offset(0x08)
    1629                      .dwattr $C$DW$130, DW_AT_bit_size(0x04)
    1630                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1631                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1632              
    1633              $C$DW$131       .dwtag  DW_TAG_member
    1634                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1635                      .dwattr $C$DW$131, DW_AT_name("SPIENCLK")
    1636                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_SPIENCLK")
    1637                      .dwattr $C$DW$131, DW_AT_bit_offset(0x07)
    1638                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1639                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1640                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1641              
    1642              $C$DW$132       .dwtag  DW_TAG_member
    1643                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1644                      .dwattr $C$DW$132, DW_AT_name("rsvd3")
    1645                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_rsvd3")
    1646                      .dwattr $C$DW$132, DW_AT_bit_offset(0x06)
    1647                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1648                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1649                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1650              
    1651              $C$DW$133       .dwtag  DW_TAG_member
    1652                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1653                      .dwattr $C$DW$133, DW_AT_name("SCIAENCLK")
    1654                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_SCIAENCLK")
    1655                      .dwattr $C$DW$133, DW_AT_bit_offset(0x05)
    1656                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1657                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1658                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1659              
    1660              $C$DW$134       .dwtag  DW_TAG_member
    1661                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1662                      .dwattr $C$DW$134, DW_AT_name("SCIBENCLK")
    1663                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_SCIBENCLK")
    1664                      .dwattr $C$DW$134, DW_AT_bit_offset(0x04)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/SysCtrl.asm      PAGE   32

    1665                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1666                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1667                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1668              
    1669              $C$DW$135       .dwtag  DW_TAG_member
    1670                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1671                      .dwattr $C$DW$135, DW_AT_name("MCBSPENCLK")
    1672                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_MCBSPENCLK")
    1673                      .dwattr $C$DW$135, DW_AT_bit_offset(0x03)
    1674                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1675                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1676                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1677              
    1678              $C$DW$136       .dwtag  DW_TAG_member
    1679                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1680                      .dwattr $C$DW$136, DW_AT_name("rsvd4")
    1681                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_rsvd4")
    1682                      .dwattr $C$DW$136, DW_AT_bit_offset(0x02)
    1683                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1684                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1685                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1686              
    1687              $C$DW$137       .dwtag  DW_TAG_member
    1688                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1689                      .dwattr $C$DW$137, DW_AT_name("ECANENCLK")
    1690                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_ECANENCLK")
    1691                      .dwattr $C$DW$137, DW_AT_bit_offset(0x01)
    1692                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1693                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1694                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1695              
    1696                      .dwendtag $C$DW$T$54
    1697              
    1698              
    1699              $C$DW$T$55      .dwtag  DW_TAG_union_type
    1700                      .dwattr $C$DW$T$55, DW_AT_name("PCLKCR_REG")
    1701                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x01)
    1702              $C$DW$138       .dwtag  DW_TAG_member
    1703                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1704                      .dwattr $C$DW$138, DW_AT_name("all")
    1705                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_all")
    1706                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1707                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1708              
    1709              $C$DW$139       .dwtag  DW_TAG_member
    1710                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$54)
    1711                      .dwattr $C$DW$139, DW_AT_name("bit")
    1712                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_bit")
    1713                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1714                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1715              
    1716                      .dwendtag $C$DW$T$55
    1717              
    1718              
    1719              $C$DW$T$56      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/SysCtrl.asm      PAGE   33

    1720                      .dwattr $C$DW$T$56, DW_AT_name("PLLCR_BITS")
    1721                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x01)
    1722              $C$DW$140       .dwtag  DW_TAG_member
    1723                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1724                      .dwattr $C$DW$140, DW_AT_name("DIV")
    1725                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_DIV")
    1726                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0c)
    1727                      .dwattr $C$DW$140, DW_AT_bit_size(0x04)
    1728                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1729                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1730              
    1731              $C$DW$141       .dwtag  DW_TAG_member
    1732                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1733                      .dwattr $C$DW$141, DW_AT_name("rsvd1")
    1734                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_rsvd1")
    1735                      .dwattr $C$DW$141, DW_AT_bit_offset(0x00)
    1736                      .dwattr $C$DW$141, DW_AT_bit_size(0x0c)
    1737                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1738                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1739              
    1740                      .dwendtag $C$DW$T$56
    1741              
    1742              
    1743              $C$DW$T$57      .dwtag  DW_TAG_union_type
    1744                      .dwattr $C$DW$T$57, DW_AT_name("PLLCR_REG")
    1745                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x01)
    1746              $C$DW$142       .dwtag  DW_TAG_member
    1747                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1748                      .dwattr $C$DW$142, DW_AT_name("all")
    1749                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_all")
    1750                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1751                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1752              
    1753              $C$DW$143       .dwtag  DW_TAG_member
    1754                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$56)
    1755                      .dwattr $C$DW$143, DW_AT_name("bit")
    1756                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_bit")
    1757                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1758                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1759              
    1760                      .dwendtag $C$DW$T$57
    1761              
    1762              
    1763              $C$DW$T$58      .dwtag  DW_TAG_union_type
    1764                      .dwattr $C$DW$T$58, DW_AT_name("PRD_GROUP")
    1765                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x02)
    1766              $C$DW$144       .dwtag  DW_TAG_member
    1767                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$23)
    1768                      .dwattr $C$DW$144, DW_AT_name("all")
    1769                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_all")
    1770                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1771                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1772              
    1773              $C$DW$145       .dwtag  DW_TAG_member
    1774                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$59)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/SysCtrl.asm      PAGE   34

    1775                      .dwattr $C$DW$145, DW_AT_name("half")
    1776                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_half")
    1777                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1778                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1779              
    1780                      .dwendtag $C$DW$T$58
    1781              
    1782              
    1783              $C$DW$T$59      .dwtag  DW_TAG_structure_type
    1784                      .dwattr $C$DW$T$59, DW_AT_name("PRD_REG")
    1785                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    1786              $C$DW$146       .dwtag  DW_TAG_member
    1787                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1788                      .dwattr $C$DW$146, DW_AT_name("LSW")
    1789                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_LSW")
    1790                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1791                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1792              
    1793              $C$DW$147       .dwtag  DW_TAG_member
    1794                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1795                      .dwattr $C$DW$147, DW_AT_name("MSW")
    1796                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_MSW")
    1797                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1798                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1799              
    1800                      .dwendtag $C$DW$T$59
    1801              
    1802              
    1803              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    1804                      .dwattr $C$DW$T$63, DW_AT_name("SYS_CTRL_REGS")
    1805                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x20)
    1806              $C$DW$148       .dwtag  DW_TAG_member
    1807                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$60)
    1808                      .dwattr $C$DW$148, DW_AT_name("rsvd1")
    1809                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_rsvd1")
    1810                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1811                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1812              
    1813              $C$DW$149       .dwtag  DW_TAG_member
    1814                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$45)
    1815                      .dwattr $C$DW$149, DW_AT_name("HISPCP")
    1816                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_HISPCP")
    1817                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
