TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Xintf.asm        PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Tue Apr  8 10:05:53 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=softlib --hll_source=on --mem_model:code
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/repo/jabil2025/gpb/gpb_project_v3/Xintf.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\repo\jabil2025\gpb\gpb_project_v3\projects\example_nonBIOS_ram\D
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("XintfRegs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_XintfRegs")

    1089              ;----------------------------------------------------------------------
    1090              ; 264 | Byte ReadCpld(Uint16 Addr)                                             
    1091              ;----------------------------------------------------------------------
    1092              
    1093              ;***************************************************************
    1094              ;* FNAME: _ReadCpld                     FR SIZE:   4           *
    1095              ;*                                                             *
    1096              ;* FUNCTION ENVIRONMENT                                        *
    1097              ;*                                                             *
    1098              ;* FUNCTION PROPERTIES                                         *
    1099              ;*                            0 Parameter,  3 Auto,  0 SOE     *
    1100              ;***************************************************************
    1101              
    1102 0000019a       _ReadCpld:
    1103                      .dwcfi  cfa_offset, -2
    1104                      .dwcfi  save_reg_to_mem, 26, 0
    1105 0000019a FE04          ADDB      SP,#4                 ; [CPU_ARAU] 
    1106                      .dwcfi  cfa_offset, -6
    1107              $C$DW$23        .dwtag  DW_TAG_variable
    1108                      .dwattr $C$DW$23, DW_AT_name("Cpld")
    1109                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_Cpld")
    1110                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$42)
    1111                      .dwattr $C$DW$23, DW_AT_location[DW_OP_breg20 -2]
    1112              
    1113              $C$DW$24        .dwtag  DW_TAG_variable
    1114                      .dwattr $C$DW$24, DW_AT_name("Addr")
    1115                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_Addr")
    1116                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Xintf.asm        PAGE   23

    1117                      .dwattr $C$DW$24, DW_AT_location[DW_OP_breg20 -3]
    1118              
    1119 0000019b 9643          MOV       *-SP[3],AL            ; [CPU_ALU] |265| 
    1120                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Xintf.c",line 266,column 22,is_stmt,isa 0
    1121              ;----------------------------------------------------------------------
    1122              ; 266 | volatile Byte *Cpld = &XINTF_ZONE0;                                    
    1123              ;----------------------------------------------------------------------
    1124 0000019c 8F00          MOVL      XAR4,#8192            ; [CPU_ARAU] |266| 
         0000019d 2000 
    1125 0000019e A842          MOVL      *-SP[2],XAR4          ; [CPU_ALU] |266| 
    1126                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Xintf.c",line 268,column 2,is_stmt,isa 0
    1127              ;----------------------------------------------------------------------
    1128              ; 268 | return Cpld[Addr];                                                     
    1129              ;----------------------------------------------------------------------
    1130 0000019f 5843          MOVZ      AR0,*-SP[3]           ; [CPU_ALU] |268| 
    1131 000001a0 9294          MOV       AL,*+XAR4[AR0]        ; [CPU_ALU] |268| 
    1132                      .dwpsn  file "C:/repo/jabil2025/gpb/gpb_project_v3/Xintf.c",line 271,column 1,is_stmt,isa 0
    1133              ;----------------------------------------------------------------------
    1134              ; 271 | } // ReadCpld()                                                        
    1135              ;----------------------------------------------------------------------
    1136 000001a1 FE84          SUBB      SP,#4                 ; [CPU_ARAU] 
    1137                      .dwcfi  cfa_offset, -2
    1138              $C$DW$25        .dwtag  DW_TAG_TI_branch
    1139                      .dwattr $C$DW$25, DW_AT_low_pc(0x00)
    1140                      .dwattr $C$DW$25, DW_AT_TI_return
    1141              
    1142 000001a2 0006          LRETR     ; [CPU_ALU] 
    1143                      ; return occurs ; [] 
    1144                      .dwattr $C$DW$21, DW_AT_TI_end_file("C:/repo/jabil2025/gpb/gpb_project_v3/Xintf.c")
    1145                      .dwattr $C$DW$21, DW_AT_TI_end_line(0x10f)
    1146                      .dwattr $C$DW$21, DW_AT_TI_end_column(0x01)
    1147                      .dwendentry
    1148                      .dwendtag $C$DW$21
    1149              
    1150              ;**************************************************************
    1151              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1152              ;**************************************************************
    1153                      .global _XintfRegs
    1154              
    1155              ;***************************************************************
    1156              ;* TYPE INFORMATION                                            *
    1157              ;***************************************************************
    1158              
    1159              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1160                      .dwattr $C$DW$T$20, DW_AT_name("XBANK_BITS")
    1161                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    1162              $C$DW$26        .dwtag  DW_TAG_member
    1163                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
    1164                      .dwattr $C$DW$26, DW_AT_name("BANK")
    1165                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_BANK")
    1166                      .dwattr $C$DW$26, DW_AT_bit_offset(0x0d)
    1167                      .dwattr $C$DW$26, DW_AT_bit_size(0x03)
    1168                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1169                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
    1170              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Xintf.asm        PAGE   24

    1171              $C$DW$27        .dwtag  DW_TAG_member
    1172                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
    1173                      .dwattr $C$DW$27, DW_AT_name("BCYC")
    1174                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_BCYC")
    1175                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0a)
    1176                      .dwattr $C$DW$27, DW_AT_bit_size(0x03)
    1177                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1178                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
    1179              
    1180              $C$DW$28        .dwtag  DW_TAG_member
    1181                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
    1182                      .dwattr $C$DW$28, DW_AT_name("rsvd")
    1183                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_rsvd")
    1184                      .dwattr $C$DW$28, DW_AT_bit_offset(0x00)
    1185                      .dwattr $C$DW$28, DW_AT_bit_size(0x0a)
    1186                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1187                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
    1188              
    1189                      .dwendtag $C$DW$T$20
    1190              
    1191              
    1192              $C$DW$T$21      .dwtag  DW_TAG_union_type
    1193                      .dwattr $C$DW$T$21, DW_AT_name("XBANK_REG")
    1194                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1195              $C$DW$29        .dwtag  DW_TAG_member
    1196                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
    1197                      .dwattr $C$DW$29, DW_AT_name("all")
    1198                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_all")
    1199                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1200                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
    1201              
    1202              $C$DW$30        .dwtag  DW_TAG_member
    1203                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$20)
    1204                      .dwattr $C$DW$30, DW_AT_name("bit")
    1205                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_bit")
    1206                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1207                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
    1208              
    1209                      .dwendtag $C$DW$T$21
    1210              
    1211              
    1212              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1213                      .dwattr $C$DW$T$22, DW_AT_name("XINTCNF2_BITS")
    1214                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    1215              $C$DW$31        .dwtag  DW_TAG_member
    1216                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
    1217                      .dwattr $C$DW$31, DW_AT_name("WRBUFF")
    1218                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_WRBUFF")
    1219                      .dwattr $C$DW$31, DW_AT_bit_offset(0x0e)
    1220                      .dwattr $C$DW$31, DW_AT_bit_size(0x02)
    1221                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1222                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
    1223              
    1224              $C$DW$32        .dwtag  DW_TAG_member
    1225                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Xintf.asm        PAGE   25

    1226                      .dwattr $C$DW$32, DW_AT_name("CLKMODE")
    1227                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_CLKMODE")
    1228                      .dwattr $C$DW$32, DW_AT_bit_offset(0x0d)
    1229                      .dwattr $C$DW$32, DW_AT_bit_size(0x01)
    1230                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1231                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
    1232              
    1233              $C$DW$33        .dwtag  DW_TAG_member
    1234                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
    1235                      .dwattr $C$DW$33, DW_AT_name("CLKOFF")
    1236                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_CLKOFF")
    1237                      .dwattr $C$DW$33, DW_AT_bit_offset(0x0c)
    1238                      .dwattr $C$DW$33, DW_AT_bit_size(0x01)
    1239                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1240                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
    1241              
    1242              $C$DW$34        .dwtag  DW_TAG_member
    1243                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
    1244                      .dwattr $C$DW$34, DW_AT_name("rsvd1")
    1245                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_rsvd1")
    1246                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0a)
    1247                      .dwattr $C$DW$34, DW_AT_bit_size(0x02)
    1248                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1249                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
    1250              
    1251              $C$DW$35        .dwtag  DW_TAG_member
    1252                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
    1253                      .dwattr $C$DW$35, DW_AT_name("WLEVEL")
    1254                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_WLEVEL")
    1255                      .dwattr $C$DW$35, DW_AT_bit_offset(0x08)
    1256                      .dwattr $C$DW$35, DW_AT_bit_size(0x02)
    1257                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1258                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
    1259              
    1260              $C$DW$36        .dwtag  DW_TAG_member
    1261                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
    1262                      .dwattr $C$DW$36, DW_AT_name("MPNMC")
    1263                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_MPNMC")
    1264                      .dwattr $C$DW$36, DW_AT_bit_offset(0x07)
    1265                      .dwattr $C$DW$36, DW_AT_bit_size(0x01)
    1266                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1267                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
    1268              
    1269              $C$DW$37        .dwtag  DW_TAG_member
    1270                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
    1271                      .dwattr $C$DW$37, DW_AT_name("HOLD")
    1272                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_HOLD")
    1273                      .dwattr $C$DW$37, DW_AT_bit_offset(0x06)
    1274                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
    1275                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1276                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
    1277              
    1278              $C$DW$38        .dwtag  DW_TAG_member
    1279                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
    1280                      .dwattr $C$DW$38, DW_AT_name("HOLDS")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Xintf.asm        PAGE   26

    1281                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_HOLDS")
    1282                      .dwattr $C$DW$38, DW_AT_bit_offset(0x05)
    1283                      .dwattr $C$DW$38, DW_AT_bit_size(0x01)
    1284                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1285                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
    1286              
    1287              $C$DW$39        .dwtag  DW_TAG_member
    1288                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
    1289                      .dwattr $C$DW$39, DW_AT_name("HOLDAS")
    1290                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_HOLDAS")
    1291                      .dwattr $C$DW$39, DW_AT_bit_offset(0x04)
    1292                      .dwattr $C$DW$39, DW_AT_bit_size(0x01)
    1293                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1294                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
    1295              
    1296              $C$DW$40        .dwtag  DW_TAG_member
    1297                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
    1298                      .dwattr $C$DW$40, DW_AT_name("rsvd2")
    1299                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_rsvd2")
    1300                      .dwattr $C$DW$40, DW_AT_bit_offset(0x00)
    1301                      .dwattr $C$DW$40, DW_AT_bit_size(0x04)
    1302                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1303                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
    1304              
    1305              $C$DW$41        .dwtag  DW_TAG_member
    1306                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
    1307                      .dwattr $C$DW$41, DW_AT_name("XTIMCLK")
    1308                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_XTIMCLK")
    1309                      .dwattr $C$DW$41, DW_AT_bit_offset(0x0d)
    1310                      .dwattr $C$DW$41, DW_AT_bit_size(0x03)
    1311                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1312                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
    1313              
    1314              $C$DW$42        .dwtag  DW_TAG_member
    1315                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
    1316                      .dwattr $C$DW$42, DW_AT_name("rsvd3")
    1317                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_rsvd3")
    1318                      .dwattr $C$DW$42, DW_AT_bit_offset(0x00)
    1319                      .dwattr $C$DW$42, DW_AT_bit_size(0x0d)
    1320                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1321                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
    1322              
    1323                      .dwendtag $C$DW$T$22
    1324              
    1325              
    1326              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1327                      .dwattr $C$DW$T$24, DW_AT_name("XINTCNF2_REG")
    1328                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1329              $C$DW$43        .dwtag  DW_TAG_member
    1330                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$23)
    1331                      .dwattr $C$DW$43, DW_AT_name("all")
    1332                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_all")
    1333                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1334                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
    1335              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Xintf.asm        PAGE   27

    1336              $C$DW$44        .dwtag  DW_TAG_member
    1337                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$22)
    1338                      .dwattr $C$DW$44, DW_AT_name("bit")
    1339                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_bit")
    1340                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1341                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
    1342              
    1343                      .dwendtag $C$DW$T$24
    1344              
    1345              
    1346              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1347                      .dwattr $C$DW$T$28, DW_AT_name("XINTF_REGS")
    1348                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x20)
    1349              $C$DW$45        .dwtag  DW_TAG_member
    1350                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$30)
    1351                      .dwattr $C$DW$45, DW_AT_name("XTIMING0")
    1352                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_XTIMING0")
    1353                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1354                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
    1355              
    1356              $C$DW$46        .dwtag  DW_TAG_member
    1357                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$30)
    1358                      .dwattr $C$DW$46, DW_AT_name("XTIMING1")
    1359                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_XTIMING1")
    1360                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1361                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1362              
    1363              $C$DW$47        .dwtag  DW_TAG_member
    1364                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$30)
    1365                      .dwattr $C$DW$47, DW_AT_name("XTIMING2")
    1366                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_XTIMING2")
    1367                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1368                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
    1369              
    1370              $C$DW$48        .dwtag  DW_TAG_member
    1371                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$25)
    1372                      .dwattr $C$DW$48, DW_AT_name("rsvd1")
    1373                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_rsvd1")
    1374                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1375                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1376              
    1377              $C$DW$49        .dwtag  DW_TAG_member
    1378                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$30)
    1379                      .dwattr $C$DW$49, DW_AT_name("XTIMING6")
    1380                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_XTIMING6")
    1381                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1382                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1383              
    1384              $C$DW$50        .dwtag  DW_TAG_member
    1385                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$30)
    1386                      .dwattr $C$DW$50, DW_AT_name("XTIMING7")
    1387                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_XTIMING7")
    1388                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1389                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1390              
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Xintf.asm        PAGE   28

    1391              $C$DW$51        .dwtag  DW_TAG_member
    1392                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$26)
    1393                      .dwattr $C$DW$51, DW_AT_name("rsvd2")
    1394                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_rsvd2")
    1395                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1396                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1397              
    1398              $C$DW$52        .dwtag  DW_TAG_member
    1399                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$24)
    1400                      .dwattr $C$DW$52, DW_AT_name("XINTCNF2")
    1401                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_XINTCNF2")
    1402                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1403                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1404              
    1405              $C$DW$53        .dwtag  DW_TAG_member
    1406                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$23)
    1407                      .dwattr $C$DW$53, DW_AT_name("rsvd3")
    1408                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_rsvd3")
    1409                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1410                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1411              
    1412              $C$DW$54        .dwtag  DW_TAG_member
    1413                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$21)
    1414                      .dwattr $C$DW$54, DW_AT_name("XBANK")
    1415                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_XBANK")
    1416                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1417                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1418              
    1419              $C$DW$55        .dwtag  DW_TAG_member
    1420                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
    1421                      .dwattr $C$DW$55, DW_AT_name("rsvd4")
    1422                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_rsvd4")
    1423                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1424                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1425              
    1426              $C$DW$56        .dwtag  DW_TAG_member
    1427                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
    1428                      .dwattr $C$DW$56, DW_AT_name("XREVISION")
    1429                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_XREVISION")
    1430                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1431                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1432              
    1433              $C$DW$57        .dwtag  DW_TAG_member
    1434                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$27)
    1435                      .dwattr $C$DW$57, DW_AT_name("rsvd5")
    1436                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_rsvd5")
    1437                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1438                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1439              
    1440                      .dwendtag $C$DW$T$28
    1441              
    1442              $C$DW$58        .dwtag  DW_TAG_TI_far_type
    1443                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$28)
    1444              
    1445              $C$DW$T$35      .dwtag  DW_TAG_volatile_type
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Xintf.asm        PAGE   29

    1446                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$58)
    1447              
    1448              
    1449              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1450                      .dwattr $C$DW$T$29, DW_AT_name("XTIMING_BITS")
    1451                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1452              $C$DW$59        .dwtag  DW_TAG_member
    1453                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
    1454                      .dwattr $C$DW$59, DW_AT_name("XWRTRAIL")
    1455                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_XWRTRAIL")
    1456                      .dwattr $C$DW$59, DW_AT_bit_offset(0x0e)
    1457                      .dwattr $C$DW$59, DW_AT_bit_size(0x02)
    1458                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1459                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1460              
    1461              $C$DW$60        .dwtag  DW_TAG_member
    1462                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
    1463                      .dwattr $C$DW$60, DW_AT_name("XWRACTIVE")
    1464                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_XWRACTIVE")
    1465                      .dwattr $C$DW$60, DW_AT_bit_offset(0x0b)
    1466                      .dwattr $C$DW$60, DW_AT_bit_size(0x03)
    1467                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1468                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1469              
    1470              $C$DW$61        .dwtag  DW_TAG_member
    1471                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
    1472                      .dwattr $C$DW$61, DW_AT_name("XWRLEAD")
    1473                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_XWRLEAD")
    1474                      .dwattr $C$DW$61, DW_AT_bit_offset(0x09)
    1475                      .dwattr $C$DW$61, DW_AT_bit_size(0x02)
    1476                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1477                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1478              
    1479              $C$DW$62        .dwtag  DW_TAG_member
    1480                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
    1481                      .dwattr $C$DW$62, DW_AT_name("XRDTRAIL")
    1482                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_XRDTRAIL")
    1483                      .dwattr $C$DW$62, DW_AT_bit_offset(0x07)
    1484                      .dwattr $C$DW$62, DW_AT_bit_size(0x02)
    1485                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1486                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1487              
    1488              $C$DW$63        .dwtag  DW_TAG_member
    1489                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
    1490                      .dwattr $C$DW$63, DW_AT_name("XRDACTIVE")
    1491                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_XRDACTIVE")
    1492                      .dwattr $C$DW$63, DW_AT_bit_offset(0x04)
    1493                      .dwattr $C$DW$63, DW_AT_bit_size(0x03)
    1494                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1495                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1496              
    1497              $C$DW$64        .dwtag  DW_TAG_member
    1498                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
    1499                      .dwattr $C$DW$64, DW_AT_name("XRDLEAD")
    1500                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_XRDLEAD")
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Xintf.asm        PAGE   30

    1501                      .dwattr $C$DW$64, DW_AT_bit_offset(0x02)
    1502                      .dwattr $C$DW$64, DW_AT_bit_size(0x02)
    1503                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1504                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1505              
    1506              $C$DW$65        .dwtag  DW_TAG_member
    1507                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
    1508                      .dwattr $C$DW$65, DW_AT_name("USEREADY")
    1509                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_USEREADY")
    1510                      .dwattr $C$DW$65, DW_AT_bit_offset(0x01)
    1511                      .dwattr $C$DW$65, DW_AT_bit_size(0x01)
    1512                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1513                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1514              
    1515              $C$DW$66        .dwtag  DW_TAG_member
    1516                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1517                      .dwattr $C$DW$66, DW_AT_name("READYMODE")
    1518                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_READYMODE")
    1519                      .dwattr $C$DW$66, DW_AT_bit_offset(0x00)
    1520                      .dwattr $C$DW$66, DW_AT_bit_size(0x01)
    1521                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1522                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1523              
    1524              $C$DW$67        .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1526                      .dwattr $C$DW$67, DW_AT_name("XSIZE")
    1527                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_XSIZE")
    1528                      .dwattr $C$DW$67, DW_AT_bit_offset(0x0e)
    1529                      .dwattr $C$DW$67, DW_AT_bit_size(0x02)
    1530                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1531                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1532              
    1533              $C$DW$68        .dwtag  DW_TAG_member
    1534                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1535                      .dwattr $C$DW$68, DW_AT_name("rsvd1")
    1536                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_rsvd1")
    1537                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0a)
    1538                      .dwattr $C$DW$68, DW_AT_bit_size(0x04)
    1539                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1540                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1541              
    1542              $C$DW$69        .dwtag  DW_TAG_member
    1543                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1544                      .dwattr $C$DW$69, DW_AT_name("X2TIMING")
    1545                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_X2TIMING")
    1546                      .dwattr $C$DW$69, DW_AT_bit_offset(0x09)
    1547                      .dwattr $C$DW$69, DW_AT_bit_size(0x01)
    1548                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1549                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1550              
    1551              $C$DW$70        .dwtag  DW_TAG_member
    1552                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1553                      .dwattr $C$DW$70, DW_AT_name("rsvd3")
    1554                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_rsvd3")
    1555                      .dwattr $C$DW$70, DW_AT_bit_offset(0x00)
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Xintf.asm        PAGE   31

    1556                      .dwattr $C$DW$70, DW_AT_bit_size(0x09)
    1557                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1558                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1559              
    1560                      .dwendtag $C$DW$T$29
    1561              
    1562              
    1563              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1564                      .dwattr $C$DW$T$30, DW_AT_name("XTIMING_REG")
    1565                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    1566              $C$DW$71        .dwtag  DW_TAG_member
    1567                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$23)
    1568                      .dwattr $C$DW$71, DW_AT_name("all")
    1569                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_all")
    1570                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1571                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1572              
    1573              $C$DW$72        .dwtag  DW_TAG_member
    1574                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$29)
    1575                      .dwattr $C$DW$72, DW_AT_name("bit")
    1576                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_bit")
    1577                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1578                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1579              
    1580                      .dwendtag $C$DW$T$30
    1581              
    1582              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1583                      .dwattr $C$DW$T$2, DW_AT_name("void")
    1584              
    1585              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1586                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1587                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1588                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1589              
    1590              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1591                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1592                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1593                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1594              
    1595              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1596                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1597                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1598                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1599              
    1600              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1601                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1602                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1603                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1604              
    1605              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1606                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1607                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1608                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1609              
    1610              $C$DW$T$9       .dwtag  DW_TAG_base_type
TMS320C2000 Assembler PC v22.6.2 Tue Apr  8 10:05:53 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:/repo/jabil2025/gpb/gpb_project_v3/projects/Debug/Xintf.asm        PAGE   32

    1611                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1612                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1613                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1614              
    1615              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1616                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1617                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1618                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1619              
    1620              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1621                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1622                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1623                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1624              
    1625              $C$DW$T$39      .dwtag  DW_TAG_typedef
    1626                      .dwattr $C$DW$T$39, DW_AT_name("Byte")
    1627                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$11)
    1628                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1629              
    1630              $C$DW$73        .dwtag  DW_TAG_TI_far_type
    1631                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$39)
    1632              
    1633              $C$DW$T$41      .dwtag  DW_TAG_volatile_type
    1634                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$73)
    1635              
    1636              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    1637                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1638                      .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    1639              
